[{"source":"Twitter for iPhone","text":"...The Fake News Media nowadays not only doesn’t check for the accuracy of the facts, they knowingly make up the facts. They even make up sources in order to protect their partners, the Democrats. It is so wrong, but they don’t ev                                                              en care anymore. They have gone totally CRAZY!!!!","created_at":"Sun Sep 22 00:04:46 +0000 2019","    retweet_count":10734,"favorite_count":41384,"is_retweet":false,"id_str":"1175561537458757632"},{"source":"Twitter for iPhone","text":"Some of the best Economic Numbers our Country has ever experienced are happening right now. This is despite a Crooked and Demented Deep State, and a probably illegal Democrat/Fake News Media Partnership the likes of which the world has never seen. MAKE AMERICA GREAT AGAIN!","created_at":"Sat Sep 21 19:28:32 +0000 2019","retweet_count":14749,"favorite_count":53283,"is_retweet":false,"id_str":"1175492022662287361"},{"source":"Twitter for iPhone","text":"Now that the Democrats and the Fake News Media have gone “bust” on every other of their Witch Hunt schemes, they are trying to start one just as ridiculous as the others, call it the Ukraine Witch Hunt, while at the same time trying to protect Sleepy Joe Biden. Will fail again!","created_at":"Sat Sep 21 14:02:16 +0000 2019","retweet_count":17208,"favorite_count":62774,"is_retweet":false,"id_str":"1175409914384125952"},{"source":"Twitter for iPhone","text":"....story about me and a perfectly fine and routine conversation I had with the new President of the Ukraine. Nothing was said that was in any way wrong, but Biden’s demand, on the other hand, was a complete and total disaster. The Fake News knows this but doesn’t want to report!","created_at":"Sat Sep 21 12:31:36 +0000 2019","retweet_count":14771,"favorite_count":57117,"is_retweet":false,"id_str":"1175387096649011200"},{"source":"Twitter for iPhone","text":"The Fake News Media and their partner, the Democrat Party, want to stay as far away as possible from the Joe Biden demand that the Ukrainian Government fire a prosecutor who was investigating his son, or they won’t get a very large amount of U.S. money, so they fabricate a.....","created_at":"Sat Sep 21 12:31:35 +0000 2019","retweet_count":17042,"favorite_count":62997,"is_retweet":false,"id_str":"1175387095814348802"},{"source":"Twitter for iPhone","text":"The Radical Left Democrats and their Fake News Media partners, headed up again by Little Adam Schiff, and batting Zero for 21 against me, are at it again! They think I may have had a “dicey” conversation with a certain foreign leader based on a “highly partisan” whistleblowers..","created_at":"Fri Sep 20 12:27:52 +0000 2019","retweet_count":17944,"favorite_count":74450,"is_retweet":false,"id_str":"1175023772375683074"},{"source":"Twitter for iPhone","text":"Another Fake News story out there - It never ends! Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. No problem!","created_at":"Thu Sep 19 14:47:30 +0000 2019","retweet_count":21239,"favorite_count":94942,"is_retweet":false,"id_str":"1174696521310363649"},{"source":"Twitter for iPhone","text":"“The New York Times walks back report on Kavanaugh assault claim.” @foxandfriends  The one who is actually being assaulted is Justice Kavanaugh - Assaulted by lies and Fake News! This is all about the LameStream Media working with their partner, the Dems.","created_at":"Mon Sep 16 12:06:37 +0000 2019","retweet_count":14178,"favorite_count":50180,"is_retweet":false,"id_str":"1173568871481171974"},{"source":"Twitter for iPhone","text":"The Fake News is saying that I am willing to meet with Iran, “No Conditions.” That is an incorrect statement (as usual!).","created_at":"Sun Sep 15 23:02:16 +0000 2019","retweet_count":19000,"favorite_count":74690,"is_retweet":false,"id_str":"1173371482812162048"},{"source":"Twitter for iPhone","text":"....Then, on top of it all, Kathleen Parker, of all people, wrote “In Case You Were Wondering, Trump Won The Debate.” True, but what is going on at the @washingtonpost? NOT Fake News!","created_at":"Sun Sep 15 18:49:55 +0000 2019","retweet_count":10059,"favorite_count":45592,"is_retweet":false,"id_str":"1173307978591739904"},{"source":"Twitter for iPhone","text":"Who the hell is Joy-Ann Reid? Never met her, she knows ZERO about me, has NO talent, and truly doesn’t have the “it” factor needed for success in showbiz. Had a bad reputation, and now works for the Comcast/NBC losers making up phony stories about me. Low Ratings. Fake News!","created_at":"Sat Sep 14 13:04:10 +0000 2019","retweet_count":19049,"favorite_count":90761,"is_retweet":false,"id_str":"1172858577951821825"},{"source":"Twitter for iPhone","text":"If it weren’t for the never ending Fake News about me, and with all that I have done (more than any other President in the first 2 1/2 years!), I would be leading the “Partners” of the LameStream Media by 20 points. Sorry, but true!","created_at":"Wed Sep 11 12:19:45 +0000 2019","retweet_count":14265,"favorite_count":70523,"is_retweet":false,"id_str":"1171760235935125508"},{"source":"Twitter for iPhone","text":"....This is a phony suppression poll, meant to build up their Democrat partners. I haven’t even started campaigning yet, and am constantly fighting Fake News like Russia, Russia, Russia. Look at North Carolina last night. Dan Bishop, down big in the Polls, WINS. Easier than 2016!","created_at":"Wed Sep 11 12:12:58 +0000 2019","retweet_count":11365,"favorite_count":58257,"is_retweet":false,"id_str":"1171758532280143873"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: Greg Murphy won big, 62% to 37%, in North Carolina 03, &amp; the Fake News barely covered the race. The win was far bigger…","created_at":"Wed Sep 11 10:54:29 +0000 2019","retweet_count":16307,"favorite_count":0,"is_retweet":true,"id_str":"1171738781025746945"},{"source":"Twitter for iPhone","text":"Greg Murphy won big, 62% to 37%, in North Carolina 03, &amp; the Fake News barely covered the race. The win was far bigger than anticipated - there was just nothing the Fakers could say to diminish or demean the scope of this victory. So we had TWO BIG VICTORIES tonight, Greg &amp; Dan!","created_at":"Wed Sep 11 05:08:48 +0000 2019","retweet_count":16311,"favorite_count":69647,"is_retweet":false,"id_str":"1171651786622537728"},{"source":"Twitter for iPhone","text":".@CNN &amp; @MSNBC were all set to have a BIG victory, until Dan Bishop won North Carolina 09. Now you will hear them barely talk about, or cover, the race. Fake News never wins!","created_at":"Wed Sep 11 03:11:35 +0000 2019","retweet_count":12930,"favorite_count":51884,"is_retweet":false,"id_str":"1171622285507289088"},{"source":"Twitter for iPhone","text":"A lot of Fake News is being reported that I overruled the VP and various advisers on a potential Camp David meeting with the Taliban. This Story is False! I always think it is good to meet and talk, but in this case I decided not to. The Dishonest Media likes to create...","created_at":"Mon Sep 09 17:49:44 +0000 2019","retweet_count":13967,"favorite_count":60782,"is_retweet":false,"id_str":"1171118506089361409"},{"source":"Twitter for iPhone","text":"Great news that an activist investor is now involved with AT&amp;T. As the owner of VERY LOW RATINGS @CNN, perhaps they will now put a stop to all of the Fake News emanating from its non-credible “anchors.” Also, I hear that, because of its bad ratings, it is losing a fortune.....","created_at":"Mon Sep 09 13:01:41 +0000 2019","retweet_count":12943,"favorite_count":54018,"is_retweet":false,"id_str":"1171046014234648576"},{"source":"Twitter for iPhone","text":"...But most importantly, @CNN is bad for the USA. Their International Division spews bad information &amp; Fake News all over the globe. This is why foreign leaders are always asking me, “Why does the Media hate the U.S. sooo much?” It is a fraudulent shame, &amp; all comes from the top!","created_at":"Mon Sep 09 13:01:41 +0000 2019","retweet_count":12348,"favorite_count":50077,"is_retweet":false,"id_str":"1171046015106990081"},{"source":"Twitter for iPhone","text":"...FAKE NEWS. I would like very much to stop referring to this ridiculous story, but the LameStream Media just won’t let it alone. They always have to have the last word, even though they know they are defrauding &amp; deceiving the public. The public knows that the Media is corrupt!","created_at":"Sat Sep 07 20:44:54 +0000 2019","retweet_count":13962,"favorite_count":65634,"is_retweet":false,"id_str":"1170437809796255745"},{"source":"Twitter for iPhone","text":"The Economy is great. The only thing adding to “uncertainty” is the Fake News!","created_at":"Fri Sep 06 14:38:38 +0000 2019","retweet_count":15933,"favorite_count":67970,"is_retweet":false,"id_str":"1169983251160731651"},{"source":"Twitter for iPhone","text":"....This nonsense has never happened to another President. Four days of corrupt reporting, still without an apology. But there are many things that the Fake News Media has not apologized to me for, like the Witch Hunt, or SpyGate! The LameStream Media and their Democrat.....","created_at":"Fri Sep 06 14:29:46 +0000 2019","retweet_count":10528,"favorite_count":50163,"is_retweet":false,"id_str":"1169981019228913664"},{"source":"Twitter for iPhone","text":"The Fake News Media was fixated on the fact that I properly said, at the beginnings of Hurricane Dorian, that in addition to Florida &amp; other states, Alabama may also be grazed or hit. They went Crazy, hoping against hope that I made a mistake (which I didn’t). Check out maps.....","created_at":"Fri Sep 06 14:29:46 +0000 2019","retweet_count":12622,"favorite_count":59950,"is_retweet":false,"id_str":"1169981017794535432"},{"source":"Twitter for iPhone","text":"I was with you all the way Alabama. The Fake News Media was not! https://t.co/gO5pwahaj9","created_at":"Thu Sep 05 20:18:07 +0000 2019","retweet_count":14639,"favorite_count":57914,"is_retweet":false,"id_str":"1169706294242136073"},{"source":"Twitter for iPhone","text":"Just as I said, Alabama was originally projected to be hit. The Fake News denies it! https://t.co/elJ7ROfm2p","created_at":"Thu Sep 05 20:14:05 +0000 2019","retweet_count":11899,"favorite_count":48729,"is_retweet":false,"id_str":"1169705282123046913"},{"source":"Twitter for iPhone","text":"Alabama was going to be hit or grazed, and then Hurricane Dorian took a different path (up along the East Coast). The Fake News knows this very well. That’s why they’re the Fake News!","created_at":"Thu Sep 05 13:39:49 +0000 2019","retweet_count":10730,"favorite_count":48979,"is_retweet":false,"id_str":"1169606058148605953"},{"source":"Twitter for iPhone","text":"....said what she did, even being on a much higher rated show, she would have been thrown off television. Will Fake News NBC allow a McCarthy style Racist to continue? ABC fired Roseanne. Watch the double standard!","created_at":"Thu Sep 05 13:15:54 +0000 2019","retweet_count":20277,"favorite_count":82619,"is_retweet":false,"id_str":"1169600039188160512"},{"source":"Twitter for iPhone","text":"....Instead it turned North and went up the coast, where it continues now. In the one model through Florida, the Great State of Alabama would have been hit or grazed. In the path it took, no. Read my FULL FEMA statement. What I said was accurate! All Fake News in order to demean!","created_at":"Thu Sep 05 11:48:56 +0000 2019","retweet_count":9790,"favorite_count":54765,"is_retweet":false,"id_str":"1169578155948072962"},{"source":"Twitter for iPhone","text":"This was the originally projected path of the Hurricane in its early stages. As you can see, almost all models predicted it to go through Florida also hitting Georgia and Alabama. I accept the Fake News apologies! https://t.co/0uCT0Qvyo6","created_at":"Wed Sep 04 22:23:51 +0000 2019","retweet_count":14112,"favorite_count":59775,"is_retweet":false,"id_str":"1169375550806351872"},{"source":"Twitter for iPhone","text":"8 FACTS that #FakeNewsCNN will ignore in tonight’s “Climate Forum”","created_at":"Wed Sep 04 21:08:57 +0000 2019","retweet_count":15057,"favorite_count":57280,"is_retweet":false,"id_str":"1169356701943894017"},{"source":"Twitter for iPhone","text":"....when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some “hurt.” Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!","created_at":"Mon Sep 02 23:16:52 +0000 2019","retweet_count":14230,"favorite_count":72954,"is_retweet":false,"id_str":"1168664116095082496"},{"source":"Twitter for iPhone","text":"....when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some “hurt.” Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!","created_at":"Mon Sep 02 23:12:29 +0000 2019","retweet_count":1321,"favorite_count":4747,"is_retweet":false,"id_str":"1168663013806792704"},{"source":"Twitter for iPhone","text":"....The good news is that we are winning. Our real opponent is not the Democrats, or the dwindling number of Republicans that lost their way and got left behind, our primary opponent is the Fake News Media. In the history of our Country, they have never been so bad!","created_at":"Mon Sep 02 12:22:11 +0000 2019","retweet_count":15633,"favorite_count":67148,"is_retweet":false,"id_str":"1168499357131427840"},{"source":"Twitter for iPhone","text":"The totally inaccurate reporting by Lawrence O’Donnell, for which he has been forced by NBC to apologize, is NO DIFFERENT than the horrible, corrupt and fraudulent Fake News that I (and many millions of GREAT supporters) have had to put up with for years. So bad for the USA!","created_at":"Thu Aug 29 11:47:57 +0000 2019","retweet_count":23650,"favorite_count":97525,"is_retweet":false,"id_str":"1167041192539959296"},{"source":"Twitter for iPhone","text":"There has never been a time in the history of our Country that the Media was so Fraudulent, Fake, or Corrupt! When the “Age of Trump” is looked back on many years from now, I only hope that a big part of my legacy will be the exposing of massive dishonesty in the Fake News!","created_at":"Thu Aug 29 00:35:10 +0000 2019","retweet_count":35597,"favorite_count":145329,"is_retweet":false,"id_str":"1166871882764824577"},{"source":"Twitter for iPhone","text":"Another totally Fake story in the Amazon Washington Post (lobbyist) which states that if my Aides broke the law to build the Wall (which is going up rapidly), I would give them a Pardon. This was made up by the Washington Post only in order to demean and disparage - FAKE NEWS!","created_at":"Wed Aug 28 19:06:39 +0000 2019","retweet_count":20220,"favorite_count":79380,"is_retweet":false,"id_str":"1166789207215484928"},{"source":"Twitter for iPhone","text":"They do stories so big on Elizabeth “Pocahontas” Warren’s crowd sizes, adding many more people than are actually there, and yet my crowds, which are far bigger, get no coverage at all. Fake News!","created_at":"Tue Aug 27 22:04:01 +0000 2019","retweet_count":16665,"favorite_count":76189,"is_retweet":false,"id_str":"1166471454705274880"},{"source":"Twitter for iPhone","text":"The G7 in France was so successful, and yet when I came back and read the Corrupt and Fake News, and watched numerous networks, it was not even recognizable from what actually took place at the Great G7 event!","created_at":"Tue Aug 27 21:46:49 +0000 2019","retweet_count":17914,"favorite_count":77084,"is_retweet":false,"id_str":"1166467125155905539"},{"source":"Twitter for iPhone","text":"The G-7 was a great success for the USA and all. LameStream Media coverage bore NO relationship to what actually happened in France - FAKE NEWS. It was GREAT!","created_at":"Tue Aug 27 14:45:26 +0000 2019","retweet_count":14882,"favorite_count":68656,"is_retweet":false,"id_str":"1166361079716503553"},{"source":"Twitter for iPhone","text":"Just returned to Washington from France and the very successful G-7, only to find that the Fake News is still trying to perpetuate the phony story that I wanted to use Nuclear weapons to blow up hurricanes before they reach shore. This is so ridiculous, never happened!","created_at":"Tue Aug 27 02:30:17 +0000 2019","retweet_count":30244,"favorite_count":140341,"is_retweet":false,"id_str":"1166176076952940544"},{"source":"Twitter for iPhone","text":"The story by Axios that President Trump wanted to blow up large hurricanes with nuclear weapons prior to reaching shore is ridiculous. I never said this. Just more FAKE NEWS!","created_at":"Mon Aug 26 09:25:59 +0000 2019","retweet_count":25040,"favorite_count":102104,"is_retweet":false,"id_str":"1165918301932916736"},{"source":"Twitter for iPhone","text":"In France we are all laughing at how knowingly inaccurate the U.S. reporting of events and conversations at the G-7 is. These Leaders, and many others, are getting a major case study of Fake News at it’s finest! They’ve got it all wrong, from Iran, to China Tariffs, to Boris!","created_at":"Sun Aug 25 23:10:47 +0000 2019","retweet_count":22858,"favorite_count":86619,"is_retweet":false,"id_str":"1165763483322834944"},{"source":"Twitter for iPhone","text":"Such False and Inaccurate reporting thus far on the G-7. The Fake News knows this but they can’t help themselves! Leaving now to have breakfast with Boris J.","created_at":"Sun Aug 25 05:45:18 +0000 2019","retweet_count":14731,"favorite_count":70783,"is_retweet":false,"id_str":"1165500375870427136"},{"source":"Twitter for iPhone","text":"....having fun. I was smiling as I looked up and around. The MANY reporters with me were smiling also. They knew the TRUTH...And yet when I saw the reporting, CNN, MSNBC and other Fake News outlets covered it as serious news &amp; me thinking of myself as the Messiah. No more trust!","created_at":"Sat Aug 24 15:00:34 +0000 2019","retweet_count":21192,"favorite_count":115039,"is_retweet":false,"id_str":"1165277727123025920"},{"source":"Twitter for iPhone","text":"For all of the Fake News Reporters that don’t have a clue as to what the law is relative to Presidential powers, China, etc., try looking at the Emergency Economic Powers Act of 1977. Case closed!","created_at":"Sat Aug 24 03:58:32 +0000 2019","retweet_count":23571,"favorite_count":91740,"is_retweet":false,"id_str":"1165111122510237696"},{"source":"Twitter for iPhone","text":"Other good polls also in fifties, despite only Fake News, and then phony polls by A.P., CNN, NBC and, as always, Fox, who were WAY OFF on 2016 Election! https://t.co/DksmF8hTr7","created_at":"Sat Aug 24 01:19:38 +0000 2019","retweet_count":12205,"favorite_count":50733,"is_retweet":false,"id_str":"1165071131608571904"},{"source":"Twitter for iPhone","text":"This despite the Fake News and Polls! https://t.co/DksmF8hTr7","created_at":"Fri Aug 23 11:29:06 +0000 2019","retweet_count":16110,"favorite_count":67670,"is_retweet":false,"id_str":"1164862120447664128"},{"source":"Twitter for iPhone","text":"The Economy is strong and good, whereas the rest of the world is not doing so well. Despite this the Fake News Media, together with their Partner, the Democrat Party, are working overtime to convince people that we are in, or will soon be going into, a Recession. They are.....","created_at":"Fri Aug 23 11:24:51 +0000 2019","retweet_count":18054,"favorite_count":80117,"is_retweet":false,"id_str":"1164861052611420160"},{"source":"Twitter for iPhone","text":"The Fake News LameStream Media is doing everything possible the “create” a U.S. recession, even though the numbers &amp; facts are working totally in the opposite direction. They would be willing to hurt many people, but that doesn’t matter to them. Our Economy is sooo strong, sorry!","created_at":"Wed Aug 21 12:32:37 +0000 2019","retweet_count":17634,"favorite_count":64105,"is_retweet":false,"id_str":"1164153329196384256"},{"source":"Twitter for iPhone","text":"The LameStream Media is far beyond Fake News, they are treading in very dangerous territory! https://t.co/J60JgSFhcx","created_at":"Tue Aug 20 15:33:03 +0000 2019","retweet_count":15465,"favorite_count":58751,"is_retweet":false,"id_str":"1163836348819750912"},{"source":"Twitter for iPhone","text":"....got fired. Wrote a very nice book about me just recently. Now the book is a lie? Said his wife was driving him crazy, “something big” was happening with her. Getting divorced. He was a mental wreck. We didn’t want him around. Now Fake News puts him on like he was my buddy!","created_at":"Mon Aug 19 13:19:46 +0000 2019","retweet_count":15061,"favorite_count":76005,"is_retweet":false,"id_str":"1163440419423825920"},{"source":"Twitter for iPhone","text":"Great cohesion inside the Republican Party, the best I have ever seen. Despite all of the Fake News, my Poll Numbers are great. New internal polls show them to be the strongest we’ve had so far! Think what they’d be if I got fair media coverage!","created_at":"Mon Aug 19 12:21:47 +0000 2019","retweet_count":19631,"favorite_count":84188,"is_retweet":false,"id_str":"1163425829331841024"},{"source":"Twitter for iPhone","text":"....got fired. Wrote a very nice book about me just recently. Now the book is a lie? Said his wife was driving him crazy, “something big” was happening with her. Getting divorced. He was a mental wreck. We didn’t want him around. Now Fake News puts him on like he was my buddy!","created_at":"Mon Aug 19 12:11:28 +0000 2019","retweet_count":4718,"favorite_count":20517,"is_retweet":false,"id_str":"1163423230398476288"},{"source":"Twitter for iPhone","text":"RT @OliverMcGee: Retweet The Lies, False Facts &amp; Fake News of @CNN's @Acosta on @POTUS!\n\nRaise Your Hand if you LOVE @realDonaldTrump has S…","created_at":"Mon Aug 19 03:27:20 +0000 2019","retweet_count":14019,"favorite_count":0,"is_retweet":true,"id_str":"1163291328299618304"},{"source":"Twitter for iPhone","text":"The Fake News Media HATES to see this! https://t.co/VMgyggOQ3Q","created_at":"Sat Aug 17 21:49:46 +0000 2019","retweet_count":19593,"favorite_count":74756,"is_retweet":false,"id_str":"1162843990061961216"},{"source":"Twitter for iPhone","text":"Biggest crowd EVER, according to Arena people. Thousands outside trying to get in. Place was packed! Radical Left Dems &amp; their Partner, LameStream Media, saying Arena empty. Check out pictures. Fake News. The Enemy of the People! https://t.co/KkZWspM93a","created_at":"Sat Aug 17 03:11:06 +0000 2019","retweet_count":20401,"favorite_count":84408,"is_retweet":false,"id_str":"1162562469283471360"},{"source":"Twitter for iPhone","text":"Walmart, a great indicator as to how the U.S. is doing, just released outstanding numbers. Our Country, unlike others, is doing great! Don’t let the Fake News convince you otherwise.","created_at":"Thu Aug 15 20:18:25 +0000 2019","retweet_count":21483,"favorite_count":91332,"is_retweet":false,"id_str":"1162096224486510592"},{"source":"Twitter for iPhone","text":"The Fake News Media is doing everything they can to crash the economy because they think that will be bad for me and my re-election. The problem they have is that the economy is way too strong and we will soon be winning big on Trade, and everyone knows that, including China!","created_at":"Thu Aug 15 16:52:53 +0000 2019","retweet_count":21570,"favorite_count":80707,"is_retweet":false,"id_str":"1162044502292537344"},{"source":"Twitter for iPhone","text":"Wow! The Deputy Editor of the Failing New York Times was just demoted. Should have been Fired! Totally biased and inaccurate reporting. The paper is a Fraud, Zero Credibility. Fake News takes another hit, but this time a big one!","created_at":"Thu Aug 15 16:30:03 +0000 2019","retweet_count":17517,"favorite_count":71305,"is_retweet":false,"id_str":"1162038755093598208"},{"source":"Twitter for iPhone","text":"It always happens! When a Conservative does even a fraction of what Chris Cuomo did with his lunatic ranting, raving, &amp; cursing, they get destroyed by the Fake News. But when a Liberal Democrat like Chris Cuomo does it, Republicans immediately come to his defense. We never learn!","created_at":"Tue Aug 13 20:41:33 +0000 2019","retweet_count":27120,"favorite_count":103209,"is_retweet":false,"id_str":"1161377272391229440"},{"source":"Twitter for iPhone","text":"Put it back up. We are living with a Rigged &amp; Fake Media! https://t.co/ZhanbGCxuX","created_at":"Tue Aug 13 17:32:14 +0000 2019","retweet_count":19889,"favorite_count":60724,"is_retweet":false,"id_str":"1161329627853414401"},{"source":"Twitter for iPhone","text":"Through massive devaluation of their currency and pumping vast sums of money into their system, the tens of billions of dollars that the U.S. is receiving is a gift from China. Prices not up, no inflation. Farmers getting more than China would be spending. Fake News won’t report!","created_at":"Tue Aug 13 12:49:05 +0000 2019","retweet_count":17124,"favorite_count":65790,"is_retweet":false,"id_str":"1161258370478858240"},{"source":"Twitter for iPhone","text":"Think how wonderful it is to be able to fight back and show, to so many, how totally dishonest the Fake News Media really is. It may be the most corrupt and disgusting business (almost) there is! MAKE AMERICA GREAT AGAIN!","created_at":"Sat Aug 10 22:27:44 +0000 2019","retweet_count":35478,"favorite_count":153105,"is_retweet":false,"id_str":"1160316831414067200"},{"source":"Twitter for iPhone","text":"Maggie Haberman of the Failing @nytimes reported that I was annoyed by the lack of cameras inside the hospitals in Dayton &amp; El Paso, when in fact I was the one who stated, very strongly, that I didn’t want the Fake News inside &amp; told my people NOT to let them in. Fake reporting!","created_at":"Sat Aug 10 11:40:48 +0000 2019","retweet_count":31230,"favorite_count":127935,"is_retweet":false,"id_str":"1160154025511280640"},{"source":"Twitter for iPhone","text":"Leaving El Paso for the White House. What GREAT people I met there and in Dayton, Ohio. The Fake News worked overtime trying to disparage me and the two trips, but it just didn’t work. The love, respect &amp; enthusiasm were there for all to see. They have been through so much. Sad!","created_at":"Thu Aug 08 00:31:52 +0000 2019","retweet_count":21529,"favorite_count":101614,"is_retweet":false,"id_str":"1159260904631836673"},{"source":"Twitter for iPhone","text":"Watching Fake News CNN is better than watching Shepard Smith, the lowest rated show on @FoxNews. Actually, whenever possible, I turn to @OANN!","created_at":"Wed Aug 07 19:55:40 +0000 2019","retweet_count":23404,"favorite_count":89797,"is_retweet":false,"id_str":"1159191398177890304"},{"source":"Twitter for iPhone","text":"“Meanwhile, the Dayton, Ohio, shooter had a history of supporting political figures like Bernie Sanders, Elizabeth Warren, and ANTIFA.” @OANN  I hope other news outlets will report this as opposed to Fake News. Thank you!","created_at":"Wed Aug 07 10:58:16 +0000 2019","retweet_count":31976,"favorite_count":107191,"is_retweet":false,"id_str":"1159056155764809729"},{"source":"Twitter for iPhone","text":"“Trump Urges Unity Vs. Racism,” was the correct description in the first headline by the Failing New York Times, but it was quickly changed to, “Assailing Hate But Not Guns,” after the Radical Left Democrats went absolutely CRAZY! Fake News - That’s what we’re up against...","created_at":"Wed Aug 07 10:32:14 +0000 2019","retweet_count":22501,"favorite_count":92089,"is_retweet":false,"id_str":"1159049603209158656"},{"source":"Twitter for iPhone","text":"The Media has a big responsibility to life and safety in our Country. Fake News has contributed greatly to the anger and rage that has built up over many years. News coverage has got to start being fair, balanced and unbiased, or these terrible problems will only get worse!","created_at":"Mon Aug 05 11:32:54 +0000 2019","retweet_count":40969,"favorite_count":153536,"is_retweet":false,"id_str":"1158340095608610816"},{"source":"Twitter for iPhone","text":"Wow! Morning Joe &amp; Psycho ratings have really crashed. Very small audience. People are tired of hearing Fake News delivered with an anger that is not to be believed. Sad, when the show was sane, they helped get me elected. Thanks! Was on all the time. Lost all of its juice!","created_at":"Tue Jul 30 12:11:02 +0000 2019","retweet_count":18877,"favorite_count":93051,"is_retweet":false,"id_str":"1156175364802142209"},{"source":"Twitter for iPhone","text":"If the Democrats are going to defend the Radical Left “Squad” and King Elijah’s Baltimore Fail, it will be a long road to 2020. The good news for the Dems is that they have the Fake News Media in their pocket!","created_at":"Mon Jul 29 11:04:40 +0000 2019","retweet_count":19285,"favorite_count":79808,"is_retweet":false,"id_str":"1155796277248057345"},{"source":"Twitter for iPhone","text":"“The kind of questions the White House Correspondents were asking is almost like they didn’t see what went on at the hearings!” @JesseBWatters  The hearings were a disaster for Robert Mueller &amp; the Democrats. Nevertheless, the Fake News Media will try to make the best out of it!","created_at":"Wed Jul 24 21:29:01 +0000 2019","retweet_count":14256,"favorite_count":59750,"is_retweet":false,"id_str":"1154141457743319040"},{"source":"Twitter for iPhone","text":"When an old Wall at the Southern Border, that is crumbling and falling over, built in an important section to keep out problems, is replaced with a brand new 30 foot high steel and concrete Wall, the Media says no new Wall has been built. Fake News! Building lots of Wall!","created_at":"Tue Jul 23 14:04:17 +0000 2019","retweet_count":17484,"favorite_count":73929,"is_retweet":false,"id_str":"1153667150458081282"},{"source":"Twitter for iPhone","text":"When we rip down and totally replace a badly broken and dilapidated Barrier on the Southern Border, something which cannot do the job, the Fake News Media gives us zero credit for building a new Wall. We have replaced many miles of old Barrier with powerful new Walls!","created_at":"Mon Jul 22 23:16:53 +0000 2019","retweet_count":20158,"favorite_count":92660,"is_retweet":false,"id_str":"1153443827946020864"},{"source":"Twitter for iPhone","text":"Fake News Equals the Enemy of the People!","created_at":"Mon Jul 22 12:38:52 +0000 2019","retweet_count":28797,"favorite_count":123532,"is_retweet":false,"id_str":"1153283267572858880"},{"source":"Twitter for iPhone","text":"The Amazon Washington Post front page story yesterday was total Fake News. They said “Advisors wrote new talking points and handed him reams of opposition research on the four Congresswomen.” Now really, does that sound like me? What advisors, there were no talking points,....","created_at":"Mon Jul 22 12:31:46 +0000 2019","retweet_count":15717,"favorite_count":71971,"is_retweet":false,"id_str":"1153281479184658433"},{"source":"Twitter for iPhone","text":"Thank you very much for revealing the incredible facts, which the Fake News Media will never do! @SteveHiltonx @NextRevFNC https://t.co/SgRnbsh5pT","created_at":"Mon Jul 22 02:55:00 +0000 2019","retweet_count":22506,"favorite_count":81806,"is_retweet":false,"id_str":"1153136333994582016"},{"source":"Twitter for iPhone","text":"....Based on the comments made by Senator Schumer, he must have seen how dangerous &amp; bad for our Country the Border is. It is not a “manufactured crisis,” as the Fake News Media &amp; their Democrat partners tried to portray. He said he wants to meet. I will set up a meeting ASAP!","created_at":"Mon Jul 22 02:16:15 +0000 2019","retweet_count":19773,"favorite_count":96564,"is_retweet":false,"id_str":"1153126580652318720"},{"source":"Twitter for iPhone","text":"The Washington Post Story, about my speech in North Carolina and tweet, with its phony sources who do not exist, is Fake News. The only thing people were talking about is the record setting crowd and the tremendous enthusiasm, far greater than the Democrats. You’ll see in 2020!","created_at":"Sun Jul 21 11:58:30 +0000 2019","retweet_count":18040,"favorite_count":79846,"is_retweet":false,"id_str":"1152910721199595520"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: Think what it would be without the 3 year Witch Hunt and Fake News Media, in partnership with the Democrats! https://t…","created_at":"Fri Jul 19 14:31:46 +0000 2019","retweet_count":28748,"favorite_count":0,"is_retweet":true,"id_str":"1152224517521059840"},{"source":"Twitter for iPhone","text":"It is amazing how the Fake News Media became “crazed” over the chant “send her back” by a packed Arena (a record) crowd in the Great State of North Carolina, but is totally calm &amp; accepting of the most vile and disgusting statements made by the three Radical Left Congresswomen...","created_at":"Fri Jul 19 12:16:21 +0000 2019","retweet_count":25663,"favorite_count":113436,"is_retweet":false,"id_str":"1152190436825604096"},{"source":"Twitter for iPhone","text":"It is amazing how the Fake News Media became “crazed” over the chant “send he back” by a packed Arena (a record) crowd in the Great State of North Carolina, but is totally calm &amp; accepting of the most vile and disgusting statements made by the three Radical Left Congresswomen....","created_at":"Fri Jul 19 12:06:21 +0000 2019","retweet_count":1992,"favorite_count":7332,"is_retweet":false,"id_str":"1152187921950236672"},{"source":"Twitter for iPhone","text":"Think what it would be without the 3 year Witch Hunt and Fake News Media, in partnership with the Democrats! https://t.co/KBtl7wde0F","created_at":"Sun Jul 14 18:31:00 +0000 2019","retweet_count":28748,"favorite_count":122779,"is_retweet":false,"id_str":"1150472779596226561"},{"source":"Twitter for iPhone","text":"RT @TexanGalCindy: #FakeNewsCNN mired in a credibility crisis as ratings continue to collapse\n#BoycottCNN\n#BoycottCNN\n#FakeNewsCNN\n#WakeUpA…","created_at":"Fri Jul 12 11:42:07 +0000 2019","retweet_count":6825,"favorite_count":0,"is_retweet":true,"id_str":"1149645107102011394"},{"source":"Twitter for iPhone","text":"...or a very nervous and skinny version of Pocahontas (1/1024th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","created_at":"Thu Jul 11 15:52:19 +0000 2019","retweet_count":11513,"favorite_count":52651,"is_retweet":false,"id_str":"1149345683138367491"},{"source":"Twitter for iPhone","text":"...The Fake News is not as important, or as powerful, as Social Media. They have lost tremendous credibility since that day in November, 2016, that I came down the escalator with the person who was to become your future First Lady. When I ultimately leave office in six...","created_at":"Thu Jul 11 15:52:18 +0000 2019","retweet_count":6270,"favorite_count":24311,"is_retweet":false,"id_str":"1149345680189722630"},{"source":"Twitter for iPhone","text":"A big subject today at the White House Social Media Summit will be the tremendous dishonesty, bias, discrimination and suppression practiced by certain companies. We will not let them get away with it much longer. The Fake News Media will also be there, but for a limited period..","created_at":"Thu Jul 11 15:52:18 +0000 2019","retweet_count":16697,"favorite_count":66417,"is_retweet":false,"id_str":"1149345678814060545"},{"source":"Twitter for iPhone","text":"The Fake News Media loves the narrative that I didn’t use many banks because the banks didn’t like me. No, I didn’t use many banks because I didn’t (don’t) need their money (old fashioned, isn’t it?). If I did, it would have been very easy for me to get.","created_at":"Thu Jul 11 11:45:01 +0000 2019","retweet_count":12174,"favorite_count":60509,"is_retweet":false,"id_str":"1149283449196417026"},{"source":"Twitter for iPhone","text":"...or a very nervous and skinny version of Pocahontas (1000/24th), as your President, rather than what you have now, so great looking and smart, a true Stable Genius! Sorry to say that even Social Media would be driven out of business along with, and finally, the Fake News Media!","created_at":"Thu Jul 11 11:30:02 +0000 2019","retweet_count":9252,"favorite_count":41668,"is_retweet":false,"id_str":"1149279679045672961"},{"source":"Twitter for iPhone","text":"....The Fake News is not as important, or as powerful, as Social Media. They have lost tremendous credibility since that day in November, 2016, that I came down the escalator with the person who was to become your future First Lady. When I ultimately leave office in six......","created_at":"Thu Jul 11 11:30:02 +0000 2019","retweet_count":3831,"favorite_count":13374,"is_retweet":false,"id_str":"1149279676587630593"},{"source":"Twitter for iPhone","text":"A big subject today at the White House Social Media Summit will be the tremendous dishonesty, bias, discrimination and suppression practiced by certain companies. We will not let them get away with it much longer. The Fake News Media will also be there, but for a limited period..","created_at":"Thu Jul 11 11:30:01 +0000 2019","retweet_count":12898,"favorite_count":51678,"is_retweet":false,"id_str":"1149279675660869632"},{"source":"Twitter for iPhone","text":"A massive crowd that Fake News &amp; some Dems didn’t want to Report! https://t.co/RiRTP2hEJc","created_at":"Mon Jul 08 14:27:04 +0000 2019","retweet_count":19293,"favorite_count":80880,"is_retweet":false,"id_str":"1148237067526254600"},{"source":"Twitter for iPhone","text":"Watching @FoxNews weekend anchors is worse than watching low ratings Fake News @CNN, or Lyin’ Brian Williams (remember when he totally fabricated a War Story trying to make himself into a hero, &amp; got fired. A very dishonest journalist!) and the crew of degenerate......","created_at":"Sun Jul 07 23:50:18 +0000 2019","retweet_count":19873,"favorite_count":84416,"is_retweet":false,"id_str":"1148016422783803392"},{"source":"Twitter for iPhone","text":"....United States Citizens first. Border Patrol, and others in Law Enforcement, have been doing a great job. We said there was a Crisis - the Fake News &amp; the Dems said it was “manufactured.” Now all agree we were right, but they always knew that. They are crowded (which we.....","created_at":"Sun Jul 07 19:48:05 +0000 2019","retweet_count":16693,"favorite_count":84191,"is_retweet":false,"id_str":"1147955463201480704"},{"source":"Twitter for iPhone","text":"The Fake News Media, in particular the Failing @nytimes, is writing phony and exaggerated accounts of the Border Detention Centers. First of all, people should not be entering our Country illegally, only for us to then have to care for them. We should be allowed to focus on .....","created_at":"Sun Jul 07 19:48:04 +0000 2019","retweet_count":23539,"favorite_count":108825,"is_retweet":false,"id_str":"1147955460403859462"},{"source":"Twitter for iPhone","text":"The Economy is the BEST IT HAS EVER BEEN! Even much of the Fake News is giving me credit for that!","created_at":"Tue Jul 02 11:50:57 +0000 2019","retweet_count":20805,"favorite_count":104414,"is_retweet":false,"id_str":"1146023450001231872"},{"source":"Twitter for iPhone","text":"Mark Levin has written a big number one bestselling book called, conspicuously and accurately, “Unfreedom of the Press.” It is a great book that tells it like it is, fake news and all. Keep this book number one!","created_at":"Tue Jul 02 11:21:38 +0000 2019","retweet_count":15643,"favorite_count":75975,"is_retweet":false,"id_str":"1146016075139702784"},{"source":"Twitter for iPhone","text":"54% in Poll! I would be at 75% (with our great economy, maybe the best ever) if not for the Phony Witch Hunt and the Fake News Media!","created_at":"Fri Jun 28 22:41:17 +0000 2019","retweet_count":28707,"favorite_count":144532,"is_retweet":false,"id_str":"1144737559786020864"},{"source":"Twitter for iPhone","text":".@NBCNews and @MSNBC should be ashamed of themselves for having such a horrible technical breakdown in the middle of the debate. Truly unprofessional and only worthy of a FAKE NEWS Organization, which they are!","created_at":"Thu Jun 27 02:06:51 +0000 2019","retweet_count":24807,"favorite_count":120198,"is_retweet":false,"id_str":"1144064520152739840"},{"source":"Twitter for iPhone","text":"According to Fake News (and low ratings) @CNN, “Democrats say hearings could change impeachment debate.” That’s because they have lost the impeachment debate (80% say NO), and they are hoping that yet another DO OVER, after 2 1/2 years and $40,000,000, will turn things around....","created_at":"Wed Jun 26 21:46:45 +0000 2019","retweet_count":14736,"favorite_count":73710,"is_retweet":false,"id_str":"1143999063613853696"},{"source":"Twitter for iPhone","text":"....”This Russia Collusion Hoax was perpetrated in part by people inside the government, and in part by a compliant (Fake News) media.” Mollie Hemingway.  @TuckerCarlson @foxandfriends  The facts are starting to pour out. Stay tuned!","created_at":"Fri Jun 21 12:19:50 +0000 2019","retweet_count":18994,"favorite_count":82440,"is_retweet":false,"id_str":"1142044452258766849"},{"source":"Twitter for iPhone","text":"If I didn’t have the Phony Witch Hunt going on for 3 years, and if the Fake News Media and their partner in Crime, the Democrats, would have played it straight, I would be way up in the Polls right now - with our Economy, winning by 20 points. But I’m winning anyway!","created_at":"Wed Jun 19 15:09:18 +0000 2019","retweet_count":21175,"favorite_count":104965,"is_retweet":false,"id_str":"1141362325619916801"},{"source":"Twitter for iPhone","text":"The Fake News doesn’t report it, but Republican enthusiasm is at an all time   high. Look what is going on in Orlando, Florida, right now! People have never seen anything like it (unless you play a guitar). Going to be wild - See you later!","created_at":"Tue Jun 18 11:30:23 +0000 2019","retweet_count":20476,"favorite_count":86534,"is_retweet":false,"id_str":"1140944847039324160"},{"source":"Twitter for iPhone","text":"The story in the @nytimes about the U.S. escalating attacks on Russia’s power grid is Fake News, and the Failing New York Times knows it. They should immediately release their sources which, if they exist at all, which I doubt, are phony. Times must be held fully accountable!","created_at":"Tue Jun 18 02:13:41 +0000 2019","retweet_count":18270,"favorite_count":69504,"is_retweet":false,"id_str":"1140804748423118848"},{"source":"Twitter for iPhone","text":".@FoxNews Polls are always bad for me. They were against Crooked Hillary also. Something weird going on at Fox. Our polls show us leading in all 17 Swing States. For the record, I didn’t spend 30 hours with @abcnews, but rather a tiny fraction of that. More Fake News  @BretBaier","created_at":"Mon Jun 17 23:49:43 +0000 2019","retweet_count":16040,"favorite_count":64663,"is_retweet":false,"id_str":"1140768516288782336"},{"source":"Twitter for iPhone","text":"When will the Fake News Media start asking Democrats if they are OK with the hiring of Christopher Steele, a foreign agent, paid for by Crooked Hillary and the DNC, to dig up “dirt” and write a phony Dossier against the Presidential Candidate of the opposing party.........","created_at":"Sun Jun 16 20:36:10 +0000 2019","retweet_count":22404,"favorite_count":94861,"is_retweet":false,"id_str":"1140357421547839488"},{"source":"Twitter for iPhone","text":"I enjoyed my interview with @GStephanopoulos on @ABC. So funny to watch the Fake News Media try to dissect &amp; distort every word in as negative a way as possible. It will be aired on Sunday night at 8:00 P.M., and is called, “President Trump: 30 Hours” (which is somewhat....","created_at":"Sun Jun 16 00:51:19 +0000 2019","retweet_count":15927,"favorite_count":84416,"is_retweet":false,"id_str":"1140059243518865408"},{"source":"Twitter for iPhone","text":"I enjoyed my interview with @GStephanopoulos on @abcnews. So funny to watch the Fake News Media try to dissect &amp; distort every word in as negative a way as possible. It will be aired on Sunday night at 8:00 P.M., and is called, “President Trump: 30 Hours” (which is somewhat....","created_at":"Sun Jun 16 00:30:07 +0000 2019","retweet_count":2346,"favorite_count":8958,"is_retweet":false,"id_str":"1140053908770971648"},{"source":"Twitter for iPhone","text":"....call the FBI about these calls and meetings? How ridiculous! I would never be trusted again. With that being said, my full answer is rarely played by the Fake News Media. They purposely leave out the part that matters.","created_at":"Thu Jun 13 13:23:47 +0000 2019","retweet_count":19007,"favorite_count":94052,"is_retweet":false,"id_str":"1139161443734106112"},{"source":"Twitter for iPhone","text":".....call the FBI about these calls and meetings? How ridiculous! I would never be trusted again. With that being said, my full answer is rarely played by the Fake News Media. They purposely leave out the part that matters.","created_at":"Thu Jun 13 12:59:57 +0000 2019","retweet_count":3146,"favorite_count":12169,"is_retweet":false,"id_str":"1139155447242530816"},{"source":"Twitter for iPhone","text":"The Fake News has never been more dishonest than it is today. Thank goodness we can fight back on Social Media. Their new weapon of choice is Fake Polling, sometimes referred to as Suppression Polls (they suppress the numbers). Had it in 2016, but this is worse.....","created_at":"Wed Jun 12 12:46:43 +0000 2019","retweet_count":26132,"favorite_count":110931,"is_retweet":false,"id_str":"1138789726771732480"},{"source":"Twitter for iPhone","text":"The Fake News has never been more dishonest than it is today. Thank goodness we can fight back on Social Media. There new weapon of choice is Fake Polling, sometimes referred to as Suppression Polls (they suppress the numbers). Had it in 2016, but this is worse.........","created_at":"Wed Jun 12 12:19:49 +0000 2019","retweet_count":3627,"favorite_count":14054,"is_retweet":false,"id_str":"1138782960444956673"},{"source":"Twitter for iPhone","text":"The Failing @nytimes story on Mexico and Illegal Immigration through our Southern Border has now been proven shockingly false and untrue, bad reporting, and the paper is embarrassed by it. The only problem is that they knew it was Fake News before it went out. Corrupt Media!","created_at":"Sun Jun 09 22:57:11 +0000 2019","retweet_count":18855,"favorite_count":70571,"is_retweet":false,"id_str":"1137856192343105537"},{"source":"Twitter for iPhone","text":"I know it is not at all “Presidential” to hit back at the Corrupt Media, or people who work for the Corrupt Media, when they make false statements about me or the Trump Administration. Problem is, if you don’t hit back, people believe the Fake News is true. So we’ll hit back!","created_at":"Sun Jun 09 04:08:26 +0000 2019","retweet_count":41842,"favorite_count":176484,"is_retweet":false,"id_str":"1137572134409125890"},{"source":"Twitter for iPhone","text":"Watched MSNBC this morning just to see what the opposition was saying about events of the past week. Such lies, almost everything they were saying was the opposite of the truth. Fake News! No wonder their ratings, along with CNN, are WAY DOWN. The hatred Comcast has is amazing!","created_at":"Sat Jun 08 23:25:11 +0000 2019","retweet_count":25381,"favorite_count":109010,"is_retweet":false,"id_str":"1137500852778864645"},{"source":"Twitter for iPhone","text":"If the totally Corrupt Media was less corrupt, I would be up by 15 points in the polls based on our tremendous success with the economy, maybe Best Ever! If the Corrupt Media was actually fair, I would be up by 25 points. Nevertheless, despite the Fake News, we’re doing great!","created_at":"Wed Jun 05 08:17:07 +0000 2019","retweet_count":19764,"favorite_count":92870,"is_retweet":false,"id_str":"1136185163971407873"},{"source":"Twitter for iPhone","text":"If the totally Corrupt Media was less corrupt, I would be up by 15 points in the polls based on our tremendous success with the economy, maybe Best Ever! If the Corrup Media was actually fair, I would be up by 25 points. Nevertheless, despite the Fake News, we’re doing great!","created_at":"Wed Jun 05 06:57:58 +0000 2019","retweet_count":2656,"favorite_count":11364,"is_retweet":false,"id_str":"1136165246513471488"},{"source":"Twitter for iPhone","text":"Washed up psycho @BetteMidler was forced to apologize for a statement she attributed to me that turned out to be totally fabricated by her in order to make “your great president” look really bad. She got caught, just like the Fake News Media gets caught. A sick scammer!","created_at":"Wed Jun 05 00:30:55 +0000 2019","retweet_count":30618,"favorite_count":131679,"is_retweet":false,"id_str":"1136067842879709184"},{"source":"Twitter for iPhone","text":"....Fake News will be working hard to find them. Great love all around. Also, big Trade Deal is possible once U.K. gets rid of the shackles. Already starting to talk!","created_at":"Mon Jun 03 17:41:37 +0000 2019","retweet_count":22267,"favorite_count":124305,"is_retweet":false,"id_str":"1135602452059906050"},{"source":"Twitter for iPhone","text":"I believe that if people stoped using or subscribing to @ATT, they would be forced to make big changes at @CNN, which is dying in the ratings anyway. It is so unfair with such bad, Fake News! Why wouldn’t they act. When the World watches @CNN, it gets a false picture of USA. Sad!","created_at":"Mon Jun 03 10:50:33 +0000 2019","retweet_count":24604,"favorite_count":99546,"is_retweet":false,"id_str":"1135499002626154496"},{"source":"Twitter for iPhone","text":"Just arrived in the United Kingdom. The only problem is that @CNN is the primary source of news available from the U.S. After watching it for a short while, I turned it off. All negative &amp; so much Fake News, very bad for U.S. Big ratings drop. Why doesn’t owner @ATT do something?","created_at":"Mon Jun 03 10:37:28 +0000 2019","retweet_count":27168,"favorite_count":114027,"is_retweet":false,"id_str":"1135495710894374917"},{"source":"Twitter for iPhone","text":"I never called Meghan Markle “nasty.” Made up by the Fake News Media, and they got caught cold! Will @CNN, @nytimes and others apologize? Doubt it!","created_at":"Sun Jun 02 12:44:24 +0000 2019","retweet_count":25475,"favorite_count":104435,"is_retweet":false,"id_str":"1135165268261519361"},{"source":"Twitter for iPhone","text":"The Navy put out a disclaimer on the McCain story. Looks like the story was an exaggeration, or even Fake News - but why not, everything else is!","created_at":"Thu May 30 22:23:21 +0000 2019","retweet_count":21777,"favorite_count":87020,"is_retweet":false,"id_str":"1134223799300153347"},{"source":"Twitter for iPhone","text":"Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....","created_at":"Thu May 30 11:57:47 +0000 2019","retweet_count":27082,"favorite_count":118033,"is_retweet":false,"id_str":"1134066371510378501"},{"source":"Twitter for iPhone","text":"Russia, Russia, Russia! That’s all you heard at the beginning of this Witch Hunt Hoax...And now Russia has disappeared because I had nothing to do with Russia helping me to get elected. It was a crime that didn’t exist. So now the Dems and their partner, the Fake News Media,.....","created_at":"Thu May 30 11:38:15 +0000 2019","retweet_count":3073,"favorite_count":11986,"is_retweet":false,"id_str":"1134061454250975232"},{"source":"Twitter for iPhone","text":".@ianbremmer now admits that he MADE UP “a completely ludicrous quote,” attributing it to me. This is what’s going on in the age of Fake News. People think they can say anything and get away with it. Really, the libel laws should be changed to hold Fake News Media accountable!","created_at":"Mon May 27 08:57:33 +0000 2019","retweet_count":24596,"favorite_count":90030,"is_retweet":false,"id_str":"1132933851133534210"},{"source":"Twitter for iPhone","text":"I was extremely calm yesterday with my meeting with Pelosi and Schumer, knowing that they would say I was raging, which they always do, along with their partner, the Fake News Media. Well, so many stories about the meeting use the Rage narrative anyway - Fake &amp; Corrupt Press!","created_at":"Thu May 23 14:13:39 +0000 2019","retweet_count":24863,"favorite_count":105446,"is_retweet":false,"id_str":"1131563848992006144"},{"source":"Twitter for iPhone","text":"The Fake News put out a typically false statement, without any knowledge that the United States was trying to set up a negotiation with Iran. This is a false report....","created_at":"Mon May 20 17:30:35 +0000 2019","retweet_count":18784,"favorite_count":80355,"is_retweet":false,"id_str":"1130526242531364864"},{"source":"Twitter for iPhone","text":".....was very good and highly professional to deal with - and if for any reason I didn’t like them, I would have gone elsewhere....there was always plenty of money around and banks to choose from. They would be very happy to take my money. Fake News!","created_at":"Mon May 20 11:20:54 +0000 2019","retweet_count":14015,"favorite_count":73999,"is_retweet":false,"id_str":"1130433208997355520"},{"source":"Twitter for iPhone","text":"....fashioned, but true. When you don’t need or want money, you don’t need or want banks. Banks have always been available to me, they want to make money. Fake Media only says this to disparage, and always uses unnamed sources (because their sources don’t even exist)......","created_at":"Mon May 20 11:20:53 +0000 2019","retweet_count":5585,"favorite_count":21903,"is_retweet":false,"id_str":"1130433206652682240"},{"source":"Twitter for iPhone","text":"The Failing New York Times (it will pass away when I leave office in 6 years), and others of the Fake News Media, keep writing phony stories about how I didn’t use many banks because they didn’t want to do business with me. WRONG! It is because I didn’t need money. Very old","created_at":"Mon May 20 11:20:53 +0000 2019","retweet_count":20578,"favorite_count":101881,"is_retweet":false,"id_str":"1130433205537038337"},{"source":"Twitter for iPhone","text":"The Mainstream Media has never been as corrupt and deranged as it is today. FAKE NEWS is actually the biggest story of all and is the true ENEMY OF THE PEOPLE! That’s why they refuse to cover the REAL Russia Hoax. But the American people are wise to what is going on.....","created_at":"Mon May 20 11:20:53 +0000 2019","retweet_count":8072,"favorite_count":26490,"is_retweet":false,"id_str":"1130433207487336450"},{"source":"Twitter for iPhone","text":"Watched some of the Fake News Political Shows this morning and continue to be amazed at how every question is asked in the most negative way. The Mainstream Media should be ashamed of itself - But the good news is that the USA is wise to your game of dishonesty and deception!","created_at":"Sun May 19 18:50:37 +0000 2019","retweet_count":21774,"favorite_count":87504,"is_retweet":false,"id_str":"1130183995587813383"},{"source":"Twitter for iPhone","text":"For all of the Fake News Sunday Political Shows, whose bias &amp; dishonesty is greater than ever seen in our Country before, please inform your viewers that our Economy is setting records, with more people employed today than at any time in U.S. history, our Military, which....","created_at":"Sun May 19 12:49:32 +0000 2019","retweet_count":22726,"favorite_count":98513,"is_retweet":false,"id_str":"1130093128109703168"},{"source":"Twitter for iPhone","text":"The Fake News Media is hurting our Country with its fraudulent and highly inaccurate coverage of Iran. It is scattershot, poorly sourced (made up), and DANGEROUS. At least Iran doesn’t know what to think, which at this point may very well be a good thing!","created_at":"Fri May 17 13:44:35 +0000 2019","retweet_count":19915,"favorite_count":77548,"is_retweet":false,"id_str":"1129382204990214144"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: The Fake News Washington Post, and even more Fake News New York Times, are writing stories that there is infighting wi…","created_at":"Thu May 16 12:34:45 +0000 2019","retweet_count":22963,"favorite_count":0,"is_retweet":true,"id_str":"1129002245679407104"},{"source":"Twitter for iPhone","text":"The Fake News Washington Post, and even more Fake News New York Times, are writing stories that there is infighting with respect to my strong policy in the Middle East. There is no infighting whatsoever....","created_at":"Wed May 15 19:10:47 +0000 2019","retweet_count":22963,"favorite_count":105550,"is_retweet":false,"id_str":"1128739520311066626"},{"source":"Twitter for iPhone","text":"The Democrats new and pathetically untrue sound bite is that we are in a “Constitutional Crisis.” They and their partner, the Fake News Media, are all told to say this as loud and as often as possible. They are a sad JOKE! We may have the strongest Economy in our history, best...","created_at":"Sun May 12 21:35:41 +0000 2019","retweet_count":19722,"favorite_count":80657,"is_retweet":false,"id_str":"1127688823264169984"},{"source":"Twitter for iPhone","text":"....you would get it by building, or even buying. You always wanted to show losses for tax purposes....almost all real estate developers did - and often re-negotiate with banks, it was sport. Additionally, the very old information put out is a highly inaccurate Fake News hit job!","created_at":"Wed May 08 10:56:32 +0000 2019","retweet_count":16812,"favorite_count":84592,"is_retweet":false,"id_str":"1126078423816921092"},{"source":"Twitter for iPhone","text":"How can it be possible that James Woods (and many others), a strong but responsible Conservative Voice, is banned from Twitter? Social Media &amp; Fake News Media, together with their partner, the Democrat Party, have no idea the problems they are causing for themselves. VERY UNFAIR!","created_at":"Sat May 04 18:31:06 +0000 2019","retweet_count":46773,"favorite_count":163630,"is_retweet":false,"id_str":"1124743267873116160"},{"source":"Twitter for iPhone","text":"Very good call yesterday with President Putin of Russia. Tremendous potential for a good/great relationship with Russia, despite what you read and see in the Fake News Media. Look how they have misled you on “Russia Collusion.” The World can be a better and safer place. Nice!","created_at":"Sat May 04 13:49:27 +0000 2019","retweet_count":21219,"favorite_count":90790,"is_retweet":false,"id_str":"1124672389416144905"},{"source":"Twitter for iPhone","text":"When will the Radical Left Wing Media apologize to me for knowingly getting the Russia Collusion Delusion story so wrong? The real story is about to happen! Why is @nytimes, @washingtonpost, @CNN, @MSNBC allowed to be on Twitter &amp; Facebook. Much of what they do is FAKE NEWS!","created_at":"Sat May 04 12:34:07 +0000 2019","retweet_count":27733,"favorite_count":95354,"is_retweet":false,"id_str":"1124653429366906882"},{"source":"Twitter for iPhone","text":"RT @TGrande7: @dbongino All firefighters I work with said \nNo way !!!!!! \nFake News","created_at":"Wed May 01 09:59:54 +0000 2019","retweet_count":2434,"favorite_count":0,"is_retweet":true,"id_str":"1123527458802884608"},{"source":"Twitter for iPhone","text":"The Media (Fake News) is pushing Sleepy Joe hard. Funny, I’m only here because of Biden &amp; Obama. They didn’t do the job and now you have Trump, who is getting it done - big time!","created_at":"Mon Apr 29 14:42:12 +0000 2019","retweet_count":26774,"favorite_count":113665,"is_retweet":false,"id_str":"1122873726276599809"},{"source":"Twitter for iPhone","text":"As has been incorrectly reported by the Fake News Media, I never told then White House Counsel Don McGahn to fire Robert Mueller, even though I had the legal right to do so. If I wanted to fire Mueller, I didn’t need McGahn to do it, I could have done it myself. Nevertheless,....","created_at":"Thu Apr 25 11:47:12 +0000 2019","retweet_count":20982,"favorite_count":91868,"is_retweet":false,"id_str":"1121380133137461248"},{"source":"Twitter for iPhone","text":"I didn’t call Bob Costa of the Washington Post, he called me (Returned his call)!  Just more Fake News.","created_at":"Wed Apr 24 14:09:35 +0000 2019","retweet_count":17161,"favorite_count":79370,"is_retweet":false,"id_str":"1121053578603397120"},{"source":"Twitter for iPhone","text":"You mean the Stock Market hit an all-time record high today and they’re actually talking impeachment!? Will I ever be given credit for anything by the Fake News Media or Radical Liberal Dems? NO COLLUSION!","created_at":"Tue Apr 23 22:43:34 +0000 2019","retweet_count":35000,"favorite_count":151953,"is_retweet":false,"id_str":"1120820536605585408"},{"source":"Twitter for iPhone","text":"The Radical Left Democrats, together with their leaders in the Fake News Media, have gone totally insane! I guess that means that the Republican agenda is working. Stay tuned for more!","created_at":"Tue Apr 23 10:18:42 +0000 2019","retweet_count":17057,"favorite_count":70407,"is_retweet":false,"id_str":"1120633085618421760"},{"source":"Twitter for iPhone","text":"Paul Krugman, of the Fake News New York Times, has lost all credibility, as has the Times itself, with his false and highly inaccurate writings on me. He is obsessed with hatred, just as others are obsessed with how stupid he is. He said Market would crash, Only Record Highs!","created_at":"Tue Apr 23 09:59:49 +0000 2019","retweet_count":20046,"favorite_count":82841,"is_retweet":false,"id_str":"1120628334432608256"},{"source":"Twitter for iPhone","text":"The Fake News Media is doing everything possible to stir up and anger the pols and as many people as possible seldom mentioning the fact that the Mueller Report had as its principle conclusion the fact that there was NO COLLUSION WITH RUSSIA. The Russia Hoax is dead!","created_at":"Sat Apr 20 12:02:38 +0000 2019","retweet_count":21147,"favorite_count":88216,"is_retweet":false,"id_str":"1119572078175367168"},{"source":"Twitter for iPhone","text":"Kimberley Strassel should get the Pulitzer. She is a treasure (and I don’t know her) who correctly called the Russia Hoax right from the start! Others who were soooo wrong will get the Prize. Fake News! https://t.co/TJJPY5MM6X","created_at":"Fri Apr 19 02:34:48 +0000 2019","retweet_count":23537,"favorite_count":86970,"is_retweet":false,"id_str":"1119066791161077760"},{"source":"Twitter for iPhone","text":"President Obama’s top White House lawyer, Gregory B. Craig, was indicted yesterday on very serious charges. This is a really big story, but the Fake News New York Times didn’t even put it on page one, rather page 16. @washingtonpost not much better, “tiny” page one. Corrupt News!","created_at":"Fri Apr 12 13:37:30 +0000 2019","retweet_count":30708,"favorite_count":107254,"is_retweet":false,"id_str":"1116696849853886465"},{"source":"Twitter for iPhone","text":"“The underlying issue remains the same without a single American being indicted for Collusion with Russia, &amp; that is a stunning end considering we were led to believe (Fake News) that something much more dramatic would happen. Why did people fall for this?” @TuckerCarlson Molly H","created_at":"Wed Apr 10 01:01:51 +0000 2019","retweet_count":19397,"favorite_count":76908,"is_retweet":false,"id_str":"1115781908091277312"},{"source":"Twitter for iPhone","text":"The Mainstream Media has never been more inaccurate or corrupt than it is today. It only seems to get worse. So much Fake News!","created_at":"Tue Apr 09 12:44:17 +0000 2019","retweet_count":26432,"favorite_count":112455,"is_retweet":false,"id_str":"1115596294016335872"},{"source":"Twitter for iPhone","text":"Looks like Bob Mueller’s team of 13 Trump Haters &amp; Angry Democrats are illegally leaking information to the press while the Fake News Media make up their own stories with or without sources - sources no longer matter to our corrupt &amp; dishonest Mainstream Media, they are a Joke!","created_at":"Sun Apr 07 13:50:02 +0000 2019","retweet_count":35152,"favorite_count":135550,"is_retweet":false,"id_str":"1114888062884954114"},{"source":"Twitter for iPhone","text":"The New York Times had no legitimate sources, which would be totally illegal, concerning the Mueller Report. In fact, they probably had no sources at all! They are a Fake News paper who have already been forced to apologize for their incorrect and very bad reporting on me!","created_at":"Thu Apr 04 15:04:27 +0000 2019","retweet_count":24297,"favorite_count":95229,"is_retweet":false,"id_str":"1113819627212169219"},{"source":"Twitter for iPhone","text":"Wow, ratings for “Morning Joe,” which were really bad in the first place, just “tanked” with the release of the Mueller Report. Likewise, other shows on MSNBC and CNN have gone down by as much as 50%. Just shows, Fake News never wins!","created_at":"Thu Mar 28 11:04:04 +0000 2019","retweet_count":30828,"favorite_count":134254,"is_retweet":false,"id_str":"1111222415739244546"},{"source":"Twitter for iPhone","text":"The Fake News Media is going Crazy! They are suffering a major “breakdown,” have ZERO credibility or respect, &amp; must be thinking about going legit. I have learned to live with Fake News, which has never been more corrupt than it is right now. Someday, I will tell you the secret!","created_at":"Thu Mar 28 10:13:14 +0000 2019","retweet_count":38025,"favorite_count":160997,"is_retweet":false,"id_str":"1111209625825640448"},{"source":"Twitter for iPhone","text":"The Fake News Media has lost tremendous credibility with its corrupt coverage of the illegal Democrat Witch Hunt of your all time favorite duly elected President, me! T.V. ratings of CNN &amp; MSNBC tanked last night after seeing the Mueller Report statement. @FoxNews up BIG!","created_at":"Wed Mar 27 01:27:21 +0000 2019","retweet_count":33035,"favorite_count":137650,"is_retweet":false,"id_str":"1110714893039267840"},{"source":"Twitter for iPhone","text":"The Fake News Media has NEVER been more Dishonest or Corrupt than it is right now. There has never been a time like this in American History. Very exciting but also, very sad! Fake News is the absolute Enemy of the People and our Country itself!","created_at":"Tue Mar 19 12:24:21 +0000 2019","retweet_count":34686,"favorite_count":133276,"is_retweet":false,"id_str":"1107981131012628481"},{"source":"Twitter for iPhone","text":"While the press doesn’t like writing about it, nor do I need them to, I donate my yearly Presidential salary of $400,000.00 to different agencies throughout the year, this to Homeland Security. If I didn’t do it there would be hell to pay from the FAKE NEWS MEDIA! https://t.co/xqIGUOwh4x","created_at":"Mon Mar 18 22:29:29 +0000 2019","retweet_count":47856,"favorite_count":175858,"is_retweet":false,"id_str":"1107771030385426432"},{"source":"Twitter for iPhone","text":"The Fake News Media is working overtime to blame me for the horrible attack in New Zealand. They will have to work very hard to prove that one. So Ridiculous!","created_at":"Mon Mar 18 13:38:30 +0000 2019","retweet_count":29491,"favorite_count":136336,"is_retweet":false,"id_str":"1107637405010530305"},{"source":"Twitter for iPhone","text":"Bring back @JudgeJeanine Pirro. The Radical Left Democrats, working closely with their beloved partner, the Fake News Media, is using every trick in the book to SILENCE a majority of our Country. They have all out campaigns against @FoxNews hosts who are doing too well. Fox .....","created_at":"Sun Mar 17 13:18:29 +0000 2019","retweet_count":34946,"favorite_count":108567,"is_retweet":false,"id_str":"1107269978678611969"},{"source":"Twitter for iPhone","text":"So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp; the Dems, working together, failed (as usual). Even the Fake News refused this garbage!","created_at":"Sun Mar 17 12:41:15 +0000 2019","retweet_count":33350,"favorite_count":122730,"is_retweet":false,"id_str":"1107260609974943745"},{"source":"Twitter for iPhone","text":"So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He &amp; the Dems, working together,  failed (as usual). Even the Fake News refused this garbage!","created_at":"Sun Mar 17 12:36:08 +0000 2019","retweet_count":1435,"favorite_count":4488,"is_retweet":false,"id_str":"1107259321983877121"},{"source":"Twitter for iPhone","text":"....Should Federal Election Commission and/or FCC look into this? There must be Collusion with the Democrats and, of course, Russia! Such one sided media coverage, most of it Fake News. Hard to believe I won and am winning. Approval Rating 52%, 93% with Republicans. Sorry!  #MAGA","created_at":"Sun Mar 17 12:13:58 +0000 2019","retweet_count":19326,"favorite_count":81676,"is_retweet":false,"id_str":"1107253742271901696"},{"source":"Twitter for iPhone","text":"The Fake News photoshopped pictures of Melania, then propelled conspiracy theories that it’s actually not her by my side in Alabama and other places. They are only getting more deranged with time!","created_at":"Wed Mar 13 13:44:38 +0000 2019","retweet_count":23286,"favorite_count":98166,"is_retweet":false,"id_str":"1105827007991025666"},{"source":"Twitter for iPhone","text":"Patrick Moore, co-founder of Greenpeace: “The whole climate crisis is not only Fake News, it’s Fake Science. There is no climate crisis, there’s weather and climate all around the world, and in fact carbon dioxide is the main building block of all life.” @foxandfriends  Wow!","created_at":"Tue Mar 12 12:29:48 +0000 2019","retweet_count":33839,"favorite_count":105616,"is_retweet":false,"id_str":"1105445788585467904"},{"source":"Twitter for iPhone","text":"At a recent round table meeting of business executives, &amp; long after formally introducing Tim Cook of Apple, I quickly referred to Tim + Apple as Tim/Apple as an easy way to save time &amp; words. The Fake News was disparagingly all over this, &amp; it became yet another bad Trump story!","created_at":"Mon Mar 11 14:12:50 +0000 2019","retweet_count":21533,"favorite_count":105804,"is_retweet":false,"id_str":"1105109329290686464"},{"source":"Twitter for iPhone","text":"The Wall is being built and is well under construction. Big impact will be made. Many additional contracts are close to being signed. Far ahead of schedule despite all of the Democrat Obstruction and Fake News!","created_at":"Fri Mar 08 12:24:07 +0000 2019","retweet_count":26362,"favorite_count":109817,"is_retweet":false,"id_str":"1103994805477085186"},{"source":"Twitter for iPhone","text":"It was not a campaign contribution, and there were no violations of the campaign finance laws by me. Fake News!","created_at":"Thu Mar 07 14:24:45 +0000 2019","retweet_count":21338,"favorite_count":104439,"is_retweet":false,"id_str":"1103662776424132608"},{"source":"Twitter for iPhone","text":"Democrats just blocked @FoxNews from holding a debate. Good, then I think I’ll do the same thing with the Fake News Networks and the Radical Left Democrats in the General Election debates!","created_at":"Thu Mar 07 00:05:33 +0000 2019","retweet_count":43745,"favorite_count":183474,"is_retweet":false,"id_str":"1103446552524345346"},{"source":"Twitter for iPhone","text":".... Amazon, like the Washington Post. It’s hard to remember that not so long ago America had prestige media outlets, but not anymore.” @TuckerCarlson   The Fake News Media is the true Enemy of the People!","created_at":"Tue Mar 05 02:10:34 +0000 2019","retweet_count":18008,"favorite_count":73496,"is_retweet":false,"id_str":"1102753238451929088"},{"source":"Twitter for iPhone","text":"The military drills, or war games as I call them, were never even discussed in my mtg w/ Kim Jong Un of NK—FAKE NEWS! I made that decision long ago because it costs the U.S. far too much money to have those “games”, especially since we are not reimbursed for the tremendous cost!","created_at":"Mon Mar 04 19:53:49 +0000 2019","retweet_count":19152,"favorite_count":87537,"is_retweet":false,"id_str":"1102658425505366018"},{"source":"Twitter for iPhone","text":"And also illegally leaking to Fake News CNN &amp; others? https://t.co/GAItdhWniB","created_at":"Mon Mar 04 01:28:47 +0000 2019","retweet_count":19749,"favorite_count":69668,"is_retweet":false,"id_str":"1102380332072996864"},{"source":"Twitter for iPhone","text":"...said was a total lie, but Fake Media won’t show it. I am an innocent man being persecuted by some very bad, conflicted &amp; corrupt people in a Witch Hunt that is illegal &amp; should never have been allowed to start - And only because I won the Election! Despite this, great success!","created_at":"Sun Mar 03 15:44:10 +0000 2019","retweet_count":26410,"favorite_count":123059,"is_retweet":false,"id_str":"1102233209708924930"},{"source":"Twitter for iPhone","text":"There is far more ENERGY on the Right than there is on the Left. That’s why we just won the Senate and why we will win big in 2020. The Fake News just doesn’t want to report the facts. Border Security is a big factor. The under construction Wall will stop Gangs, Drugs and Crime!","created_at":"Sat Feb 23 17:52:46 +0000 2019","retweet_count":27908,"favorite_count":121137,"is_retweet":false,"id_str":"1099366469010366464"},{"source":"Twitter for iPhone","text":"Fake News is so bad for our Country! https://t.co/ZwA8E0URer","created_at":"Fri Feb 22 14:55:25 +0000 2019","retweet_count":24256,"favorite_count":92630,"is_retweet":false,"id_str":"1098959451292426241"},{"source":"Twitter for iPhone","text":"“The Washington Post ignored basic journalistic standards because it wanted to advance its well-known and easily documented biased agenda against President Donald J. Trump.” Covington student suing WAPO. Go get them Nick. Fake News!","created_at":"Wed Feb 20 12:44:20 +0000 2019","retweet_count":30032,"favorite_count":124424,"is_retweet":false,"id_str":"1098201685518893056"},{"source":"Twitter for iPhone","text":"Nothing funny about tired Saturday Night Live on Fake News NBC! Question is, how do the Networks get away with these total Republican hit jobs without retribution? Likewise for many other shows? Very unfair and should be looked into. This is the real Collusion!","created_at":"Sun Feb 17 12:52:38 +0000 2019","retweet_count":23549,"favorite_count":113268,"is_retweet":false,"id_str":"1097116612279316480"},{"source":"Twitter for iPhone","text":"“Fact checkers have become Fake News.” @JesseBWatters   So True!","created_at":"Mon Feb 11 12:41:49 +0000 2019","retweet_count":17337,"favorite_count":84886,"is_retweet":false,"id_str":"1094939561485062146"},{"source":"Twitter for iPhone","text":"...It is all a GIANT AND ILLEGAL HOAX, developed long before the election itself, but used as an excuse by the Democrats as to why Crooked Hillary Clinton lost the Election! Someday the Fake News Media will turn honest &amp; report that Donald J. Trump was actually a GREAT Candidate!","created_at":"Fri Feb 08 13:59:10 +0000 2019","retweet_count":29169,"favorite_count":137509,"is_retweet":false,"id_str":"1093871865246961666"},{"source":"Twitter for iPhone","text":"Never thought I’d say this but I think @johnrobertsFox and @GillianHTurner @FoxNews have even less understanding of the Wall negotiations than the folks at FAKE NEWS CNN &amp; NBC! Look to final results! Don’t know how my poll numbers are so good, especially up 19% with Hispanics?","created_at":"Mon Jan 28 01:08:09 +0000 2019","retweet_count":19989,"favorite_count":93086,"is_retweet":false,"id_str":"1089691564283183105"},{"source":"Twitter for iPhone","text":"Never thought I’d say this but I think @johnrobertsFox and @JillianTurner @FoxNews have even less understanding of the Wall negotiations than the folks at FAKE NEWS CNN &amp; NBC! Look to final results! Don’t know how my poll numbers are so good, especially up 19% with Hispanics?","created_at":"Mon Jan 28 00:58:41 +0000 2019","retweet_count":2386,"favorite_count":9078,"is_retweet":false,"id_str":"1089689185030758400"},{"source":"Twitter for iPhone","text":"Thank you to Brit. This is a very big deal in Europe. Fake News is the Enemy of the People! https://t.co/WX0o8gaiMC","created_at":"Sun Jan 27 15:27:29 +0000 2019","retweet_count":19628,"favorite_count":78968,"is_retweet":false,"id_str":"1089545436220850177"},{"source":"Twitter for iPhone","text":"Jens Stoltenberg, NATO Secretary General, just stated that because of me NATO has been able to raise far more money than ever before from its members after many years of decline. It’s called burden sharing. Also, more united. Dems &amp; Fake News like to portray the opposite!","created_at":"Sun Jan 27 15:11:55 +0000 2019","retweet_count":27748,"favorite_count":110303,"is_retweet":false,"id_str":"1089541521139998720"},{"source":"Twitter for iPhone","text":"....about all of the one sided Fake Media coverage (collusion with Crooked H?) that I had to endure during my very successful presidential campaign. What about the now revealed bias by Facebook and many others. Roger Stone didn’t even work for me anywhere near the Election!","created_at":"Sun Jan 27 01:49:53 +0000 2019","retweet_count":24281,"favorite_count":104578,"is_retweet":false,"id_str":"1089339681941147648"},{"source":"Twitter for iPhone","text":"“Ax falls quickly at BuzzFeed and Huffpost!” Headline, New York Post. Fake News and bad journalism have caused a big downturn. Sadly, many others will follow. The people want the Truth!","created_at":"Sat Jan 26 21:37:07 +0000 2019","retweet_count":27742,"favorite_count":119676,"is_retweet":false,"id_str":"1089276069872570369"},{"source":"Twitter for iPhone","text":"A third rate conman who interviewed me many years ago for just a short period of time has been playing his biggest con of all on Fake News CNN. Michael D’Antonio, a broken down hack who knows nothing about me, goes on night after night telling made up Trump stories. Disgraceful!","created_at":"Fri Jan 25 03:28:25 +0000 2019","retweet_count":26492,"favorite_count":123927,"is_retweet":false,"id_str":"1088639701064404992"},{"source":"Twitter for iPhone","text":"...back home where they belong, no more Rockets or M’s being fired over Japan or anywhere else and, most importantly, no Nuclear Testing. This is more than has ever been accomplished with North Korea, and the Fake News knows it. I expect another good meeting soon, much potential!","created_at":"Thu Jan 24 13:34:26 +0000 2019","retweet_count":21611,"favorite_count":108330,"is_retweet":false,"id_str":"1088429823561814017"},{"source":"Twitter for iPhone","text":"The Fake News Media loves saying “so little happened at my first summit with Kim Jong Un.” Wrong! After 40 years of doing nothing with North Korea but being taken to the cleaners, &amp; with a major war ready to start, in a short 15 months, relationships built, hostages &amp; remains....","created_at":"Thu Jan 24 13:21:59 +0000 2019","retweet_count":24095,"favorite_count":112485,"is_retweet":false,"id_str":"1088426690164994048"},{"source":"Twitter for iPhone","text":"The reason Sarah Sanders does not go to the “podium” much anymore is that the press covers her so rudely &amp; inaccurately, in particular certain members of the press. I told her not to bother, the word gets out anyway! Most will never cover us fairly &amp; hence, the term, Fake News!","created_at":"Tue Jan 22 15:28:57 +0000 2019","retweet_count":39118,"favorite_count":171367,"is_retweet":false,"id_str":"1087733867614781446"},{"source":"Twitter for iPhone","text":"Last time I went to Davos, the Fake News said I should not go there. This year, because of the Shutdown, I decided not to go, and the Fake News said I should be there. The fact is that the people understand the media better than the media understands them!","created_at":"Tue Jan 22 15:00:04 +0000 2019","retweet_count":25585,"favorite_count":109108,"is_retweet":false,"id_str":"1087726599225688064"},{"source":"Twitter for iPhone","text":"Nick Sandmann and the students of Covington have become symbols of Fake News and how evil it can be. They have captivated the attention of the world, and I know they will use it for the good - maybe even to bring people together. It started off unpleasant, but can end in a dream!","created_at":"Tue Jan 22 12:32:19 +0000 2019","retweet_count":38014,"favorite_count":162047,"is_retweet":false,"id_str":"1087689415814795264"},{"source":"Twitter for iPhone","text":"Fake News is truly the ENEMY OF THE PEOPLE!","created_at":"Sat Jan 19 03:24:49 +0000 2019","retweet_count":46042,"favorite_count":172399,"is_retweet":false,"id_str":"1086464467481833480"},{"source":"Twitter for iPhone","text":"RT @CarmineZozzora: By the time their fake news campaigns are fully exposed they’ve already moved on to their next fake news campaign.\n\nA g…","created_at":"Sat Jan 19 02:23:46 +0000 2019","retweet_count":8451,"favorite_count":0,"is_retweet":true,"id_str":"1086449105382113281"},{"source":"Twitter for iPhone","text":"RT @ChatByCC: The Buzzfeed bombshell bombed. It blew up in their face and the rest of the fake news are casualties too.","created_at":"Sat Jan 19 02:18:18 +0000 2019","retweet_count":12117,"favorite_count":0,"is_retweet":true,"id_str":"1086447730099216386"},{"source":"Twitter for iPhone","text":"RT @parscale: This is just one of many fake news stories over the last several years. Sad so many journalists have lost their integrity. I…","created_at":"Sat Jan 19 01:50:03 +0000 2019","retweet_count":11807,"favorite_count":0,"is_retweet":true,"id_str":"1086440620640604161"},{"source":"Twitter for iPhone","text":"RT @dbongino: We called it. FAKE NEWS!\n\n“More Buzzfeed B.S.” https://t.co/aOIPJJu0vH","created_at":"Sat Jan 19 01:16:18 +0000 2019","retweet_count":12155,"favorite_count":0,"is_retweet":true,"id_str":"1086432126034214917"},{"source":"Twitter for iPhone","text":"The Fake News gets crazier and more dishonest every single day. Amazing to watch as certain people covering me, and the tremendous success of this administration, have truly gone MAD! Their Fake reporting creates anger and disunity. Take two weeks off and come back rested. Chill!","created_at":"Mon Jan 14 13:44:59 +0000 2019","retweet_count":28710,"favorite_count":129205,"is_retweet":false,"id_str":"1084808599124221954"},{"source":"Twitter for iPhone","text":".@CNN called a San Diego news station (@KUSINews) for negative reports on the Wall. When the station said that Walls work, CNN no longer had interest. #FakeNews https://t.co/IDyXqmDsPq","created_at":"Fri Jan 11 23:29:48 +0000 2019","retweet_count":29413,"favorite_count":94350,"is_retweet":false,"id_str":"1083868608919420930"},{"source":"Twitter for iPhone","text":"The Fake News Media keeps saying we haven’t built any NEW WALL. Below is a section just completed on the Border. Anti-climbing feature included. Very high, strong and beautiful! Also, many miles already renovated and in service! https://t.co/UAAGXl5Byr","created_at":"Fri Jan 11 17:50:04 +0000 2019","retweet_count":29454,"favorite_count":106690,"is_retweet":false,"id_str":"1083783112973320192"},{"source":"Twitter for iPhone","text":"There is GREAT unity with the Republicans in the House and Senate, despite the Fake News Media working in overdrive to make the story look otherwise. The Opposition Party &amp; the Dems know we must have Strong Border Security, but don’t want to give “Trump” another one of many wins!","created_at":"Thu Jan 10 13:34:10 +0000 2019","retweet_count":18829,"favorite_count":87119,"is_retweet":false,"id_str":"1083356326833602561"},{"source":"Twitter for iPhone","text":"The Mainstream Media has NEVER been more dishonest than it is now. NBC and MSNBC are going Crazy. They report stories, purposely, the exact opposite of the facts. They are truly the Opposition Party working with the Dems. May even be worse than Fake News CNN, if that is possible!","created_at":"Thu Jan 10 03:43:13 +0000 2019","retweet_count":31632,"favorite_count":125750,"is_retweet":false,"id_str":"1083207607412760576"},{"source":"Twitter for iPhone","text":"....The Fake News Media in our Country is the real Opposition Party. It is truly the Enemy of the People! We must bring honesty back to journalism and reporting!","created_at":"Mon Jan 07 13:31:00 +0000 2019","retweet_count":31217,"favorite_count":129559,"is_retweet":false,"id_str":"1082268365081767936"},{"source":"Twitter for iPhone","text":"...The Fake News will knowingly lie and demean in order make the tremendous success of the Trump Administration, and me, look as bad as possible. They use non-existent sources &amp; write stories that are total fiction. Our Country is doing so well, yet this is a sad day in America!","created_at":"Mon Jan 07 13:09:03 +0000 2019","retweet_count":22803,"favorite_count":98373,"is_retweet":false,"id_str":"1082262839501508609"},{"source":"Twitter for iPhone","text":"With all of the success that our Country is having, including the just released jobs numbers which are off the charts, the Fake News &amp; totally dishonest Media concerning me and my presidency has never been worse. Many have become crazed lunatics who have given up on the TRUTH!...","created_at":"Mon Jan 07 12:56:19 +0000 2019","retweet_count":29958,"favorite_count":134533,"is_retweet":false,"id_str":"1082259636227620865"},{"source":"Twitter for iPhone","text":"“Former @NYTimes editor Jill Abramson rips paper's ‘unmistakably anti-Trump’ bias.”\n\nMs. Abramson is 100% correct. Horrible and totally dishonest reporting on almost everything they write. Hence the term Fake News, Enemy of the People, and Opposition Party!","created_at":"Sat Jan 05 17:27:18 +0000 2019","retweet_count":22225,"favorite_count":89071,"is_retweet":false,"id_str":"1081603056846991361"},{"source":"Twitter for iPhone","text":"Great Tweet today by Tyler Q. Houlton @SpoxDHS on the #FakeNews being put out by @CNN, a proud member of the Opposition Party. @TSA is doing a great job!","created_at":"Sat Jan 05 16:13:07 +0000 2019","retweet_count":11838,"favorite_count":53813,"is_retweet":false,"id_str":"1081584385512607745"},{"source":"Twitter for iPhone","text":"The story in the New York Times regarding Jim Webb being considered as the next Secretary of Defense is FAKE NEWS. I’m sure he is a fine man, but I don’t know Jim, and never met him. Patrick Shanahan, who is Acting Secretary of Defense, is doing a great job!","created_at":"Fri Jan 04 21:45:27 +0000 2019","retweet_count":23265,"favorite_count":105257,"is_retweet":false,"id_str":"1081305634115674112"},{"source":"Twitter for iPhone","text":"HAPPY NEW YEAR TO EVERYONE, INCLUDING THE HATERS AND THE FAKE NEWS MEDIA! 2019 WILL BE A FANTASTIC YEAR FOR THOSE NOT SUFFERING FROM TRUMP DERANGEMENT SYNDROME. JUST CALM DOWN AND ENJOY THE RIDE, GREAT THINGS ARE HAPPENING FOR OUR COUNTRY!","created_at":"Tue Jan 01 13:08:29 +0000 2019","retweet_count":59039,"favorite_count":256114,"is_retweet":false,"id_str":"1080088373451206656"},{"source":"Twitter for iPhone","text":"I am the only person in America who could say that, “I’m bringing our great troops back home, with victory,” and get BAD press. It is Fake News and Pundits who have FAILED for years that are doing the complaining. If I stayed in Endless Wars forever, they would still be unhappy!","created_at":"Mon Dec 31 14:38:52 +0000 2018","retweet_count":25252,"favorite_count":111582,"is_retweet":false,"id_str":"1079748730058870789"},{"source":"Twitter for iPhone","text":"...I campaigned on getting out of Syria and other places. Now when I start getting out the Fake News Media, or some failed Generals who were unable to do the job before I arrived, like to complain about me &amp; my tactics, which are working. Just doing what I said I was going to do!","created_at":"Mon Dec 31 13:12:40 +0000 2018","retweet_count":22000,"favorite_count":100819,"is_retweet":false,"id_str":"1079727034673311746"},{"source":"Twitter for iPhone","text":"CNN &amp; others within the Fake News Universe were going wild about my signing MAGA hats for our military in Iraq and Germany. If these brave young people ask me to sign their hat, I will sign. Can you imagine my saying NO? We brought or gave NO hats as the Fake News first reported!","created_at":"Thu Dec 27 23:23:36 +0000 2018","retweet_count":43772,"favorite_count":181435,"is_retweet":false,"id_str":"1078431231262502912"},{"source":"Twitter for iPhone","text":"I hope everyone, even the Fake News Media, is having a great Christmas! Our Country is doing very well. We are securing our Borders, making great new Trade Deals, and bringing our Troops Back Home. We are finally putting America First. MERRY CHRISTMAS!  #MAGA","created_at":"Tue Dec 25 23:18:44 +0000 2018","retweet_count":46596,"favorite_count":249842,"is_retweet":false,"id_str":"1077705232665272321"},{"source":"Twitter for iPhone","text":"I never “lashed out” at the Acting Attorney General of the U.S., a man for whom I have great respect. This is a made up story, one of many, by the Fake News Media!","created_at":"Mon Dec 24 16:55:32 +0000 2018","retweet_count":19239,"favorite_count":88333,"is_retweet":false,"id_str":"1077246407554281472"},{"source":"Twitter for iPhone","text":"We signed two pieces of major legislation this week, Criminal Justice Reform and the Farm Bill. These are two Big Deals, but all the Fake News Media wants to talk about is “the mistake” of bringing our young people back home from the Never Ending Wars. It all began 19 years ago!","created_at":"Sun Dec 23 19:45:22 +0000 2018","retweet_count":22964,"favorite_count":94518,"is_retweet":false,"id_str":"1076926760829243392"},{"source":"Twitter for iPhone","text":"If anybody but your favorite President, Donald J. Trump, announced that, after decimating ISIS in Syria, we were going to bring our troops back home (happy &amp; healthy), that person would be the most popular hero in America. With me, hit hard instead by the Fake News Media. Crazy!","created_at":"Sun Dec 23 01:59:29 +0000 2018","retweet_count":33844,"favorite_count":153602,"is_retweet":false,"id_str":"1076658521926656000"},{"source":"Twitter for iPhone","text":"Brett McGurk, who I do not know, was appointed by President Obama in 2015. Was supposed to leave in February but he just resigned prior to leaving. Grandstander? The Fake News is making such a big deal about this nothing event!","created_at":"Sun Dec 23 01:48:23 +0000 2018","retweet_count":19475,"favorite_count":86601,"is_retweet":false,"id_str":"1076655729820471296"},{"source":"Twitter for iPhone","text":"There has never been a president who has been tougher (but fair) on China or Russia - Never, just look at the facts. The Fake News tries so hard to paint the opposite picture.","created_at":"Fri Dec 21 14:41:59 +0000 2018","retweet_count":17272,"favorite_count":78064,"is_retweet":false,"id_str":"1076125633275666433"},{"source":"Twitter for iPhone","text":"With so much talk about the Wall, people are losing sight of the great job being done on our Southern Border by Border Patrol, ICE and our great Military. Remember the Caravans? Well, they didn’t get through and none are forming or on their way. Border is tight. Fake News silent!","created_at":"Thu Dec 20 12:39:19 +0000 2018","retweet_count":24050,"favorite_count":101172,"is_retweet":false,"id_str":"1075732375169060869"},{"source":"Twitter for iPhone","text":"....Russia, Iran, Syria &amp; many others are not happy about the U.S. leaving, despite what the Fake News says, because now they will have to fight ISIS and others, who they hate, without us. I am building by far the most powerful military in the world. ISIS hits us they are doomed!","created_at":"Thu Dec 20 12:16:38 +0000 2018","retweet_count":16936,"favorite_count":74564,"is_retweet":false,"id_str":"1075726666574544896"},{"source":"Twitter for iPhone","text":"Wow, 19,000 Texts between Lisa Page and her lover, Peter S of the FBI, in charge of the Russia Hoax, were just reported as being wiped clean and gone. Such a big story that will never be covered by the Fake News. Witch Hunt!","created_at":"Sat Dec 15 16:45:12 +0000 2018","retweet_count":36242,"favorite_count":121738,"is_retweet":false,"id_str":"1073982314588323845"},{"source":"Twitter for iPhone","text":"Fake News has it purposely wrong. Many, over ten, are vying for and wanting the White House Chief of Staff position. Why wouldn’t someone want one of the truly great and meaningful jobs in Washington. Please report news correctly. Thank you!","created_at":"Tue Dec 11 13:30:31 +0000 2018","retweet_count":20699,"favorite_count":91578,"is_retweet":false,"id_str":"1072483770819846144"},{"source":"Twitter for iPhone","text":"I am in the process of interviewing some really great people for the position of White House Chief of Staff. Fake News has been saying with certainty it was Nick Ayers, a spectacular person who will always be with our #MAGA agenda. I will be making a decision soon!","created_at":"Mon Dec 10 01:27:23 +0000 2018","retweet_count":17329,"favorite_count":87406,"is_retweet":false,"id_str":"1071939400517500929"},{"source":"Twitter for iPhone","text":"The Trump Administration has accomplished more than any other U.S. Administration in its first two (not even) years of existence, &amp; we are having a great time doing it! All of this despite the Fake News Media, which has gone totally out of its mind-truly the Enemy of the People!","created_at":"Sun Dec 09 22:43:13 +0000 2018","retweet_count":33301,"favorite_count":141916,"is_retweet":false,"id_str":"1071898088267284482"},{"source":"Twitter for iPhone","text":"It has been incorrectly reported that Rudy Giuliani and others will not be doing a counter to the Mueller Report. That is Fake News. Already 87 pages done, but obviously cannot complete until we see the final Witch Hunt Report.","created_at":"Fri Dec 07 13:39:36 +0000 2018","retweet_count":20914,"favorite_count":81905,"is_retweet":false,"id_str":"1071036505676808194"},{"source":"Twitter for iPhone","text":"FAKE NEWS - THE ENEMY OF THE PEOPLE!","created_at":"Fri Dec 07 03:08:26 +0000 2018","retweet_count":39522,"favorite_count":145583,"is_retweet":false,"id_str":"1070877666654519297"},{"source":"Twitter for iPhone","text":"Does the Fake News Media ever mention the fact that Republicans, with the very important help of my campaign Rallies, WON THE UNITED STATES SENATE, 53 to 47? All I hear is that the Open Border Dems won the House. Senate alone approves judges &amp; others. Big Republican Win!","created_at":"Fri Dec 07 00:27:11 +0000 2018","retweet_count":25194,"favorite_count":110890,"is_retweet":false,"id_str":"1070837085538525185"},{"source":"Twitter for iPhone","text":"While the disgusting Fake News is doing everything within their power not to report it that way, at least 3 major players are intimating that the Angry Mueller Gang of Dems is viciously telling witnesses to lie about facts &amp; they will get relief. This is our Joseph McCarthy Era!","created_at":"Wed Nov 28 13:39:38 +0000 2018","retweet_count":27912,"favorite_count":95339,"is_retweet":false,"id_str":"1067775022331236352"},{"source":"Twitter for iPhone","text":"....The Fake News Media builds Bob Mueller up as a Saint, when in actuality he is the exact opposite. He is doing TREMENDOUS damage to our Criminal Justice System, where he is only looking at one side and not the other. Heroes will come of this, and it won’t be Mueller and his...","created_at":"Tue Nov 27 12:42:58 +0000 2018","retweet_count":24939,"favorite_count":94209,"is_retweet":false,"id_str":"1067398375337791488"},{"source":"Twitter for iPhone","text":".@60Minutes did a phony story about child separation when they know we had the exact same policy as the Obama Administration. In fact a picture of children in jails was used by other Fake Media to show how bad (cruel) we are, but it was in 2014 during O years. Obama separated....","created_at":"Mon Nov 26 01:59:13 +0000 2018","retweet_count":29830,"favorite_count":103732,"is_retweet":false,"id_str":"1066873981293260801"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: The Fake News is showing old footage of people climbing over our Ocean Area Fence. This is what it really looks like -…","created_at":"Fri Nov 23 23:49:04 +0000 2018","retweet_count":51826,"favorite_count":0,"is_retweet":true,"id_str":"1066116452590239751"},{"source":"Twitter for iPhone","text":"I am extremely happy and proud of the job being done by @USTreasury Secretary @StevenMnuchin1. The FAKE NEWS likes to write stories to the contrary, quoting phony sources or jealous people, but they aren’t true. They never like to ask me for a quote b/c it would kill their story.","created_at":"Fri Nov 23 23:48:19 +0000 2018","retweet_count":20326,"favorite_count":90763,"is_retweet":false,"id_str":"1066116263649382400"},{"source":"Twitter for iPhone","text":"You just can’t win with the Fake News Media. A big story today is that because I have pushed so hard and gotten Gasoline Prices so low, more people are driving and I have caused traffic jams throughout our Great Nation. Sorry everyone!","created_at":"Thu Nov 22 00:36:06 +0000 2018","retweet_count":38571,"favorite_count":169831,"is_retweet":false,"id_str":"1065403512559992832"},{"source":"Twitter for iPhone","text":"The Fake News is showing old footage of people climbing over our Ocean Area Fence. This is what it really looks like - no climbers anymore under our Administration! https://t.co/CD4ltRePML","created_at":"Mon Nov 19 19:10:09 +0000 2018","retweet_count":51765,"favorite_count":174421,"is_retweet":false,"id_str":"1064596708875747328"},{"source":"Twitter for iPhone","text":"....I can’t imagine any President having a better or closer relationship with their Vice President then the two of us. Just more FAKE NEWS, the Enemy of the People!","created_at":"Sat Nov 17 16:42:20 +0000 2018","retweet_count":19875,"favorite_count":84668,"is_retweet":false,"id_str":"1063834733430206465"},{"source":"Twitter for iPhone","text":"People are not being told that the Republican Party is on track to pick up two seats in the U.S. Senate, and epic victory: 53 to 47. The Fake News Media only wants to speak of the House, where the Midterm results were better than other sitting Presidents.","created_at":"Fri Nov 16 19:41:57 +0000 2018","retweet_count":26477,"favorite_count":103743,"is_retweet":false,"id_str":"1063517548258447361"},{"source":"Twitter for iPhone","text":"People are not being told that the Republican Party is on track to pick up two seats in the U.S. Senate, and epic victory: 53 to 47. The Fake News Media only wants to speak of the House, were the Midterm results were better than other sitting Presidents.","created_at":"Fri Nov 16 19:35:28 +0000 2018","retweet_count":1797,"favorite_count":6103,"is_retweet":false,"id_str":"1063515915583655936"},{"source":"Twitter for iPhone","text":"The White House is running very smoothly and the results for our Nation are obviously very good. We are the envy of the world. But anytime I even think about making changes, the FAKE NEWS MEDIA goes crazy, always seeking to make us look as bad as possible! Very dishonest!","created_at":"Thu Nov 15 11:59:19 +0000 2018","retweet_count":25420,"favorite_count":107851,"is_retweet":false,"id_str":"1063038733673525248"},{"source":"Twitter for iPhone","text":"The story in the New York Times concerning North Korea developing missile bases is inaccurate. We fully know about the sites being discussed, nothing new - and nothing happening out of the normal. Just more Fake News. I will be the first to let you know if things go bad!","created_at":"Tue Nov 13 17:07:45 +0000 2018","retweet_count":33684,"favorite_count":124735,"is_retweet":false,"id_str":"1062391577807601664"},{"source":"Twitter for iPhone","text":"By the way, when the helicopter couldn’t fly to the first cemetery in France because of almost zero visibility, I suggested driving. Secret Service said NO, too far from airport &amp; big Paris shutdown. Speech next day at American Cemetery in pouring rain! Little reported-Fake News!","created_at":"Tue Nov 13 15:49:20 +0000 2018","retweet_count":30563,"favorite_count":120946,"is_retweet":false,"id_str":"1062371844836261891"},{"source":"Twitter for iPhone","text":"By the way, when the helicopter couldn’t fly to the first cemetery in France because of almost zero visibility, I suggested driving. Secret Service said NO, too far from airport &amp; big Paris shutdown. Speech next day at American Cemetary in pouring rain! Little reported-Fake News!","created_at":"Tue Nov 13 13:30:03 +0000 2018","retweet_count":16532,"favorite_count":55746,"is_retweet":false,"id_str":"1062336793998180352"},{"source":"Twitter for iPhone","text":"To any of the pundits or talking heads that do not give us proper credit for this great Midterm Election, just remember two words - FAKE NEWS!","created_at":"Wed Nov 07 12:52:39 +0000 2018","retweet_count":29074,"favorite_count":138690,"is_retweet":false,"id_str":"1060153052676702208"},{"source":"Twitter for iPhone","text":"There is a rumor, put out by the Democrats, that Josh Hawley of Missouri left the Arena last night early. It is Fake News. He met me at the plane when I arrived, spoke at the great Rally, &amp; stayed to the very end. In fact, I said goodbye to him and left before he did. Deception!","created_at":"Tue Nov 06 15:20:08 +0000 2018","retweet_count":25541,"favorite_count":93103,"is_retweet":false,"id_str":"1059827782434328582"},{"source":"Twitter for iPhone","text":"Melania and I were treated very nicely yesterday in Pittsburgh. The Office of the President was shown great respect on a very sad &amp; solemn day. We were treated so warmly. Small protest was not seen by us, staged far away. The Fake News stories were just the opposite-Disgraceful! https://t.co/9B9HgCF1G9","created_at":"Wed Oct 31 13:09:15 +0000 2018","retweet_count":18018,"favorite_count":71496,"is_retweet":false,"id_str":"1057620518751428608"},{"source":"Twitter for iPhone","text":"Melania and I were treated very nicely yesterday in Pittsburgh. The Office of the President was shown great respect on a very sad and solemn day. We were treaty so warmly. Small protest was not seen by us, staged far away. The Fake News stories were just the opposite-Disgraceful!","created_at":"Wed Oct 31 13:01:51 +0000 2018","retweet_count":1666,"favorite_count":6381,"is_retweet":false,"id_str":"1057618656195174400"},{"source":"Twitter for iPhone","text":"Check out tweets from last two days. I refer to Fake News Media when mentioning Enemy of the People - but dishonest reporters use only the word “Media.” The people of our Great Country are angry and disillusioned at receiving so much Fake News. They get it, and fully understand!","created_at":"Tue Oct 30 00:14:17 +0000 2018","retweet_count":25535,"favorite_count":93493,"is_retweet":false,"id_str":"1057063101189836801"},{"source":"Twitter for iPhone","text":"CNN and others in the Fake News Business keep purposely and inaccurately reporting that I said the “Media is the Enemy of the People.” Wrong! I said that the “Fake News (Media) is the Enemy of the People,” a very big difference. When you give out false information - not good!","created_at":"Tue Oct 30 00:00:23 +0000 2018","retweet_count":34185,"favorite_count":122099,"is_retweet":false,"id_str":"1057059603605831680"},{"source":"Twitter for iPhone","text":"....of Anger and Outrage and we will then be able to bring all sides together in Peace and Harmony. Fake News Must End!","created_at":"Mon Oct 29 12:07:51 +0000 2018","retweet_count":19630,"favorite_count":80430,"is_retweet":false,"id_str":"1056880287974649856"},{"source":"Twitter for iPhone","text":"There is great anger in our Country caused in part by inaccurate, and even fraudulent, reporting of the news. The Fake News Media, the true Enemy of the People, must stop the open &amp; obvious hostility &amp; report the news accurately &amp; fairly. That will do much to put out the flame...","created_at":"Mon Oct 29 12:03:13 +0000 2018","retweet_count":36723,"favorite_count":134425,"is_retweet":false,"id_str":"1056879122348195841"},{"source":"Twitter for iPhone","text":"The Fake News is doing everything in their power to blame Republicans, Conservatives and me for the division and hatred that has been going on for so long in our Country. Actually, it is their Fake &amp; Dishonest reporting which is causing problems far greater than they understand!","created_at":"Mon Oct 29 00:12:57 +0000 2018","retweet_count":50126,"favorite_count":186262,"is_retweet":false,"id_str":"1056700376718684160"},{"source":"Twitter for iPhone","text":"The New York Times has a new Fake Story that now the Russians and Chinese (glad they finally added China) are listening to all of my calls on cellphones. Except that I rarely use a cellphone, &amp; when I do it’s government authorized. I like Hard Lines. Just more made up Fake News!","created_at":"Thu Oct 25 13:57:27 +0000 2018","retweet_count":28834,"favorite_count":101687,"is_retweet":false,"id_str":"1055458320390217728"},{"source":"Twitter for iPhone","text":"A very big part of the Anger we see today in our society is caused by the purposely false and inaccurate reporting of the Mainstream Media that I refer to as Fake News. It has gotten so bad and hateful that it is beyond description. Mainstream Media must clean up its act, FAST!","created_at":"Thu Oct 25 11:18:18 +0000 2018","retweet_count":50880,"favorite_count":180911,"is_retweet":false,"id_str":"1055418269270716418"},{"source":"Twitter for iPhone","text":"The Fake News Media has been talking about recent approval ratings of me by countries around the world, including the European Union, as being very low....","created_at":"Mon Oct 22 19:18:31 +0000 2018","retweet_count":13323,"favorite_count":62309,"is_retweet":false,"id_str":"1054451954397667328"},{"source":"Twitter for iPhone","text":"Facebook has just stated that they are setting up a system to “purge” themselves of Fake News. Does that mean CNN will finally be put out of business?","created_at":"Sun Oct 21 22:48:55 +0000 2018","retweet_count":46785,"favorite_count":185630,"is_retweet":false,"id_str":"1054142516881248258"},{"source":"Twitter for iPhone","text":"Secretary of State Mike Pompeo was never given or shown a Transcript or Video of the Saudi Consulate event. FAKE NEWS!","created_at":"Fri Oct 19 17:26:19 +0000 2018","retweet_count":32297,"favorite_count":80294,"is_retweet":false,"id_str":"1053336553391452161"},{"source":"Twitter for iPhone","text":"AP headline was very different from my quote and meaning in the story. They just can’t help themselves. FAKE NEWS!","created_at":"Wed Oct 17 12:09:52 +0000 2018","retweet_count":13921,"favorite_count":59262,"is_retweet":false,"id_str":"1052532141941301248"},{"source":"Twitter for iPhone","text":"For the record, I have no financial interests in Saudi Arabia (or Russia, for that matter). Any suggestion that I have is just more FAKE NEWS (of which there is plenty)!","created_at":"Tue Oct 16 13:15:18 +0000 2018","retweet_count":20394,"favorite_count":77598,"is_retweet":false,"id_str":"1052186219696803841"},{"source":"Twitter for iPhone","text":"Despite so many positive events and victories, Media Reseach Center reports that 92% of stories on Donald Trump are negative on ABC, CBS and ABC. It is FAKE NEWS! Don’t worry, the Failing New York Times didn’t even put the Brett Kavanaugh victory on the Front Page yesterday-A17!","created_at":"Wed Oct 10 13:01:05 +0000 2018","retweet_count":25499,"favorite_count":93308,"is_retweet":false,"id_str":"1050008315286171648"},{"source":"Twitter for iPhone","text":"The crowd in front of the U.S. Supreme Court is tiny, looks like about 200 people (&amp; most are onlookers) - that wouldn’t even fill the first couple of rows of our Kansas Rally, or any of our Rallies for that matter! The Fake News Media tries to make it look sooo big, &amp; it’s not!","created_at":"Sat Oct 06 21:57:09 +0000 2018","retweet_count":37880,"favorite_count":162935,"is_retweet":false,"id_str":"1048693669870501889"},{"source":"Twitter for iPhone","text":"Watch @MariaBartiromo at 6:00 P.M. on @FoxBusiness. Russian Hoax the big topic! Mainstream Media, often referred to as the Fake News Media, hates to discuss the real facts!","created_at":"Sun Sep 16 21:40:19 +0000 2018","retweet_count":10224,"favorite_count":44001,"is_retweet":false,"id_str":"1041441676949184512"},{"source":"Twitter for iPhone","text":"When President Obama said that he has been to “57 States,” very little mention in Fake News Media. Can you imagine if I said that...story of the year! @IngrahamAngle","created_at":"Sat Sep 15 03:08:11 +0000 2018","retweet_count":25734,"favorite_count":104570,"is_retweet":false,"id_str":"1040799409670377472"},{"source":"Twitter for iPhone","text":"RT @LouDobbs: #FakeNews- The Hurricane Maria death tolls have been inflated &amp; President @realDonaldTrump was right to call out organization…","created_at":"Fri Sep 14 00:28:12 +0000 2018","retweet_count":17587,"favorite_count":0,"is_retweet":true,"id_str":"1040396762975010816"},{"source":"Twitter for iPhone","text":"The Deep State and the Left, and their vehicle, the Fake News Media, are going Crazy - &amp; they don’t know what to do. The Economy is booming like never before, Jobs are at Historic Highs, soon TWO Supreme Court Justices &amp; maybe Declassification to find Additional Corruption. Wow!","created_at":"Thu Sep 06 11:19:30 +0000 2018","retweet_count":36407,"favorite_count":129230,"is_retweet":false,"id_str":"1037661562897682432"},{"source":"Twitter for iPhone","text":"NBC FAKE NEWS, which is under intense scrutiny over their killing the Harvey Weinstein story, is now fumbling around making excuses for their probably highly unethical conduct. I have long criticized NBC and their journalistic standards-worse than even CNN. Look at their license?","created_at":"Tue Sep 04 14:58:21 +0000 2018","retweet_count":25962,"favorite_count":104415,"is_retweet":false,"id_str":"1036991866124861440"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: .@Rasmussen_Poll just came out at 48% approval rate despite the constant and intense Fake News. Higher than Election D…","created_at":"Sun Sep 02 14:10:17 +0000 2018","retweet_count":20416,"favorite_count":0,"is_retweet":true,"id_str":"1036254993052053505"},{"source":"Twitter for iPhone","text":".@Rasmussen_Poll just came out at 48% approval rate despite the constant and intense Fake News. Higher than Election Day and higher than President Obama. Rasmussen was one of the most accurate Election Day polls!","created_at":"Sat Sep 01 02:25:38 +0000 2018","retweet_count":20400,"favorite_count":84744,"is_retweet":false,"id_str":"1035715271418413056"},{"source":"Twitter for iPhone","text":"I am very excited about the person who will be taking the place of Don McGahn as White House Counsel! I liked Don, but he was NOT responsible for me not firing Bob Mueller or Jeff Sessions. So much Fake Reporting and Fake News!","created_at":"Thu Aug 30 13:39:00 +0000 2018","retweet_count":14294,"favorite_count":62295,"is_retweet":false,"id_str":"1035159956507566080"},{"source":"Twitter for iPhone","text":"I am very excited about the person who will be taking the place of Don McGahn as White House Councel! I liked Don, but he was NOT responsible for me not firing Bob Mueller or Jeff Sessions. So much Fake Reporting and Fake News!","created_at":"Thu Aug 30 12:12:22 +0000 2018","retweet_count":5876,"favorite_count":22917,"is_retweet":false,"id_str":"1035138155794575360"},{"source":"Twitter for iPhone","text":"Ivanka Trump &amp; Jared Kushner had NOTHING to do with the so called “pushing out” of Don McGahn.The Fake News Media has it, purposely,so wrong! They love to portray chaos in the White House when they know that chaos doesn’t exist-just a “smooth running machine” with changing parts!","created_at":"Thu Aug 30 11:44:28 +0000 2018","retweet_count":18616,"favorite_count":77237,"is_retweet":false,"id_str":"1035131133997068288"},{"source":"Twitter for iPhone","text":"“Lanny Davis admits being anonymous source in CNN Report.” @BretBaier  Oh well, so much for CNN saying it wasn’t Lanny. No wonder their ratings are so low, it’s FAKE NEWS!","created_at":"Thu Aug 30 00:44:26 +0000 2018","retweet_count":22285,"favorite_count":84341,"is_retweet":false,"id_str":"1034965029676883970"},{"source":"Twitter for iPhone","text":"CNN is being torn apart from within based on their being caught in a major lie and refusing to admit the mistake. Sloppy @carlbernstein, a man who lives in the past and thinks like a degenerate fool, making up story after story, is being laughed at all over the country! Fake News","created_at":"Wed Aug 29 22:43:49 +0000 2018","retweet_count":30856,"favorite_count":116583,"is_retweet":false,"id_str":"1034934675972792320"},{"source":"Twitter for iPhone","text":"“Anonymous Sources are really starting to BURN the media.” @FoxNews The fact is that many anonymous sources don’t even exist. They are fiction made up by the Fake News reporters. Look at the lie that Fake CNN is now in. They got caught red handed! Enemy of the People!","created_at":"Wed Aug 29 12:40:05 +0000 2018","retweet_count":29373,"favorite_count":104187,"is_retweet":false,"id_str":"1034782741714399232"},{"source":"Twitter for iPhone","text":"Google search results for “Trump News” shows only the viewing/reporting of Fake News Media. In other words, they have it RIGGED, for me &amp; others, so that almost all stories &amp; news is BAD. Fake CNN is prominent. Republican/Conservative &amp; Fair Media is shut out. Illegal? 96% of....","created_at":"Tue Aug 28 15:02:49 +0000 2018","retweet_count":27090,"favorite_count":94669,"is_retweet":false,"id_str":"1034456273306243076"},{"source":"Twitter for iPhone","text":"The Fake News Media worked hard to get Tiger Woods to say something that he didn’t want to say. Tiger wouldn’t play the game - he is very smart. More importantly, he is playing great golf again!","created_at":"Mon Aug 27 13:37:39 +0000 2018","retweet_count":30710,"favorite_count":154072,"is_retweet":false,"id_str":"1034072454086447104"},{"source":"Twitter for iPhone","text":"Over 90% approval rating for your all time favorite (I hope) President within the Republican Party and 52% overall. This despite all of the made up stories by the Fake News Media trying endlessly to make me look as bad and evil as possible. Look at the real villains please!","created_at":"Mon Aug 27 00:39:38 +0000 2018","retweet_count":43510,"favorite_count":181471,"is_retweet":false,"id_str":"1033876658439245825"},{"source":"Twitter for iPhone","text":"Michaels Cohen’s attorney clarified the record, saying his client does not know if President Trump knew about the Trump Tower meeting (out of which came nothing!). The answer is that I did NOT know about the meeting. Just another phony story by the Fake News Media!","created_at":"Sat Aug 25 12:16:53 +0000 2018","retweet_count":21849,"favorite_count":81294,"is_retweet":false,"id_str":"1033327353227882496"},{"source":"Twitter for iPhone","text":"Social Media Giants are silencing millions of people. Can’t do this even if it means we must continue to hear Fake News like CNN, whose ratings have suffered gravely. People have to figure out what is real, and what is not, without censorship!","created_at":"Fri Aug 24 11:34:13 +0000 2018","retweet_count":53254,"favorite_count":184573,"is_retweet":false,"id_str":"1032954224529817600"},{"source":"Twitter for iPhone","text":"Fake News, of which there is soooo much (this time the very tired New Yorker) falsely reported that I was going to take the extraordinary step of denying Intelligence Briefings to President Obama. Never discussed or thought of!","created_at":"Tue Aug 21 11:10:49 +0000 2018","retweet_count":16463,"favorite_count":71694,"is_retweet":false,"id_str":"1031861173149413376"},{"source":"Twitter for iPhone","text":"Some members of the media are very Angry at the Fake Story in the New York Times. They actually called to complain and apologize - a big step forward. From the day I announced, the Times has been Fake News, and with their disgusting new Board Member, it will only get worse!","created_at":"Sun Aug 19 12:14:44 +0000 2018","retweet_count":22600,"favorite_count":88499,"is_retweet":false,"id_str":"1031152483949838336"},{"source":"Twitter for iPhone","text":"The Failing New York Times wrote a story that made it seem like the White House Councel had TURNED on the President, when in fact it is just the opposite - &amp; the two Fake reporters knew this. This is why the Fake News Media has become the Enemy of the People. So bad for America!","created_at":"Sun Aug 19 12:06:43 +0000 2018","retweet_count":26504,"favorite_count":99816,"is_retweet":false,"id_str":"1031150465759633408"},{"source":"Twitter for iPhone","text":".....Censorship is a very dangerous thing &amp; absolutely impossible to police. If you are weeding out Fake News, there is nothing so Fake as CNN &amp; MSNBC, &amp; yet I do not ask that their sick behavior be removed. I get used to it and watch with a grain of salt, or don’t watch at all..","created_at":"Sat Aug 18 11:32:17 +0000 2018","retweet_count":33662,"favorite_count":125370,"is_retweet":false,"id_str":"1030779412973846529"},{"source":"Twitter for iPhone","text":"There is nothing that I would want more for our Country than true FREEDOM OF THE PRESS. The fact is that the Press is FREE to write and say anything it wants, but much of what it says is FAKE NEWS, pushing a political agenda or just plain trying to hurt people. HONESTY WINS!","created_at":"Thu Aug 16 14:10:17 +0000 2018","retweet_count":36491,"favorite_count":135175,"is_retweet":false,"id_str":"1030094399362007040"},{"source":"Twitter for iPhone","text":"THE FAKE NEWS MEDIA IS THE OPPOSITION PARTY. It is very bad for our Great Country....BUT WE ARE WINNING!","created_at":"Thu Aug 16 12:50:44 +0000 2018","retweet_count":25316,"favorite_count":105165,"is_retweet":false,"id_str":"1030074380397752320"},{"source":"Twitter for iPhone","text":"....such wonderful and powerful things about me - a true Champion of Civil Rights - until she got fired. Omarosa had Zero credibility with the Media (they didn’t want interviews) when she worked in the White House. Now that she says bad about me, they will talk to her. Fake News!","created_at":"Tue Aug 14 01:57:55 +0000 2018","retweet_count":16968,"favorite_count":74771,"is_retweet":false,"id_str":"1029185314752000007"},{"source":"Twitter for iPhone","text":"While I know it’s “not presidential” to take on a lowlife like Omarosa, and while I would rather not be doing so, this is a modern day form of communication and I know the Fake News Media will be working overtime to make even Wacky Omarosa look legitimate as possible. Sorry!","created_at":"Mon Aug 13 14:21:46 +0000 2018","retweet_count":23204,"favorite_count":107572,"is_retweet":false,"id_str":"1029010124881453056"},{"source":"Twitter for iPhone","text":"The big story that the Fake News Media refuses to report is lowlife Christopher Steele’s many meetings with Deputy A.G. Bruce Ohr and his beautiful wife, Nelly. It was Fusion GPS that hired Steele to write the phony &amp; discredited Dossier, paid for by Crooked Hillary &amp; the DNC....","created_at":"Sat Aug 11 18:28:48 +0000 2018","retweet_count":25284,"favorite_count":88682,"is_retweet":false,"id_str":"1028347518822825984"},{"source":"Twitter for iPhone","text":"The Republicans have now won 8 out of 9 House Seats, yet if you listen to the Fake News Media you would think we are being clobbered. Why can’t they play it straight, so unfair to the Republican Party and in particular, your favorite President!","created_at":"Wed Aug 08 15:14:26 +0000 2018","retweet_count":36082,"favorite_count":152820,"is_retweet":false,"id_str":"1027211440225243137"},{"source":"Twitter for iPhone","text":"Too bad a large portion of the Media refuses to report the lies and corruption having to do with the Rigged Witch Hunt - but that is why we call them FAKE NEWS!","created_at":"Sun Aug 05 12:49:21 +0000 2018","retweet_count":22057,"favorite_count":93211,"is_retweet":false,"id_str":"1026087766071947265"},{"source":"Twitter for iPhone","text":"Fake News reporting, a complete fabrication, that I am concerned about the meeting my wonderful son, Donald, had in Trump Tower. This was a meeting to get information on an opponent, totally legal and done all the time in politics - and it went nowhere. I did not know about it!","created_at":"Sun Aug 05 12:35:43 +0000 2018","retweet_count":20549,"favorite_count":83174,"is_retweet":false,"id_str":"1026084333315153924"},{"source":"Twitter for iPhone","text":"The Fake News hates me saying that they are the Enemy of the People only because they know it’s TRUE. I am providing a great service by explaining this to the American People. They purposely cause great division &amp; distrust. They can also cause War! They are very dangerous &amp; sick!","created_at":"Sun Aug 05 11:38:12 +0000 2018","retweet_count":33755,"favorite_count":124918,"is_retweet":false,"id_str":"1026069857589227520"},{"source":"Twitter for iPhone","text":"They asked my daughter Ivanka whether or not the media is the enemy of the people. She correctly said no. It is the FAKE NEWS, which is a large percentage of the media, that is the enemy of the people!","created_at":"Thu Aug 02 20:24:33 +0000 2018","retweet_count":34404,"favorite_count":145812,"is_retweet":false,"id_str":"1025115155632455680"},{"source":"Twitter for iPhone","text":"Wow, @foxandfriends is blowing away the competition in the morning ratings. Morning Joe is a dead show with very few people watching and sadly, Fake News CNN is also doing poorly. Too much hate and inaccurately reported stories - too predictable!","created_at":"Thu Aug 02 11:04:04 +0000 2018","retweet_count":21829,"favorite_count":97812,"is_retweet":false,"id_str":"1024974107337781248"},{"source":"Twitter for iPhone","text":"The Fake News Media is going CRAZY! They are totally unhinged and in many ways, after witnessing first hand the damage they do to so many innocent and decent people, I enjoy watching. In 7 years, when I am no longer in office, their ratings will dry up and they will be gone!","created_at":"Tue Jul 31 13:34:47 +0000 2018","retweet_count":24610,"favorite_count":102238,"is_retweet":false,"id_str":"1024287257975566338"},{"source":"Twitter for iPhone","text":"Had a very good and interesting meeting at the White House with A.G. Sulzberger, Publisher of the New York Times. Spent much time talking about the vast amounts of Fake News being put out by the media &amp; how that Fake News has morphed into phrase, “Enemy of the People.” Sad!","created_at":"Sun Jul 29 12:30:04 +0000 2018","retweet_count":18359,"favorite_count":75592,"is_retweet":false,"id_str":"1023546197129224192"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: Democrats, who want Open Borders and care little about Crime, are incompetent, but they have the Fake News Media almos…","created_at":"Sun Jul 29 11:59:26 +0000 2018","retweet_count":28802,"favorite_count":0,"is_retweet":true,"id_str":"1023538486081662976"},{"source":"Twitter for iPhone","text":"Do you think the Fake News Media will ever report on this tweet from Michael? https://t.co/kXLCKZO5Fr","created_at":"Sun Jul 29 11:52:49 +0000 2018","retweet_count":14368,"favorite_count":50407,"is_retweet":false,"id_str":"1023536822901776384"},{"source":"Twitter for iPhone","text":"Democrats, who want Open Borders and care little about Crime, are incompetent, but they have the Fake News Media almost totally on their side!","created_at":"Fri Jul 27 22:45:56 +0000 2018","retweet_count":29051,"favorite_count":118933,"is_retweet":false,"id_str":"1022976410745495552"},{"source":"Twitter for iPhone","text":"....,the only Collusion with Russia was with the Democrats, so now they are looking at my Tweets (along with 53 million other people) - the rigged Witch Hunt continues! How stupid and unfair to our Country....And so the Fake News doesn’t waste my time with dumb questions, NO,....","created_at":"Fri Jul 27 11:38:32 +0000 2018","retweet_count":22957,"favorite_count":98240,"is_retweet":false,"id_str":"1022808452677160960"},{"source":"Twitter for iPhone","text":"So sad and unfair that the FCC wouldn’t approve the Sinclair Broadcast merger with Tribune. This would have been a great and much needed Conservative voice for and of the People. Liberal Fake News NBC and Comcast gets approved, much bigger, but not Sinclair. Disgraceful!","created_at":"Wed Jul 25 00:39:16 +0000 2018","retweet_count":22482,"favorite_count":87260,"is_retweet":false,"id_str":"1021917767467982854"},{"source":"Twitter for iPhone","text":"A Rocket has not been launched by North Korea in 9 months. Likewise, no Nuclear Tests. Japan is happy, all of Asia is happy. But the Fake News is saying, without ever asking me (always anonymous sources), that I am angry because it is not going fast enough. Wrong, very happy!","created_at":"Mon Jul 23 13:06:18 +0000 2018","retweet_count":30489,"favorite_count":126860,"is_retweet":false,"id_str":"1021380986452545537"},{"source":"Twitter for iPhone","text":"When you hear the Fake News talking negatively about my meeting with President Putin, and all that I gave up, remember, I gave up NOTHING, we merely talked about future benefits for both countries. Also, we got along very well, which is a good thing, except for the Corrupt Media!","created_at":"Mon Jul 23 12:25:02 +0000 2018","retweet_count":24541,"favorite_count":104142,"is_retweet":false,"id_str":"1021370601863294977"},{"source":"Twitter for iPhone","text":"I had a GREAT meeting with Putin and the Fake News used every bit of their energy to try and disparage it. So bad for our country!","created_at":"Sun Jul 22 13:15:18 +0000 2018","retweet_count":22520,"favorite_count":107819,"is_retweet":false,"id_str":"1021020863733420032"},{"source":"Twitter for iPhone","text":"I got severely criticized by the Fake News Media for being too nice to President Putin. In the Old Days they would call it Diplomacy. If I was loud &amp; vicious, I would have been criticized for being too tough. Remember when they said I was too tough with Chairman Kim? Hypocrites!","created_at":"Fri Jul 20 21:50:30 +0000 2018","retweet_count":37244,"favorite_count":153003,"is_retweet":false,"id_str":"1020425741664751616"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media. I look forw…","created_at":"Fri Jul 20 14:39:02 +0000 2018","retweet_count":23777,"favorite_count":0,"is_retweet":true,"id_str":"1020317159828992000"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: Will the Dems and Fake News ever learn? This is classic! https://t.co/kSX3ROI4QG","created_at":"Fri Jul 20 14:35:59 +0000 2018","retweet_count":42353,"favorite_count":0,"is_retweet":true,"id_str":"1020316392548196354"},{"source":"Twitter for iPhone","text":"Will the Dems and Fake News ever learn? This is classic! https://t.co/kSX3ROI4QG","created_at":"Thu Jul 19 18:14:25 +0000 2018","retweet_count":42344,"favorite_count":114026,"is_retweet":false,"id_str":"1020008975922810883"},{"source":"Twitter for iPhone","text":"The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media. I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear........","created_at":"Thu Jul 19 13:24:58 +0000 2018","retweet_count":23783,"favorite_count":101069,"is_retweet":false,"id_str":"1019936133147516929"},{"source":"Twitter for iPhone","text":"“Trump recognized Russian Meddling MANY TIMES.” Thank you to @foxandfriends and @FoxNews for actually showing the clips. The Fake News wants no part of that narrative! Too bad they don’t want to focus on all of the ECONOMIC and JOBS records being set.","created_at":"Thu Jul 19 11:13:48 +0000 2018","retweet_count":17120,"favorite_count":69609,"is_retweet":false,"id_str":"1019903123312308224"},{"source":"Twitter for iPhone","text":"The Fake News Media wants so badly to see a major confrontation with Russia, even a confrontation that could lead to war. They are pushing so recklessly hard and hate the fact that I’ll probably have a good relationship with Putin. We are doing MUCH better than any other country!","created_at":"Thu Jul 19 10:59:26 +0000 2018","retweet_count":22658,"favorite_count":91171,"is_retweet":false,"id_str":"1019899507910283264"},{"source":"Twitter for iPhone","text":"The Fake News Media is going Crazy! They make up stories without any backup, sources or proof. Many of the stories written about me, and the good people surrounding me, are total fiction. Problem is, when you complain you just give them more publicity. But I’ll complain anyway!","created_at":"Thu Jul 19 10:37:57 +0000 2018","retweet_count":26071,"favorite_count":114313,"is_retweet":false,"id_str":"1019894101116948480"},{"source":"Twitter for iPhone","text":"The meeting between President Putin and myself was a great success, except in the Fake News Media!","created_at":"Wed Jul 18 00:21:54 +0000 2018","retweet_count":22981,"favorite_count":106481,"is_retweet":false,"id_str":"1019376680572456960"},{"source":"Twitter for iPhone","text":"While I had a great meeting with NATO, raising vast amounts of money, I had an even better meeting with Vladimir Putin of Russia. Sadly, it is not being reported that way - the Fake News is going Crazy!","created_at":"Tue Jul 17 14:22:28 +0000 2018","retweet_count":23733,"favorite_count":98305,"is_retweet":false,"id_str":"1019225830298456066"},{"source":"Twitter for iPhone","text":"There hasn’t been a missile or rocket fired in 9 months in North Korea, there have been no nuclear tests and we got back our hostages. Who knows how it will all turn out in the end, but why isn’t the Fake News talking about these wonderful facts? Because it is FAKE NEWS!","created_at":"Sun Jul 15 16:11:13 +0000 2018","retweet_count":30467,"favorite_count":127281,"is_retweet":false,"id_str":"1018528420093878272"},{"source":"Twitter for iPhone","text":"These Russian individuals did their work during the Obama years. Why didn’t Obama do something about it?  Because he thought Crooked Hillary Clinton would win, that’s why. Had nothing to do with the Trump Administration, but Fake News doesn’t want to report the truth, as usual!","created_at":"Sat Jul 14 18:17:37 +0000 2018","retweet_count":40945,"favorite_count":147696,"is_retweet":false,"id_str":"1018197842559725569"},{"source":"Twitter for iPhone","text":"So funny! I just checked out Fake News CNN, for the first time in a long time (they are dying in the ratings), to see if they covered my takedown yesterday of Jim Acosta (actually a nice guy). They didn’t! But they did say I already lost in my meeting with Putin. Fake News......","created_at":"Sat Jul 14 11:24:13 +0000 2018","retweet_count":21629,"favorite_count":95859,"is_retweet":false,"id_str":"1018093807060045824"},{"source":"Twitter for iPhone","text":"The failing NY Times Fake News story today about breast feeding must be called out. The U.S. strongly supports breast feeding but we don’t believe women should be denied access to formula. Many women need this option because of malnutrition and poverty.","created_at":"Mon Jul 09 17:04:04 +0000 2018","retweet_count":22998,"favorite_count":99823,"is_retweet":false,"id_str":"1016367395294908421"},{"source":"Twitter for iPhone","text":"After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pore over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","created_at":"Tue Jul 03 23:13:34 +0000 2018","retweet_count":15333,"favorite_count":88278,"is_retweet":false,"id_str":"1014286054805987330"},{"source":"Twitter for iPhone","text":"After having written many best selling books, and somewhat priding myself on my ability to write, it should be noted that the Fake News constantly likes to pour over my tweets looking for a mistake. I capitalize certain words only for emphasis, not b/c they should be capitalized!","created_at":"Tue Jul 03 21:19:04 +0000 2018","retweet_count":8927,"favorite_count":42472,"is_retweet":false,"id_str":"1014257237945176071"},{"source":"Twitter for iPhone","text":"Many good conversations with North Korea-it is going well! In the meantime, no Rocket Launches or Nuclear Testing in 8 months. All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea!","created_at":"Tue Jul 03 11:16:18 +0000 2018","retweet_count":19276,"favorite_count":83420,"is_retweet":false,"id_str":"1014105549624037377"},{"source":"Twitter for iPhone","text":"Such a difference in the media coverage of the same immigration policies between the Obama Administration and ours. Actually, we have done a far better job in that our facilities are cleaner and better run than were the facilities under Obama. Fake News is working overtime!","created_at":"Mon Jun 25 12:36:29 +0000 2018","retweet_count":25797,"favorite_count":103399,"is_retweet":false,"id_str":"1011226622324887556"},{"source":"Twitter for iPhone","text":"Drudge Report  “OBAMA KEPT THEM IN CAGES, WRAPPED THEM IN FOIL” We do a much better job while at the same time maintaining a MUCH stronger Border! Mainstream Fake Media hates this story.","created_at":"Sat Jun 23 12:52:57 +0000 2018","retweet_count":30988,"favorite_count":111361,"is_retweet":false,"id_str":"1010505990259855361"},{"source":"Twitter for iPhone","text":"“I REALLY DON’T CARE, DO U?” written on the back of Melania’s jacket, refers to the Fake News Media. Melania has learned how dishonest they are, and she truly no longer cares!","created_at":"Thu Jun 21 21:51:07 +0000 2018","retweet_count":41413,"favorite_count":159572,"is_retweet":false,"id_str":"1009916650622251009"},{"source":"Twitter for iPhone","text":"“FBI texts have revealed anti-Trump Bias.” @FoxNews  Big News, but the Fake News doesn’t want to cover. Total corruption - the Witch Hunt has turned out to be a scam! At some point soon the Mainstream Media will have to cover correctly, too big a story!","created_at":"Wed Jun 20 14:00:18 +0000 2018","retweet_count":22186,"favorite_count":83338,"is_retweet":false,"id_str":"1009435777992884227"},{"source":"Twitter for iPhone","text":"The Fake News is not mentioning the safety and security of our Country when talking about illegal immigration. Our immigration laws are the weakest and worst anywhere in the world, and the Dems will do anything not to change them &amp; to obstruct-want open borders which means crime!","created_at":"Wed Jun 20 12:25:17 +0000 2018","retweet_count":32075,"favorite_count":126623,"is_retweet":false,"id_str":"1009411866475532288"},{"source":"Twitter for iPhone","text":"If President Obama (who got nowhere with North Korea and would have had to go to war with many millions of people being killed) had gotten along with North Korea and made the initial steps toward a deal that I have, the Fake News would have named him a national hero!","created_at":"Mon Jun 18 14:57:40 +0000 2018","retweet_count":26893,"favorite_count":120464,"is_retweet":false,"id_str":"1008725438972211200"},{"source":"Twitter for iPhone","text":"Why was the FBI giving so much information to the Fake News Media. They are not supposed to be doing that, and knowing the enemy of the people Fake News, they put their own spin on it - truth doesn’t matter to them!","created_at":"Mon Jun 18 00:25:53 +0000 2018","retweet_count":24521,"favorite_count":101649,"is_retweet":false,"id_str":"1008506045373845504"},{"source":"Twitter for iPhone","text":"Washington Post employees want to go on strike because Bezos isn’t paying them enough. I think a really long strike would be a great idea. Employees would get more money and we would get rid of Fake News for an extended period of time! Is @WaPo a registered lobbyist?","created_at":"Sun Jun 17 13:26:28 +0000 2018","retweet_count":16714,"favorite_count":70925,"is_retweet":false,"id_str":"1008340100877570048"},{"source":"Twitter for iPhone","text":"Funny how the Fake News, in a coordinated effort with each other, likes to say I gave sooo much to North Korea because I “met.” That’s because that’s all they have to disparage! We got so much for peace in the world, &amp; more is being added in finals. Even got our hostages/remains!","created_at":"Sun Jun 17 12:40:02 +0000 2018","retweet_count":17152,"favorite_count":78676,"is_retweet":false,"id_str":"1008328413210398720"},{"source":"Twitter for iPhone","text":"Please clear up the Fake News! https://t.co/3VbIKbmKwP","created_at":"Sun Jun 17 11:58:01 +0000 2018","retweet_count":12335,"favorite_count":51986,"is_retweet":false,"id_str":"1008317842264088576"},{"source":"Twitter for iPhone","text":"The Fake News Media said that I did not get along with other Leaders at the #G7Summit in Canada. They are once again, WRONG! https://t.co/I6eEKEZV6z","created_at":"Fri Jun 15 22:23:44 +0000 2018","retweet_count":17801,"favorite_count":73047,"is_retweet":false,"id_str":"1007750530976927744"},{"source":"Twitter for iPhone","text":"I have a great relationship with Angela Merkel of Germany, but the Fake News Media only shows the bad photos (implying anger) of negotiating an agreement - where I am asking for things that no other American President would ask for! https://t.co/Ib97nN5HZt","created_at":"Fri Jun 15 22:03:07 +0000 2018","retweet_count":21846,"favorite_count":81808,"is_retweet":false,"id_str":"1007745343306584064"},{"source":"Twitter for iPhone","text":"I’ve had to beat 17 very talented people including the Bush Dynasty, then I had to beat the Clinton Dynasty, and now I have to beat a phony Witch Hunt and all of the dishonest people covered in the IG Report...and never forget the Fake News Media. It never ends!","created_at":"Fri Jun 15 17:49:38 +0000 2018","retweet_count":37551,"favorite_count":154084,"is_retweet":false,"id_str":"1007681553676283904"},{"source":"Twitter for iPhone","text":"So, the Democrats make up a phony crime, Collusion with the Russians, pay a fortune to make the crime sound real, illegally leak (Comey) classified information so that a Special Councel will be appointed, and then Collude to make this pile of garbage take on life in Fake News!","created_at":"Thu Jun 14 15:08:51 +0000 2018","retweet_count":31670,"favorite_count":117201,"is_retweet":false,"id_str":"1007278701996802048"},{"source":"Twitter for iPhone","text":"So funny to watch the Fake News, especially NBC and CNN. They are fighting hard to downplay the deal with North Korea. 500 days ago they would have “begged” for this deal-looked like war would break out. Our Country’s biggest enemy is the Fake News so easily promulgated by fools!","created_at":"Wed Jun 13 13:30:49 +0000 2018","retweet_count":42887,"favorite_count":164892,"is_retweet":false,"id_str":"1006891643985854464"},{"source":"Twitter for iPhone","text":"Many more Republican voters showed up yesterday than the Fake News thought possible. The political pundits just don’t get what is going on out there - or they do get it but refuse to report the facts! Remember, Dems are High Tax, High Crime, easy to beat!","created_at":"Wed Jun 06 14:04:29 +0000 2018","retweet_count":20181,"favorite_count":81396,"is_retweet":false,"id_str":"1004363400674234368"},{"source":"Twitter for iPhone","text":"...Four reporters spotted Melania in the White House last week walking merrily along to a meeting. They never reported the sighting because it would hurt the sick narrative that she was living in a different part of the world, was really ill, or whatever. Fake News is really bad!","created_at":"Wed Jun 06 13:54:17 +0000 2018","retweet_count":22197,"favorite_count":97195,"is_retweet":false,"id_str":"1004360833407815680"},{"source":"Twitter for iPhone","text":"The Fake News Media has been so unfair, and vicious, to my wife and our great First Lady, Melania. During her recovery from surgery they reported everything from near death, to facelift, to left the W.H. (and me) for N.Y. or Virginia, to abuse. All Fake, she is doing really well!","created_at":"Wed Jun 06 13:48:20 +0000 2018","retweet_count":26463,"favorite_count":124105,"is_retweet":false,"id_str":"1004359335399641089"},{"source":"Twitter for iPhone","text":"Great night for Republicans! Congratulations to John Cox on a really big number in California. He can win. Even Fake News CNN said the Trump impact was really big, much bigger than they ever thought possible. So much for the big Blue Wave, it may be a big Red Wave. Working hard!","created_at":"Wed Jun 06 13:16:34 +0000 2018","retweet_count":19546,"favorite_count":85754,"is_retweet":false,"id_str":"1004351340041199616"},{"source":"Twitter for iPhone","text":"RT @parscale: Since the #FakeNews is full of distortions, underreporting, and lies, we launched a platform tonight presenting a comprehensi…","created_at":"Wed Jun 06 00:43:28 +0000 2018","retweet_count":15746,"favorite_count":0,"is_retweet":true,"id_str":"1004161816501673985"},{"source":"Twitter for iPhone","text":"The Fake News Media is desperate to distract from the economy and record setting economic numbers and so they keep talking about the phony Russian Witch Hunt.","created_at":"Mon Jun 04 20:41:55 +0000 2018","retweet_count":20378,"favorite_count":89591,"is_retweet":false,"id_str":"1003738642903420928"},{"source":"Twitter for iPhone","text":"There was No Collusion with Russia (except by the Democrats). When will this very expensive Witch Hunt Hoax ever end? So bad for our Country. Is the Special Counsel/Justice Department leaking my lawyers letters to the Fake News Media? Should be looking at Dems corruption instead?","created_at":"Sat Jun 02 17:43:07 +0000 2018","retweet_count":18930,"favorite_count":76465,"is_retweet":false,"id_str":"1002968869043097600"},{"source":"Twitter for iPhone","text":"There was No Collusion with Russia (except by the Democrats). When will this very expensive Witch Hunt Hoax ever end? So bad for our Country. Is the Special Councel/Justice Department leaking my lawyers letters to the Fake News Media? Should be looking at Dems corruption instead?","created_at":"Sat Jun 02 17:31:02 +0000 2018","retweet_count":2041,"favorite_count":7228,"is_retweet":false,"id_str":"1002965829175169025"},{"source":"Twitter for iPhone","text":"Real @FoxNews is doing great, Fake News CNN is dead! https://t.co/1p37tPiB3v","created_at":"Sat Jun 02 16:46:05 +0000 2018","retweet_count":16671,"favorite_count":69999,"is_retweet":false,"id_str":"1002954515941941249"},{"source":"Twitter for iPhone","text":"Reports are there was indeed at least one FBI representative implanted, for political purposes, into my campaign for president. It took place very early on, and long before the phony Russia Hoax became a “hot” Fake News story. If true - all time biggest political scandal!","created_at":"Fri May 18 13:50:11 +0000 2018","retweet_count":27122,"favorite_count":89902,"is_retweet":false,"id_str":"997474432443707393"},{"source":"Twitter for iPhone","text":"Fake News Media had me calling Immigrants, or Illegal Immigrants, “Animals.” Wrong! They were begrudgingly forced to withdraw their stories. I referred to MS 13 Gang Members as “Animals,” a big difference - and so true. Fake News got it purposely wrong, as usual!","created_at":"Fri May 18 10:51:43 +0000 2018","retweet_count":43408,"favorite_count":160867,"is_retweet":false,"id_str":"997429518867591170"},{"source":"Twitter for iPhone","text":"Despite the disgusting, illegal and unwarranted Witch Hunt, we have had the most successful first 17 month Administration in U.S. history - by far! Sorry to the Fake News Media and “Haters,” but that’s the way it is!","created_at":"Thu May 17 13:52:44 +0000 2018","retweet_count":32409,"favorite_count":137132,"is_retweet":false,"id_str":"997112687799697408"},{"source":"Twitter for iPhone","text":"Can you believe that with all of the made up, unsourced stories I get from the Fake News Media, together with the  $10,000,000 Russian Witch Hunt (there is no Collusion), I now have my best Poll Numbers in a year. Much of the Media may be corrupt, but the People truly get it!","created_at":"Tue May 15 14:08:21 +0000 2018","retweet_count":32019,"favorite_count":140443,"is_retweet":false,"id_str":"996391840860471296"},{"source":"Twitter for iPhone","text":"The so-called leaks coming out of the White House are a massive over  exaggeration put out by the Fake News Media in order to make us look as bad as possible. With that being said, leakers are traitors and cowards, and we will find out who they are!","created_at":"Mon May 14 20:46:25 +0000 2018","retweet_count":26539,"favorite_count":118557,"is_retweet":false,"id_str":"996129630913482755"},{"source":"Twitter for iPhone","text":"Why doesn’t the Fake News Media state that the Trump Administration’s Anti-Trust Division has been, and is, opposed to the AT&amp;T purchase of Time Warner in a currently ongoing Trial. Such a disgrace in reporting!","created_at":"Fri May 11 23:49:40 +0000 2018","retweet_count":22854,"favorite_count":94539,"is_retweet":false,"id_str":"995088584221839360"},{"source":"Twitter for iPhone","text":"The Failing New York Times criticized Secretary of State Pompeo for being AWOL (missing), when in fact he was flying to North Korea. Fake News, so bad!","created_at":"Wed May 09 22:38:10 +0000 2018","retweet_count":26369,"favorite_count":106024,"is_retweet":false,"id_str":"994345813064192012"},{"source":"Twitter for iPhone","text":"The Fake News is working overtime. Just reported that, despite the tremendous success we are having with the economy &amp; all things else, 91% of the Network News about me is negative (Fake). Why do we work so hard in working with the media when it is corrupt? Take away credentials?","created_at":"Wed May 09 11:38:45 +0000 2018","retweet_count":27761,"favorite_count":120207,"is_retweet":false,"id_str":"994179864436596736"},{"source":"Twitter for iPhone","text":"NBC NEWS is wrong again! They cite “sources” which are constantly wrong. Problem is, like so many others, the sources probably don’t exist, they are fabricated, fiction! NBC, my former home with the Apprentice, is now as bad as Fake News CNN. Sad!","created_at":"Fri May 04 10:45:31 +0000 2018","retweet_count":20942,"favorite_count":87371,"is_retweet":false,"id_str":"992354530510721025"},{"source":"Twitter for iPhone","text":"The White House is running very smoothly despite phony Witch Hunts etc. There is great Energy and unending Stamina, both necessary to get things done. We are accomplishing the unthinkable and setting positive records while doing so! Fake News is going “bonkers!”","created_at":"Mon Apr 30 23:02:13 +0000 2018","retweet_count":21890,"favorite_count":96062,"is_retweet":false,"id_str":"991090373417152515"},{"source":"Twitter for iPhone","text":"The Fake News is going crazy making up false stories and using only unnamed sources (who don’t exist). They are totally unhinged, and the great success of this Administration is making them do and say things that even they can’t believe they are saying. Truly bad people!","created_at":"Mon Apr 30 22:49:55 +0000 2018","retweet_count":26345,"favorite_count":110396,"is_retweet":false,"id_str":"991087278515769345"},{"source":"Twitter for iPhone","text":"The White House Correspondents’ Dinner is DEAD as we know it. This was a total disaster and an embarrassment to our great Country and all that it stands for. FAKE NEWS is alive and well and beautifully represented on Saturday night!","created_at":"Mon Apr 30 12:10:58 +0000 2018","retweet_count":23530,"favorite_count":108339,"is_retweet":false,"id_str":"990926480329859073"},{"source":"Twitter for iPhone","text":"“Clapper lied about (fraudulent) Dossier leaks to CNN” @foxandfriends FoxNews  He is a lying machine who now works for Fake News CNN.","created_at":"Sat Apr 28 12:58:18 +0000 2018","retweet_count":21053,"favorite_count":79744,"is_retweet":false,"id_str":"990213619190202369"},{"source":"Twitter for iPhone","text":"Sleepy Eyes Chuck Todd of Fake News NBC just stated that we have given up so much in our negotiations with North Korea, and they have given up nothing. Wow, we haven’t given up anything &amp; they have agreed to denuclearization (so great for World), site closure, &amp; no more testing!","created_at":"Sun Apr 22 12:50:22 +0000 2018","retweet_count":25871,"favorite_count":102315,"is_retweet":false,"id_str":"988037292932653056"},{"source":"Twitter for iPhone","text":"Can you believe that despite 93% bad stories from the Fake News Media (should be getting good stories), today we had just about our highest Poll Numbers, including those on Election Day? The American public is wise to the phony an dishonest press. Make America Great Again!","created_at":"Fri Apr 20 20:25:13 +0000 2018","retweet_count":32021,"favorite_count":131814,"is_retweet":false,"id_str":"987426984195174405"},{"source":"Twitter for iPhone","text":"A sketch years later about a nonexistent man. A total con job, playing the Fake News Media for Fools (but they know it)! https://t.co/9Is7mHBFda","created_at":"Wed Apr 18 10:08:50 +0000 2018","retweet_count":17869,"favorite_count":61945,"is_retweet":false,"id_str":"986547093610299392"},{"source":"Twitter for iPhone","text":"Rasmussen just came out at 51% Approval despite the Fake News Media. They were one of the three most accurate on Election Day. Just about the most inaccurate were CNN and ABC News/Washington Post, and they haven’t changed (get new pollsters). Much of the media is a Scam!","created_at":"Tue Apr 17 17:59:39 +0000 2018","retweet_count":18409,"favorite_count":77972,"is_retweet":false,"id_str":"986303188587425794"},{"source":"Twitter for iPhone","text":"Just hit 50% in the Rasmussen Poll, much higher than President Obama at same point. With all of the phony stories and Fake News, it’s hard to believe! Thank you America, we are doing Great Things.","created_at":"Sun Apr 15 14:44:30 +0000 2018","retweet_count":29754,"favorite_count":141548,"is_retweet":false,"id_str":"985529299905187840"},{"source":"Twitter for iPhone","text":"The Syrian raid was so perfectly carried out, with such precision, that the only way the Fake News Media could demean was by my use of the term “Mission Accomplished.” I knew they would seize on this but felt it is such a great Military term, it should be brought back. Use often!","created_at":"Sun Apr 15 12:19:42 +0000 2018","retweet_count":24048,"favorite_count":115575,"is_retweet":false,"id_str":"985492862958698497"},{"source":"Twitter for iPhone","text":"If I wanted to fire Robert Mueller in December, as reported by the Failing New York Times, I would have fired him. Just more Fake News from a biased newspaper!","created_at":"Thu Apr 12 10:03:46 +0000 2018","retweet_count":19214,"favorite_count":87391,"is_retweet":false,"id_str":"984371491277099010"},{"source":"Twitter for iPhone","text":"So much Fake News about what is going on in the White House. Very calm and calculated with a big focus on open and fair trade with China, the coming North Korea meeting and, of course, the vicious gas attack in Syria. Feels great to have Bolton &amp; Larry K on board. I (we) are","created_at":"Wed Apr 11 10:38:42 +0000 2018","retweet_count":16168,"favorite_count":69376,"is_retweet":false,"id_str":"984017894240604161"},{"source":"Twitter for iPhone","text":"Do you believe that the Fake News Media is pushing hard on a story that I am going to replace A.G. Jeff Sessions with EPA Chief Scott Pruitt, who is doing a great job but is TOTALLY under siege? Do people really believe this stuff? So much of the media is dishonest and corrupt!","created_at":"Fri Apr 06 14:46:10 +0000 2018","retweet_count":22927,"favorite_count":91125,"is_retweet":false,"id_str":"982268230306709509"},{"source":"Twitter for iPhone","text":"The Fake News Washington Post, Amazon’s “chief lobbyist,” has another (of many) phony headlines, “Trump Defiant As China Adds Trade Penalties.” WRONG! Should read, “Trump Defiant as U.S. Adds Trade Penalties, Will End Barriers And Massive  I.P. Theft.” Typically bad reporting!","created_at":"Thu Apr 05 13:10:07 +0000 2018","retweet_count":24732,"favorite_count":93542,"is_retweet":false,"id_str":"981881669593559040"},{"source":"Twitter for iPhone","text":"The Fake News Networks, those that knowingly have a sick and biased AGENDA, are worried about the competition and quality of Sinclair Broadcast. The “Fakers” at CNN, NBC, ABC &amp; CBS have done so much dishonest reporting that they should only be allowed to get awards for fiction!","created_at":"Tue Apr 03 10:34:18 +0000 2018","retweet_count":21418,"favorite_count":86809,"is_retweet":false,"id_str":"981117684489379840"},{"source":"Twitter for iPhone","text":"So funny to watch Fake News Networks, among the most dishonest groups of people I have ever dealt with, criticize Sinclair Broadcasting for being biased. Sinclair is far superior to CNN and even more Fake NBC, which is a total joke.","created_at":"Mon Apr 02 13:28:42 +0000 2018","retweet_count":19085,"favorite_count":82200,"is_retweet":false,"id_str":"980799183425802240"},{"source":"Twitter for iPhone","text":"So much Fake News. Never been more voluminous or more inaccurate. But through it all, our country is doing great!","created_at":"Mon Mar 26 12:38:55 +0000 2018","retweet_count":27436,"favorite_count":133788,"is_retweet":false,"id_str":"978249938743234560"},{"source":"Twitter for iPhone","text":"Many lawyers and top law firms want to represent me in the Russia case...don’t believe the Fake News narrative that it is hard to find a lawyer who wants to take this on. Fame &amp; fortune will NEVER be turned down by a lawyer, though some are conflicted. Problem is that a new......","created_at":"Sun Mar 25 11:40:41 +0000 2018","retweet_count":14318,"favorite_count":66686,"is_retweet":false,"id_str":"977872899792089088"},{"source":"Twitter for iPhone","text":"I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing.......","created_at":"Wed Mar 21 18:56:14 +0000 2018","retweet_count":29872,"favorite_count":131185,"is_retweet":false,"id_str":"976532956557737984"},{"source":"Twitter for iPhone","text":"The Fake News is beside themselves that McCabe was caught, called out and fired. How many hundreds of thousands of dollars was given to wife’s campaign by Crooked H friend, Terry M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more!","created_at":"Sat Mar 17 17:34:21 +0000 2018","retweet_count":39341,"favorite_count":143283,"is_retweet":false,"id_str":"975062797162811394"},{"source":"Twitter for iPhone","text":"Rasmussen and others have my approval ratings at around 50%, which is higher than Obama, and yet the political pundits love saying my approval ratings are “somewhat low.” They know they are lying when they say it. Turn off the show - FAKE NEWS!","created_at":"Sun Mar 11 15:16:22 +0000 2018","retweet_count":24696,"favorite_count":106270,"is_retweet":false,"id_str":"972853747750711296"},{"source":"Twitter for iPhone","text":"The Republicans are 5-0 in recent Congressional races, a point which the Fake News Media continuously fails to mention. I backed and campaigned for all of the winners. They give me credit for one. Hopefully, Rick Saccone will be another big win on Tuesday.","created_at":"Sun Mar 11 14:02:23 +0000 2018","retweet_count":18305,"favorite_count":78098,"is_retweet":false,"id_str":"972835128056664066"},{"source":"Twitter for iPhone","text":"The new Fake News narrative is that there is CHAOS in the White House. Wrong! People will always come &amp; go, and I want strong dialogue before making a final decision. I still have some people that I want to change (always seeking perfection). There is no Chaos, only great Energy!","created_at":"Tue Mar 06 12:55:35 +0000 2018","retweet_count":22761,"favorite_count":97985,"is_retweet":false,"id_str":"971006379375972354"},{"source":"Twitter for iPhone","text":"“School shooting survivor says he quit @CNN Town Hall after refusing scripted question.” @TuckerCarlson. Just like so much of CNN, Fake News. That’s why their ratings are so bad! MSNBC may be worse.","created_at":"Fri Feb 23 01:26:26 +0000 2018","retweet_count":32011,"favorite_count":113224,"is_retweet":false,"id_str":"966846679784837120"},{"source":"Twitter for iPhone","text":"I never said “give teachers guns” like was stated on Fake News @CNN &amp; @NBC. What I said was to look at the possibility of giving “concealed guns to gun adept teachers with military or special training experience - only the best. 20% of teachers, a lot, would now be able to","created_at":"Thu Feb 22 12:26:28 +0000 2018","retweet_count":22391,"favorite_count":88498,"is_retweet":false,"id_str":"966650397002813440"},{"source":"Twitter for iPhone","text":"Bad ratings @CNN &amp; @MSNBC got scammed when they covered the anti-Trump Russia rally wall-to-wall. They probably knew it was Fake News but, because it was a rally against me, they pushed it hard anyway. Two really dishonest newscasters, but the public is wise!","created_at":"Wed Feb 21 01:08:00 +0000 2018","retweet_count":22372,"favorite_count":95052,"is_retweet":false,"id_str":"966117265426001920"},{"source":"Twitter for iPhone","text":"A woman I don’t know and, to the best of my knowledge, never met, is on the FRONT PAGE of the Fake News Washington Post saying I kissed her (for two minutes yet) in the lobby of Trump Tower 12 years ago. Never happened! Who would do this in a public space with live security......","created_at":"Tue Feb 20 15:16:06 +0000 2018","retweet_count":21676,"favorite_count":96352,"is_retweet":false,"id_str":"965968309358333952"},{"source":"Twitter for iPhone","text":"I have been much tougher on Russia than Obama, just look at the facts. Total Fake News!","created_at":"Tue Feb 20 13:38:49 +0000 2018","retweet_count":16216,"favorite_count":77951,"is_retweet":false,"id_str":"965943827931549696"},{"source":"Twitter for iPhone","text":"The Fake News of big ratings loser CNN. https://t.co/rYsv90cnvs","created_at":"Sun Feb 18 13:46:39 +0000 2018","retweet_count":19637,"favorite_count":76885,"is_retweet":false,"id_str":"965221024496279552"},{"source":"Twitter for iPhone","text":"The Fake News Media never fails. Hard to ignore this fact from the Vice President of Facebook Ads, Rob Goldman! https://t.co/XGC7ynZwYJ","created_at":"Sat Feb 17 20:11:32 +0000 2018","retweet_count":18770,"favorite_count":60818,"is_retweet":false,"id_str":"964955496137535488"},{"source":"Twitter for iPhone","text":"Funny how the Fake News Media doesn’t want to say that the Russian group was formed in 2014, long before my run for President. Maybe they knew I was going to run even though I didn’t know!","created_at":"Sat Feb 17 19:46:48 +0000 2018","retweet_count":25523,"favorite_count":105922,"is_retweet":false,"id_str":"964949269374529538"},{"source":"Twitter for iPhone","text":"So many positive things going on for the U.S.A. and the Fake News Media just doesn’t want to go there. Same negative stories over and over again! No wonder the People no longer trust the media, whose approval ratings are correctly at their lowest levels in history!    #MAGA","created_at":"Sun Feb 11 18:21:48 +0000 2018","retweet_count":31128,"favorite_count":123868,"is_retweet":false,"id_str":"962753552824365056"},{"source":"Twitter for iPhone","text":"Even Crazy Jim Acosta of Fake News CNN agrees: “Trump World and WH sources dancing in end zone: Trump wins again...Schumer and Dems caved...gambled and lost.” Thank you for your honesty Jim!","created_at":"Tue Jan 23 11:31:40 +0000 2018","retweet_count":27462,"favorite_count":129596,"is_retweet":false,"id_str":"955764970590961665"},{"source":"Twitter for iPhone","text":"And the FAKE NEWS winners are...\nhttps://t.co/59G6x2f7fD","created_at":"Thu Jan 18 01:00:05 +0000 2018","retweet_count":41677,"favorite_count":112931,"is_retweet":false,"id_str":"953794085751574534"},{"source":"Twitter for iPhone","text":"Do you notice the Fake News Mainstream Media never likes covering the great and record setting economic news, but rather talks about anything negative or that can be turned into the negative. The Russian Collusion Hoax is dead, except as it pertains to the Dems. Public gets it!","created_at":"Tue Jan 16 14:19:46 +0000 2018","retweet_count":26530,"favorite_count":111945,"is_retweet":false,"id_str":"953270558573154305"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: So much Fake News is being reported. They don’t even try to get it right, or correct it when they are wrong. They prom…","created_at":"Sun Jan 14 13:04:18 +0000 2018","retweet_count":34679,"favorite_count":0,"is_retweet":true,"id_str":"952526791658360833"},{"source":"Twitter for iPhone","text":"...and they knew exactly what I said and meant. They just wanted a story. FAKE NEWS!","created_at":"Sun Jan 14 13:01:44 +0000 2018","retweet_count":16641,"favorite_count":83609,"is_retweet":false,"id_str":"952526145064505345"},{"source":"Twitter for iPhone","text":"So much Fake News is being reported. They don’t even try to get it right, or correct it when they are wrong. They promote the Fake Book of a mentally deranged author, who knowingly writes false information. The Mainstream Media is crazed that WE won the election!","created_at":"Sat Jan 13 22:08:34 +0000 2018","retweet_count":34708,"favorite_count":148208,"is_retweet":false,"id_str":"952301373479104512"},{"source":"Twitter for iPhone","text":"The Fake News Awards, those going to the most corrupt &amp; biased of the Mainstream Media, will be presented to the losers on Wednesday, January 17th, rather than this coming Monday. The interest in, and importance of, these awards is far greater than anyone could have anticipated!","created_at":"Sun Jan 07 20:35:39 +0000 2018","retweet_count":37762,"favorite_count":151191,"id_str":"950103659337134080"},{"source":"Twitter for iPhone","text":"Jake Tapper of Fake News CNN just got destroyed in his interview with Stephen Miller of the Trump Administration. Watch the hatred and unfairness of this CNN flunky!","created_at":"Sun Jan 07 15:15:50 +0000 2018","retweet_count":29604,"favorite_count":123429,"id_str":"950023175907266560"},{"source":"Twitter for iPhone","text":"I’ve had to put up with the Fake News from the first day I announced that I would be running for President. Now I have to put up with a Fake Book, written by a totally discredited author. Ronald Reagan had the same problem and handled it well. So will I!","created_at":"Sun Jan 07 14:40:06 +0000 2018","retweet_count":31447,"favorite_count":153387,"id_str":"950014185299210240"},{"source":"Twitter for iPhone","text":"Now that Russian collusion, after one year of intense study, has proven to be a total hoax on the American public, the Democrats and their lapdogs, the Fake News Mainstream Media, are taking out the old Ronald Reagan playbook and screaming mental stability and intelligence.....","created_at":"Sat Jan 06 12:19:10 +0000 2018","retweet_count":35083,"favorite_count":148583,"id_str":"949616329463615489"},{"source":"Twitter for iPhone","text":"Well, now that collusion with Russia is proving to be a total hoax and the only collusion is with Hillary Clinton and the FBI/Russia, the Fake News Media (Mainstream) and this phony new book are hitting out at every new front imaginable. They should try winning an election. Sad!","created_at":"Fri Jan 05 14:32:44 +0000 2018","retweet_count":33002,"favorite_count":147032,"id_str":"949287555660500992"},{"source":"Twitter for iPhone","text":"The Fake News Media barely mentions the fact that the Stock Market just hit another New Record and that business in the U.S. is booming...but the people know! Can you imagine if “O” was president and had these numbers - would be biggest story on earth! Dow now over 25,000.","created_at":"Fri Jan 05 04:04:20 +0000 2018","retweet_count":28059,"favorite_count":129174,"id_str":"949129410208202757"},{"source":"Twitter for iPhone","text":"I will be announcing THE MOST DISHONEST &amp; CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o’clock. Subjects will cover Dishonesty &amp; Bad Reporting in various categories from the Fake News Media. Stay tuned!","created_at":"Wed Jan 03 01:05:10 +0000 2018","retweet_count":51056,"favorite_count":196552,"id_str":"948359545767841792"},{"source":"Twitter for iPhone","text":"As our Country rapidly grows stronger and smarter, I want to wish all of my friends, supporters, enemies, haters, and even the very dishonest Fake News Media, a Happy and Healthy New Year. 2018 will be a great year for America!","created_at":"Sun Dec 31 22:18:20 +0000 2017","retweet_count":39698,"favorite_count":158995,"is_retweet":false,"id_str":"947592785519173637"},{"source":"Twitter for iPhone","text":"I use Social Media not because I like to, but because it is the only way to fight a VERY dishonest and unfair “press,” now often referred to as Fake News Media. Phony and non-existent “sources” are being used more often than ever. Many stories &amp; reports a pure fiction!","created_at":"Sat Dec 30 22:36:41 +0000 2017","retweet_count":50342,"favorite_count":195754,"is_retweet":false,"id_str":"947235015343202304"},{"source":"Twitter for iPhone","text":"While the Fake News loves to talk about my so-called low approval rating, @foxandfriends just showed that my rating on Dec. 28, 2017, was approximately the same as President Obama on Dec. 28, 2009, which was 47%...and this despite massive negative Trump coverage &amp; Russia hoax!","created_at":"Fri Dec 29 12:46:23 +0000 2017","retweet_count":23184,"favorite_count":98172,"is_retweet":false,"id_str":"946724075157651457"},{"source":"Twitter for iPhone","text":"The Tax Cut/Reform Bill, including Massive Alaska Drilling and the Repeal of the highly unpopular Individual Mandate, brought it all together as to what an incredible year we had. Don’t let the Fake News convince you otherwise...and our insider Polls are strong!","created_at":"Sun Dec 24 20:35:26 +0000 2017","retweet_count":23221,"favorite_count":111414,"is_retweet":false,"id_str":"945030174290186241"},{"source":"Twitter for iPhone","text":"The Fake News refuses to talk about how Big and how Strong our BASE is. They show Fake Polls just like they report Fake News. Despite only negative reporting, we are doing well - nobody is going to beat us. MAKE AMERICA GREAT AGAIN!","created_at":"Sun Dec 24 13:48:11 +0000 2017","retweet_count":33220,"favorite_count":140299,"is_retweet":false,"id_str":"944927689638662145"},{"source":"Twitter for iPhone","text":"The Stock Market is setting record after record and unemployment is at a 17 year low. So many things accomplished by the Trump Administration, perhaps more than any other President in first year. Sadly, will never be reported correctly by the Fake News Media!","created_at":"Sat Dec 23 22:44:45 +0000 2017","retweet_count":22728,"favorite_count":101231,"is_retweet":false,"id_str":"944700332881440769"},{"source":"Twitter for iPhone","text":"Was @foxandfriends just named the most influential show in news? You deserve it - three great people! The many Fake News Hate Shows should study your formula for success!","created_at":"Thu Dec 21 12:45:17 +0000 2017","retweet_count":19332,"favorite_count":92315,"is_retweet":false,"id_str":"943824695144697857"},{"source":"Twitter for iPhone","text":"The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bosses, will soon be kicking in and will speak for themselves. Companies are already making big payments to workers. Dems want to raise taxes, hate these big Cuts!","created_at":"Thu Dec 21 12:24:22 +0000 2017","retweet_count":25744,"favorite_count":111795,"is_retweet":false,"id_str":"943819430735372289"},{"source":"Twitter for iPhone","text":"The Tax Cuts are so large and so meaningful, and yet the Fake News is working overtime to follow the lead of their friends, the defeated Dems, and only demean. This is truly a case where the results will speak for themselves, starting very soon. Jobs, Jobs, Jobs!","created_at":"Wed Dec 20 14:32:51 +0000 2017","retweet_count":18212,"favorite_count":79155,"is_retweet":false,"id_str":"943489378462130176"},{"source":"Twitter for iPhone","text":"A  story in the @washingtonpost that I was close to “rescinding” the nomination of Justice Gorsuch prior to confirmation is FAKE NEWS. I never even wavered and am very proud of him and the job he is doing as a Justice of the U.S. Supreme Court. The unnamed sources don’t exist!","created_at":"Tue Dec 19 15:07:01 +0000 2017","retweet_count":25350,"favorite_count":97388,"is_retweet":false,"id_str":"943135588496093190"},{"source":"Twitter for iPhone","text":"Wow, more than 90% of Fake News Media coverage of me is negative, with numerous forced retractions of untrue stories. Hence my use of Social Media, the only way to get the truth out. Much of Mainstream Meadia has become a joke! @foxandfriends","created_at":"Wed Dec 13 13:02:52 +0000 2017","retweet_count":29405,"favorite_count":120149,"is_retweet":false,"id_str":"940930017365778432"},{"source":"Twitter for iPhone","text":"Despite thousands of hours wasted and many millions of dollars spent, the Democrats have been unable to show any collusion with Russia - so now they are moving on to the false accusations and fabricated stories of women who I don’t know and/or have never met. FAKE NEWS!","created_at":"Tue Dec 12 12:10:58 +0000 2017","retweet_count":38156,"favorite_count":147886,"is_retweet":false,"id_str":"940554567414091776"},{"source":"Twitter for iPhone","text":"Another false story, this time in the Failing @nytimes, that I watch 4-8 hours of television a day - Wrong!  Also, I seldom, if ever, watch CNN or MSNBC, both of which I consider Fake News. I never watch Don Lemon, who I once called the “dumbest man on television!” Bad Reporting.","created_at":"Mon Dec 11 14:17:18 +0000 2017","retweet_count":34018,"favorite_count":138768,"is_retweet":false,"id_str":"940223974985871360"},{"source":"Twitter for iPhone","text":"Very little discussion of all the purposely false and defamatory stories put out this week by the Fake News Media. They are out of control - correct reporting means nothing to them. Major lies written, then forced to be withdrawn after they are exposed...a stain on America!","created_at":"Sun Dec 10 21:18:40 +0000 2017","retweet_count":30872,"favorite_count":120303,"is_retweet":false,"id_str":"939967625362276354"},{"source":"Twitter for iPhone","text":"Things are going really well for our economy, a subject the Fake News spends as little time as possible discussing! Stock Market hit another RECORD HIGH, unemployment is now at a 17 year low and companies are coming back into the USA. Really good news, and much more to come!","created_at":"Sun Dec 10 13:30:44 +0000 2017","retweet_count":28859,"favorite_count":127436,"is_retweet":false,"id_str":"939849867438034944"},{"source":"Twitter for iPhone","text":".@daveweigel of the Washington Post just admitted that his picture was a FAKE (fraud?) showing an almost empty arena last night for my speech in Pensacola when, in fact, he knew the arena was packed (as shown also on T.V.). FAKE NEWS, he should be fired.","created_at":"Sat Dec 09 23:14:34 +0000 2017","retweet_count":24272,"favorite_count":89981,"is_retweet":false,"id_str":"939634404267380736"},{"source":"Twitter for iPhone","text":".@DaveWeigel @WashingtonPost put out a phony photo of an empty arena hours before I arrived @ the venue, w/ thousands of people outside, on their way in. Real photos now shown as I spoke. Packed house, many people unable to get in. Demand apology &amp; retraction from FAKE NEWS WaPo! https://t.co/XAblFGh1ob","created_at":"Sat Dec 09 22:01:44 +0000 2017","retweet_count":24536,"favorite_count":77219,"is_retweet":false,"id_str":"939616077356642304"},{"source":"Twitter for iPhone","text":"CNN’S slogan is CNN, THE MOST TRUSTED NAME IN NEWS. Everyone knows this is not true, that this could, in fact, be a fraud on the American Public. There are many outlets that are far more trusted than Fake News CNN. Their slogan should be CNN, THE LEAST TRUSTED NAME IN NEWS!","created_at":"Sat Dec 09 13:21:24 +0000 2017","retweet_count":37477,"favorite_count":148043,"is_retweet":false,"id_str":"939485131693322240"},{"source":"Twitter for iPhone","text":"Fake News CNN made a vicious and purposeful mistake yesterday. They were caught red handed, just like lonely Brian Ross at ABC News (who should be immediately fired for his “mistake”). Watch to see if @CNN fires those responsible, or was it just gross incompetence?","created_at":"Sat Dec 09 13:02:23 +0000 2017","retweet_count":23857,"favorite_count":92778,"is_retweet":false,"id_str":"939480342779580416"},{"source":"Twitter for iPhone","text":"I never asked Comey to stop investigating Flynn. Just more Fake News covering another Comey lie!","created_at":"Sun Dec 03 11:15:02 +0000 2017","retweet_count":22966,"favorite_count":94011,"is_retweet":false,"id_str":"937279001684598784"},{"source":"Twitter for iPhone","text":"Congratulations to @ABC News for suspending Brian Ross for his horrendously inaccurate and dishonest report on the Russia, Russia, Russia Witch Hunt. More Networks and “papers” should do the same with their Fake News!","created_at":"Sun Dec 03 02:22:40 +0000 2017","retweet_count":27913,"favorite_count":107940,"is_retweet":false,"id_str":"937145025359761408"},{"source":"Twitter for iPhone","text":"The media has been speculating that I fired Rex Tillerson or that he would be leaving soon - FAKE NEWS! He’s not leaving and while we disagree on certain subjects, (I call the final shots) we work well together and America is highly respected again!\nhttps://t.co/FrqiPLFJ1E","created_at":"Fri Dec 01 20:08:22 +0000 2017","retweet_count":22573,"favorite_count":88187,"is_retweet":false,"id_str":"936688444046266368"},{"source":"Twitter for iPhone","text":"So now that Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","created_at":"Wed Nov 29 14:14:19 +0000 2017","retweet_count":23682,"favorite_count":87636,"is_retweet":false,"id_str":"935874566701842434"},{"source":"Twitter for iPhone","text":"So now tha Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate!","created_at":"Wed Nov 29 13:58:05 +0000 2017","retweet_count":3421,"favorite_count":11146,"is_retweet":false,"id_str":"935870484146683904"},{"source":"Twitter for iPhone","text":"Wow, Matt Lauer was just fired from NBC for “inappropriate sexual behavior in the workplace.” But when will the top executives at NBC &amp; Comcast be fired for putting out so much Fake News. Check out Andy Lack’s past!","created_at":"Wed Nov 29 12:16:21 +0000 2017","retweet_count":26294,"favorite_count":101785,"is_retweet":false,"id_str":"935844881825763328"},{"source":"Twitter for iPhone","text":"Great, and we should boycott Fake News CNN. Dealing with them is a total waste of time! https://t.co/8zJ3j7g5el","created_at":"Wed Nov 29 11:49:18 +0000 2017","retweet_count":16986,"favorite_count":68731,"is_retweet":false,"id_str":"935838073618870272"},{"source":"Twitter for iPhone","text":"We should have a contest as to which of the Networks, plus CNN and not including Fox, is the most dishonest, corrupt and/or distorted in its political coverage of your favorite President (me). They are all bad. Winner to receive the FAKE NEWS TROPHY!","created_at":"Mon Nov 27 14:04:51 +0000 2017","retweet_count":41765,"favorite_count":153835,"is_retweet":false,"id_str":"935147410472480769"},{"source":"Twitter for iPhone","text":"Wow, even I didn’t realize we did so much. Wish the Fake News would report! Thank you. https://t.co/ApVbu2b0Jd","created_at":"Sat Nov 25 23:25:54 +0000 2017","retweet_count":19946,"favorite_count":68715,"is_retweet":false,"id_str":"934563828834164739"},{"source":"Twitter Web Client","text":"One of the most accurate polls last time around. But #FakeNews likes to say we’re in the 30’s. They are wrong. Some people think numbers could be in the 50's. Together, WE will MAKE AMERICA GREAT AGAIN! https://t.co/YhrwkdObhP","created_at":"Tue Nov 14 08:07:29 +0000 2017","retweet_count":15736,"favorite_count":65280,"is_retweet":false,"id_str":"930346433177378817"},{"source":"Twitter Web Client","text":"Does the Fake News Media remember when Crooked Hillary Clinton, as Secretary of State, was begging Russia to be our friend with the misspelled reset button? Obama tried also, but he had zero chemistry with Putin.","created_at":"Sun Nov 12 00:43:36 +0000 2017","retweet_count":28716,"favorite_count":119569,"is_retweet":false,"id_str":"929509950811881472"},{"source":"Twitter for iPhone","text":"The rigged Dem Primary, one of the biggest political stories in years, got ZERO coverage on Fake News Network TV last night. Disgraceful!","created_at":"Fri Nov 03 16:09:52 +0000 2017","retweet_count":26212,"favorite_count":95184,"is_retweet":false,"id_str":"926481563214376961"},{"source":"Twitter for iPhone","text":"....earth shattering. He and his brother could Drain The Swamp, which would be yet another campaign promise fulfilled. Fake News weak!","created_at":"Tue Oct 31 14:10:42 +0000 2017","retweet_count":12677,"favorite_count":53862,"is_retweet":false,"id_str":"925364408364171265"},{"source":"Twitter for iPhone","text":"The Fake News is working overtime. As Paul Manaforts lawyer said, there was \"no collusion\" and events mentioned took place long before he...","created_at":"Tue Oct 31 12:09:41 +0000 2017","retweet_count":14552,"favorite_count":60002,"is_retweet":false,"id_str":"925333956110757888"},{"source":"Twitter for iPhone","text":"Just read the nice remarks by President Jimmy Carter about me and how badly I am treated by the press (Fake News). Thank you Mr. President!","created_at":"Sat Oct 28 12:28:28 +0000 2017","retweet_count":24370,"favorite_count":134020,"is_retweet":false,"id_str":"924251519121346560"},{"source":"Twitter for iPhone","text":"\"Clinton campaign &amp; DNC paid for research that led to the anti-Trump Fake News Dossier. The victim here is the President.\" @FoxNews","created_at":"Wed Oct 25 11:21:30 +0000 2017","retweet_count":23207,"favorite_count":79929,"is_retweet":false,"id_str":"923147501418446849"},{"source":"Twitter for iPhone","text":"It is finally sinking through. 46% OF PEOPLE BELIEVE MAJOR NATIONAL NEWS ORGS FABRICATE STORIES ABOUT ME. FAKE NEWS, even worse! Lost cred.","created_at":"Sun Oct 22 12:08:47 +0000 2017","retweet_count":27997,"favorite_count":125751,"is_retweet":false,"id_str":"922072236592435200"},{"source":"Twitter for iPhone","text":"Keep hearing about \"tiny\" amount of money spent on Facebook ads. What about the billions of dollars of Fake News on CNN, ABC, NBC &amp; CBS?","created_at":"Sat Oct 21 20:06:00 +0000 2017","retweet_count":24336,"favorite_count":101054,"is_retweet":false,"id_str":"921829947093733376"},{"source":"Twitter for iPhone","text":"Stock Market hits another all time high on Friday. 5.3 trillion dollars up since Election. Fake News doesn't spent much time on this!","created_at":"Sat Oct 21 13:14:33 +0000 2017","retweet_count":21391,"favorite_count":96172,"is_retweet":false,"id_str":"921726400922619904"},{"source":"Twitter for iPhone","text":"I hope the Fake News Media keeps talking about Wacky Congresswoman Wilson in that she, as a representative, is killing the Democrat Party!","created_at":"Sat Oct 21 12:07:16 +0000 2017","retweet_count":20325,"favorite_count":92789,"is_retweet":false,"id_str":"921709468055896064"},{"source":"Twitter for iPhone","text":"The Fake News is going crazy with wacky Congresswoman Wilson(D), who was SECRETLY on a very personal call, and gave a total lie on content!","created_at":"Fri Oct 20 02:53:42 +0000 2017","retweet_count":21124,"favorite_count":91586,"is_retweet":false,"id_str":"921207772233990144"},{"source":"Twitter for iPhone","text":"Uranium deal to Russia, with Clinton help and Obama Administration knowledge, is the biggest story that Fake Media doesn't want to follow!","created_at":"Thu Oct 19 11:17:52 +0000 2017","retweet_count":40651,"favorite_count":120166,"is_retweet":false,"id_str":"920972261032648705"},{"source":"Twitter for iPhone","text":"So much Fake News being put in dying magazines and newspapers. Only place worse may be @NBCNews, @CBSNews, @ABC and @CNN. Fiction writers!","created_at":"Tue Oct 17 21:51:34 +0000 2017","retweet_count":16242,"favorite_count":64187,"is_retweet":false,"id_str":"920406959320371200"},{"source":"Twitter for iPhone","text":"Sadly, they and others are Fake News, and the public is just beginning to figure it out! https://t.co/8B8AyA7V1s","created_at":"Fri Oct 13 11:10:30 +0000 2017","retweet_count":11885,"favorite_count":51866,"is_retweet":false,"id_str":"918796079243677696"},{"source":"Twitter for iPhone","text":"People are just now starting to find out how dishonest and disgusting (FakeNews) @NBCNews is. Viewers beware. May be worse than even @CNN!","created_at":"Fri Oct 13 00:12:59 +0000 2017","retweet_count":22416,"favorite_count":87857,"is_retweet":false,"id_str":"918630610167529472"},{"source":"Twitter for iPhone","text":"The Fake News Is going all out in order to demean and denigrate! Such hatred!","created_at":"Thu Oct 12 12:45:29 +0000 2017","retweet_count":16941,"favorite_count":80734,"is_retweet":false,"id_str":"918457595618365441"},{"source":"Twitter for iPhone","text":"With all of the Fake News coming out of NBC and the Networks, at what point is it appropriate to challenge their License? Bad for country!","created_at":"Wed Oct 11 13:55:44 +0000 2017","retweet_count":23284,"favorite_count":99249,"is_retweet":false,"id_str":"918112884630093825"},{"source":"Twitter for iPhone","text":"It would be really nice if the Fake News Media would report the virtually unprecedented Stock Market growth since the election.Need tax cuts","created_at":"Wed Oct 11 10:31:18 +0000 2017","retweet_count":15430,"favorite_count":74375,"is_retweet":false,"id_str":"918061437750267904"},{"source":"Twitter for iPhone","text":"The Fake News is at it again, this time trying to hurt one of the finest people I know, General John Kelly, by saying he will soon be.....","created_at":"Wed Oct 11 01:15:26 +0000 2017","retweet_count":16058,"favorite_count":69502,"is_retweet":false,"id_str":"917921548677328896"},{"source":"Twitter for iPhone","text":"Rex Tillerson never threatened to resign. This is Fake News put out by @NBCNews. Low news and reporting standards. No verification from me.","created_at":"Thu Oct 05 11:50:56 +0000 2017","retweet_count":18744,"favorite_count":79704,"is_retweet":false,"id_str":"915907150333009920"},{"source":"Twitter for iPhone","text":"Why Isn't the Senate Intel Committee looking into the Fake News Networks in OUR country to see why so much of our news is just made up-FAKE!","created_at":"Thu Oct 05 10:59:40 +0000 2017","retweet_count":23334,"favorite_count":93316,"is_retweet":false,"id_str":"915894251967385600"},{"source":"Twitter for iPhone","text":"RT @FoxNews: Geraldo Blasts 'Fake News' Reports About Trump's Visit to Puerto Rico https://t.co/9jO0D3BMvE","created_at":"Thu Oct 05 10:30:40 +0000 2017","retweet_count":11288,"favorite_count":0,"is_retweet":true,"id_str":"915886953194770433"},{"source":"Twitter for iPhone","text":"The @NBCNews story has just been totally refuted by Sec. Tillerson and @VP Pence. It is #FakeNews. They should issue an apology to AMERICA!","created_at":"Wed Oct 04 15:18:28 +0000 2017","retweet_count":18225,"favorite_count":69909,"is_retweet":false,"id_str":"915596990674849792"},{"source":"Twitter for iPhone","text":"NBC news is #FakeNews and more dishonest than even CNN. They are a disgrace to good reporting. No wonder their news ratings are way down!","created_at":"Wed Oct 04 14:47:53 +0000 2017","retweet_count":21975,"favorite_count":95643,"is_retweet":false,"id_str":"915589297096536065"},{"source":"Twitter for iPhone","text":"Wow, so many Fake News stories today. No matter what I do or say, they will not write or speak truth. The Fake News Media is out of control!","created_at":"Wed Oct 04 11:29:43 +0000 2017","retweet_count":38432,"favorite_count":157255,"is_retweet":false,"id_str":"915539424406114304"},{"source":"Twitter for iPhone","text":"We have done a great job with the almost impossible situation in Puerto Rico. Outside of the Fake News or politically motivated ingrates,...","created_at":"Sun Oct 01 12:22:14 +0000 2017","retweet_count":18284,"favorite_count":81847,"is_retweet":false,"id_str":"914465475777695744"},{"source":"Twitter for iPhone","text":"In analyzing the Alabama Primary race,FAKE NEWS always fails to mention that the candidate I endorsed went up MANY points after endorsement!","created_at":"Sat Sep 30 23:24:18 +0000 2017","retweet_count":7441,"favorite_count":47140,"is_retweet":false,"id_str":"914269704440737792"},{"source":"Twitter for iPhone","text":"In analyzing the Alabama Primary race, Fake News always fails to mention that the candidate I endorsed went up MANY points after Election!","created_at":"Sat Sep 30 23:16:31 +0000 2017","retweet_count":294,"favorite_count":1416,"is_retweet":false,"id_str":"914267744345972737"},{"source":"Media Studio","text":"Because of #FakeNews my people are not getting the credit they deserve for doing a great job. As seen here, they are ALL doing a GREAT JOB! https://t.co/1ltW2t3rwy","created_at":"Sat Sep 30 22:46:47 +0000 2017","retweet_count":32181,"favorite_count":93394,"is_retweet":false,"id_str":"914260261304860672"},{"source":"Twitter for iPhone","text":"@ricardorossello ......#FakeNews critics are working overtime, but we're getting great marks from the people that truly matter! \n#PRStrong🇵🇷","created_at":"Sat Sep 30 19:56:46 +0000 2017","retweet_count":7855,"favorite_count":35928,"is_retweet":false,"id_str":"914217477495717889"},{"source":"Twitter for iPhone","text":"To the people of Puerto Rico:\nDo not believe the #FakeNews!\n#PRStrong🇵🇷","created_at":"Sat Sep 30 19:53:51 +0000 2017","retweet_count":16067,"favorite_count":63449,"is_retweet":false,"id_str":"914216744385904640"},{"source":"Twitter for iPhone","text":"Despite the Fake News Media in conjunction with the Dems, an amazing job is being done in Puerto Rico. Great people!","created_at":"Sat Sep 30 18:04:59 +0000 2017","retweet_count":16910,"favorite_count":76847,"is_retweet":false,"id_str":"914189344533024768"},{"source":"Twitter for iPhone","text":"The Fake News Networks are working overtime in Puerto Rico doing their best to take the spirit away from our soldiers and first R's. Shame!","created_at":"Sat Sep 30 12:07:09 +0000 2017","retweet_count":24633,"favorite_count":91112,"is_retweet":false,"id_str":"914099295963553792"},{"source":"Twitter for iPhone","text":"Fake News CNN and NBC are going out of their way to disparage our great First Responders as a way to \"get Trump.\" Not fair to FR or effort!","created_at":"Sat Sep 30 11:48:36 +0000 2017","retweet_count":20901,"favorite_count":80326,"is_retweet":false,"id_str":"914094625488502784"},{"source":"Twitter for iPhone","text":"Facebook was always anti-Trump.The Networks were always anti-Trump hence,Fake News, @nytimes(apologized) &amp; @WaPo were anti-Trump. Collusion?","created_at":"Wed Sep 27 13:36:24 +0000 2017","retweet_count":16482,"favorite_count":66773,"is_retweet":false,"id_str":"913034591879024640"},{"source":"Twitter for iPhone","text":".@CNN is #FakeNews. Just reported COS (John Kelly) was opposed to my stance on NFL players disrespecting FLAG, ANTHEM, COUNTRY. Total lie!","created_at":"Mon Sep 25 22:26:30 +0000 2017","retweet_count":17397,"favorite_count":65726,"is_retweet":false,"id_str":"912443217227976704"},{"source":"Twitter for iPhone","text":"The greatest influence over our election was the Fake News Media \"screaming\" for Crooked Hillary Clinton. Next, she was a bad candidate!","created_at":"Fri Sep 22 11:26:06 +0000 2017","retweet_count":19652,"favorite_count":90167,"is_retweet":false,"id_str":"911189860769255424"},{"source":"Twitter for iPhone","text":"Fascinating to watch people writing books and major articles about me and yet they know nothing about me &amp; have zero access. #FAKE NEWS!","created_at":"Tue Sep 12 12:56:47 +0000 2017","retweet_count":24187,"favorite_count":107606,"is_retweet":false,"id_str":"907588803161939968"},{"source":"Twitter for iPhone","text":"General John Kelly is doing a fantastic job as Chief of Staff. There is tremendous spirit and talent in the W.H. Don't believe the Fake News","created_at":"Fri Aug 25 10:40:32 +0000 2017","retweet_count":18519,"favorite_count":86788,"is_retweet":false,"id_str":"901031532164468736"},{"source":"Twitter for iPhone","text":"The Fake News is now complaining about my different types of back to back speeches. Well, there was Afghanistan (somber), the big Rally.....","created_at":"Thu Aug 24 13:07:34 +0000 2017","retweet_count":14865,"favorite_count":69995,"is_retweet":false,"id_str":"900706146943717377"},{"source":"Twitter for iPhone","text":"The Fake News is now complaining about my different types of back to back speeches. Well, their was Afghanistan (somber), the big Rally.....","created_at":"Thu Aug 24 12:41:14 +0000 2017","retweet_count":2763,"favorite_count":11091,"is_retweet":false,"id_str":"900699520304066561"},{"source":"Twitter for iPhone","text":"Last night in Phoenix I read the things from my statements on Charlottesville that the Fake News Media didn't cover fairly. People got it!","created_at":"Wed Aug 23 13:40:31 +0000 2017","retweet_count":19691,"favorite_count":91085,"is_retweet":false,"id_str":"900352052068401154"},{"source":"Twitter for iPhone","text":"Thank you, the very dishonest Fake News Media is out of control! https://t.co/8J7y900VGK","created_at":"Mon Aug 21 13:32:06 +0000 2017","retweet_count":20686,"favorite_count":87097,"is_retweet":false,"id_str":"899625157421039616"},{"source":"Twitter for iPhone","text":"Jerry Falwell of Liberty University was fantastic on @foxandfriends. The Fake News should listen to what he had to say. Thanks Jerry!","created_at":"Mon Aug 21 13:27:12 +0000 2017","retweet_count":15972,"favorite_count":76326,"is_retweet":false,"id_str":"899623926082535425"},{"source":"Twitter for iPhone","text":"Heading back to Washington after working hard and watching some of the worst and most dishonest Fake News reporting I have ever seen!","created_at":"Sun Aug 20 23:22:07 +0000 2017","retweet_count":28832,"favorite_count":130525,"is_retweet":false,"id_str":"899411254061694979"},{"source":"Twitter for iPhone","text":"Steve Bannon will be a tough and smart new voice at @BreitbartNews...maybe even better than ever before. Fake News needs the competition!","created_at":"Sat Aug 19 17:47:26 +0000 2017","retweet_count":28313,"favorite_count":106751,"is_retweet":false,"id_str":"898964640817983488"},{"source":"Twitter for iPhone","text":"The public is learning (even more so) how dishonest the Fake News is. They totally misrepresent what I say about hate, bigotry etc. Shame!","created_at":"Thu Aug 17 10:32:11 +0000 2017","retweet_count":33033,"favorite_count":129351,"is_retweet":false,"id_str":"898130328916824064"},{"source":"Twitter for iPhone","text":"Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!","created_at":"Mon Aug 14 22:29:00 +0000 2017","retweet_count":34084,"favorite_count":129183,"is_retweet":false,"id_str":"897223558073602049"},{"source":"Twitter for iPhone","text":"After 200 days, rarely has any Administration achieved what we have achieved..not even close! Don't believe the Fake News Suppression Polls!","created_at":"Tue Aug 08 18:10:18 +0000 2017","retweet_count":25703,"favorite_count":111343,"is_retweet":false,"id_str":"894984126582972416"},{"source":"Twitter for iPhone","text":"The Fake News Media will not talk about the importance of the United Nations Security Council's 15-0 vote in favor of sanctions on N. Korea!","created_at":"Mon Aug 07 20:15:18 +0000 2017","retweet_count":20272,"favorite_count":85330,"is_retweet":false,"id_str":"894653195112378368"},{"source":"Twitter for iPhone","text":"Hard to believe that with 24/7 #Fake News on CNN, ABC, NBC, CBS, NYTIMES &amp; WAPO, the Trump base is getting stronger!","created_at":"Mon Aug 07 11:18:05 +0000 2017","retweet_count":17420,"favorite_count":74243,"is_retweet":false,"id_str":"894518002795900928"},{"source":"Twitter for iPhone","text":"...and West Virginia. The fact is the Fake News Russian collusion story, record Stock Market, border security, military strength, jobs.....","created_at":"Mon Aug 07 11:04:19 +0000 2017","retweet_count":12005,"favorite_count":59815,"is_retweet":false,"id_str":"894514535062790144"},{"source":"Twitter for iPhone","text":"The Trump base is far bigger &amp;  stronger than ever before (despite some phony Fake News polling). Look at rallies in Penn, Iowa, Ohio.......","created_at":"Mon Aug 07 10:58:09 +0000 2017","retweet_count":19426,"favorite_count":90640,"is_retweet":false,"id_str":"894512983384129536"},{"source":"Twitter for iPhone","text":"The Fake News refuses to report the success of the first 6 months: S.C., surging economy &amp; jobs,border &amp; military security,ISIS &amp; MS-13 etc.","created_at":"Mon Aug 07 01:18:08 +0000 2017","retweet_count":23061,"favorite_count":95347,"is_retweet":false,"id_str":"894367017054208001"},{"source":"Twitter for iPhone","text":"I love the White House, one of the most beautiful buildings (homes) I have ever seen. But Fake News said I called it a dump - TOTALLY UNTRUE","created_at":"Thu Aug 03 01:29:46 +0000 2017","retweet_count":32924,"favorite_count":137752,"is_retweet":false,"id_str":"892920397162848257"},{"source":"Twitter for iPhone","text":"Only the Fake News Media and Trump enemies want me to stop using Social Media (110 million people). Only way for me to get the truth out!","created_at":"Tue Aug 01 13:55:19 +0000 2017","retweet_count":33675,"favorite_count":140273,"is_retweet":false,"id_str":"892383242535481344"},{"source":"Twitter for iPhone","text":"I love reading about all of the \"geniuses\" who were so instrumental in my election success. Problem is, most don't exist. #Fake News! MAGA","created_at":"Sat Jul 29 23:15:57 +0000 2017","retweet_count":18571,"favorite_count":85767,"is_retweet":false,"id_str":"891437168798965761"},{"source":"Twitter for iPhone","text":"...about then candidate Trump.\" Catherine Herridge @FoxNews. So why doesn't Fake News report this? Witch Hunt! Purposely phony reporting.","created_at":"Thu Jul 27 13:45:22 +0000 2017","retweet_count":12467,"favorite_count":54808,"is_retweet":false,"id_str":"890568797941362690"},{"source":"Twitter for iPhone","text":"Is Fake News Washington Post being used as a lobbyist weapon against Congress to keep Politicians from looking into Amazon no-tax monopoly?","created_at":"Tue Jul 25 02:36:17 +0000 2017","retweet_count":17448,"favorite_count":63048,"is_retweet":false,"id_str":"889675644396867584"},{"source":"Twitter for iPhone","text":"So many stories about me in the @washingtonpost are Fake News. They are as bad as ratings challenged @CNN. Lobbyist for Amazon and taxes?","created_at":"Tue Jul 25 02:28:44 +0000 2017","retweet_count":13338,"favorite_count":55705,"is_retweet":false,"id_str":"889673743873843200"},{"source":"Twitter for iPhone","text":"Drain the Swamp should be changed to Drain the Sewer - it's actually much worse than anyone ever thought, and it begins with the Fake News!","created_at":"Mon Jul 24 10:40:28 +0000 2017","retweet_count":33079,"favorite_count":117414,"is_retweet":false,"id_str":"889435104841523201"},{"source":"Twitter for iPhone","text":"While all agree the U. S. President has the complete power to pardon, why think of that when only crime so far is LEAKS against us.FAKE NEWS","created_at":"Sat Jul 22 11:35:34 +0000 2017","retweet_count":17458,"favorite_count":72192,"is_retweet":false,"id_str":"888724194820857857"},{"source":"Twitter for iPhone","text":"Sean Spicer is a wonderful person who took tremendous abuse from the Fake News Media - but his future is bright!","created_at":"Sat Jul 22 01:46:33 +0000 2017","retweet_count":23056,"favorite_count":120240,"is_retweet":false,"id_str":"888575966259314691"},{"source":"Twitter for iPhone","text":"The Fake News is becoming more and more dishonest! Even a dinner arranged for top 20 leaders in Germany is made to look sinister!","created_at":"Wed Jul 19 00:59:56 +0000 2017","retweet_count":27469,"favorite_count":109127,"is_retweet":false,"id_str":"887477071160762369"},{"source":"Twitter for iPhone","text":"Fake News story of secret dinner with Putin is \"sick.\" All G 20 leaders, and spouses, were invited by the Chancellor of Germany. Press knew!","created_at":"Wed Jul 19 00:53:12 +0000 2017","retweet_count":26708,"favorite_count":98186,"is_retweet":false,"id_str":"887475373981696000"},{"source":"Twitter for iPhone","text":"With all of its phony unnamed sources &amp; highly slanted &amp; even fraudulent reporting, #Fake News is DISTORTING DEMOCRACY in our country!","created_at":"Sun Jul 16 11:15:10 +0000 2017","retweet_count":23939,"favorite_count":96428,"is_retweet":false,"id_str":"886544734788997125"},{"source":"Twitter for iPhone","text":"HillaryClinton can illegally get the questions to the Debate &amp; delete 33,000 emails but my son Don is being scorned by the Fake News Media?","created_at":"Sun Jul 16 10:35:44 +0000 2017","retweet_count":38330,"favorite_count":143851,"is_retweet":false,"id_str":"886534810575020032"},{"source":"Twitter for iPhone","text":"Remember, when you hear the words \"sources say\" from the Fake Media, often times those sources are made up and do not exist.","created_at":"Wed Jul 12 10:32:56 +0000 2017","retweet_count":31309,"favorite_count":117629,"is_retweet":false,"id_str":"885084555421634561"},{"source":"Twitter for iPhone","text":"If Chelsea Clinton were asked to hold the seat for her mother,as her mother gave our country away, the Fake News would say CHELSEA FOR PRES!","created_at":"Mon Jul 10 11:47:49 +0000 2017","retweet_count":26620,"favorite_count":108995,"is_retweet":false,"id_str":"884378624660582405"},{"source":"Twitter for iPhone","text":"...have it. Fake News said 17 intel agencies when actually 4 (had to apologize). Why did Obama do NOTHING when he had info before election?","created_at":"Sun Jul 09 12:06:30 +0000 2017","retweet_count":20187,"favorite_count":89030,"is_retweet":false,"id_str":"884020939264073728"},{"source":"Twitter for iPhone","text":"We will fight the #FakeNews with you! https://t.co/zOMiXTeLJq","created_at":"Sat Jul 08 18:17:24 +0000 2017","retweet_count":27003,"favorite_count":99318,"is_retweet":false,"id_str":"883751888491098112"},{"source":"Twitter for iPhone","text":"I will represent our country well and fight for its interests! Fake News Media will never cover me accurately but who cares! We will #MAGA!","created_at":"Fri Jul 07 07:44:07 +0000 2017","retweet_count":33937,"favorite_count":136965,"is_retweet":false,"id_str":"883230130885324802"},{"source":"Twitter for iPhone","text":"Dow hit a new intraday all-time high! I wonder whether or not the Fake News Media will so report?","created_at":"Mon Jul 03 21:10:25 +0000 2017","retweet_count":24956,"favorite_count":113935,"is_retweet":false,"id_str":"881983493533822976"},{"source":"Twitter for iPhone","text":"At some point the Fake News will be forced to discuss our great jobs numbers, strong economy, success with ISIS, the border &amp; so much else!","created_at":"Mon Jul 03 12:10:44 +0000 2017","retweet_count":31314,"favorite_count":131610,"is_retweet":false,"id_str":"881847676232503297"},{"source":"Twitter for iPhone","text":"I am thinking about changing the name #FakeNews CNN to #FraudNewsCNN!","created_at":"Sat Jul 01 22:08:37 +0000 2017","retweet_count":30847,"favorite_count":121832,"is_retweet":false,"id_str":"881273362454118400"},{"source":"Twitter for iPhone","text":"....the 2016 election with interviews, speeches and social media. I had to beat #FakeNews, and did. We will continue to WIN!","created_at":"Sat Jul 01 22:02:27 +0000 2017","retweet_count":18274,"favorite_count":89370,"is_retweet":false,"id_str":"881271809433374721"},{"source":"Twitter for iPhone","text":"I am extremely pleased to see that @CNN has finally been exposed as #FakeNews and garbage journalism. It's about time!","created_at":"Sat Jul 01 13:12:40 +0000 2017","retweet_count":41262,"favorite_count":151428,"is_retweet":false,"id_str":"881138485905772549"},{"source":"Twitter for iPhone","text":"Watched low rated @Morning_Joe for first time in long time. FAKE NEWS. He called me to stop a National Enquirer article. I said no! Bad show","created_at":"Fri Jun 30 12:55:08 +0000 2017","retweet_count":19328,"favorite_count":83669,"is_retweet":false,"id_str":"880771685460344832"},{"source":"Twitter for iPhone","text":"The #AmazonWashingtonPost, sometimes referred to as the guardian of Amazon not paying internet taxes (which they should) is FAKE NEWS!","created_at":"Wed Jun 28 13:06:14 +0000 2017","retweet_count":13407,"favorite_count":54720,"is_retweet":false,"id_str":"880049704620494848"},{"source":"Twitter for iPhone","text":"Some of the Fake News Media likes to say that I am not totally engaged in healthcare. Wrong, I know the subject well &amp; want victory for U.S.","created_at":"Wed Jun 28 10:58:59 +0000 2017","retweet_count":19282,"favorite_count":91340,"is_retweet":false,"id_str":"880017678978736129"},{"source":"Twitter for iPhone","text":"The failing @nytimes writes false story after false story about me. They don't even call to verify the facts of a story. A Fake News Joke!","created_at":"Wed Jun 28 10:49:22 +0000 2017","retweet_count":20564,"favorite_count":85278,"is_retweet":false,"id_str":"880015261004435456"},{"source":"Twitter for iPhone","text":"So they caught Fake News CNN cold, but what about NBC, CBS &amp; ABC? What about the failing @nytimes &amp; @washingtonpost? They are all Fake News!","created_at":"Tue Jun 27 12:47:17 +0000 2017","retweet_count":33366,"favorite_count":112223,"is_retweet":false,"id_str":"879682547235651584"},{"source":"Twitter for iPhone","text":"Fake News CNN is looking at big management changes now that they got caught falsely pushing their phony Russian stories. Ratings way down!","created_at":"Tue Jun 27 12:30:38 +0000 2017","retweet_count":33067,"favorite_count":121670,"is_retweet":false,"id_str":"879678356450676736"},{"source":"Twitter for iPhone","text":"Wow, CNN had to retract big story on \"Russia,\" with 3 employees forced to resign. What about all the other phony stories they do? FAKE NEWS!","created_at":"Tue Jun 27 10:33:42 +0000 2017","retweet_count":34028,"favorite_count":124621,"is_retweet":false,"id_str":"879648931172556802"},{"source":"Twitter for iPhone","text":"Well, the Special Elections are over and those that want to MAKE AMERICA GREAT AGAIN are 5 and O! All the Fake News, all the money spent = 0","created_at":"Wed Jun 21 03:48:37 +0000 2017","retweet_count":35330,"favorite_count":131758,"is_retweet":false,"id_str":"877372660455546880"},{"source":"Twitter for iPhone","text":"The Fake News Media hates when I use what has turned out to be my very powerful Social Media - over 100 million people! I can go around them","created_at":"Fri Jun 16 12:23:08 +0000 2017","retweet_count":29017,"favorite_count":135395,"is_retweet":false,"id_str":"875690204564258816"},{"source":"Twitter for iPhone","text":"Fake News is at an all time high. Where is their apology to me for all of the incorrect stories???","created_at":"Tue Jun 13 12:48:44 +0000 2017","retweet_count":23231,"favorite_count":96026,"is_retweet":false,"id_str":"874609480301936640"},{"source":"Twitter for iPhone","text":"The Fake News Media has never been so wrong or so dirty. Purposely incorrect stories and phony sources to meet their agenda of hate. Sad!","created_at":"Tue Jun 13 10:35:55 +0000 2017","retweet_count":25099,"favorite_count":97362,"is_retweet":false,"id_str":"874576057579565056"},{"source":"Twitter for iPhone","text":"The #FakeNews MSM doesn't report the great economic news since Election Day. #DOW up 16%. #NASDAQ up 19.5%. Drilling &amp; energy sector...","created_at":"Sun Jun 11 12:22:20 +0000 2017","retweet_count":24411,"favorite_count":99607,"is_retweet":false,"id_str":"873878061778907137"},{"source":"Twitter for iPhone","text":"Sorry folks, but if I would have relied on the Fake News of CNN, NBC, ABC, CBS, washpost or nytimes, I would have had ZERO chance winning WH","created_at":"Tue Jun 06 12:15:36 +0000 2017","retweet_count":26473,"favorite_count":108333,"is_retweet":false,"id_str":"872064426568036353"},{"source":"Twitter for iPhone","text":"Russian officials must be laughing at the U.S. &amp; how a lame excuse for why the Dems lost the election has taken over the Fake News.","created_at":"Tue May 30 11:04:48 +0000 2017","retweet_count":22034,"favorite_count":87501,"is_retweet":false,"id_str":"869509894688387072"},{"source":"Twitter for iPhone","text":"The Fake News Media works hard at disparaging &amp; demeaning my use of social media because they don't want America to hear the real story!","created_at":"Mon May 29 00:20:11 +0000 2017","retweet_count":29919,"favorite_count":116488,"is_retweet":false,"id_str":"868985285207629825"},{"source":"Twitter for iPhone","text":"Does anyone notice how the Montana Congressional race was such a big deal to Dems &amp; Fake News until the Republican won? V was poorly covered","created_at":"Sun May 28 12:45:45 +0000 2017","retweet_count":14925,"favorite_count":71019,"is_retweet":false,"id_str":"868810522942164993"},{"source":"Twitter for iPhone","text":"....it is very possible that those sources don't exist but are made up by fake news writers. #FakeNews is the enemy!","created_at":"Sun May 28 12:45:16 +0000 2017","retweet_count":13302,"favorite_count":60156,"is_retweet":false,"id_str":"868810404335673344"},{"source":"Twitter for iPhone","text":"Does anyone notice how the Montana Congressional race was such a big deal to Dems &amp; Fake News until the Republican won? V was poorly covered","created_at":"Sun May 28 12:40:33 +0000 2017","retweet_count":848,"favorite_count":3463,"is_retweet":false,"id_str":"868809214365487104"},{"source":"Twitter for iPhone","text":"....it is very possible that those sources don't exsist but are made up by fake news writers. #FakeNews is the enemy!","created_at":"Sun May 28 12:35:29 +0000 2017","retweet_count":1502,"favorite_count":5484,"is_retweet":false,"id_str":"868807940744126464"},{"source":"Twitter for iPhone","text":"Whenever you see the words 'sources say' in the fake news media, and they don't mention names....","created_at":"Sun May 28 12:34:44 +0000 2017","retweet_count":19254,"favorite_count":78731,"is_retweet":false,"id_str":"868807754231820291"},{"source":"Twitter for iPhone","text":"It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media.","created_at":"Sun May 28 12:33:03 +0000 2017","retweet_count":17617,"favorite_count":72408,"is_retweet":false,"id_str":"868807327130025984"},{"source":"Twitter for iPhone","text":"The Fake Media is working overtime today!","created_at":"Fri May 12 11:53:48 +0000 2017","retweet_count":20433,"favorite_count":80164,"is_retweet":false,"id_str":"862999243560288256"},{"source":"Twitter for iPhone","text":"The Roger Stone report on @CNN is false - Fake News. Have not spoken to Roger in a long time - had nothing to do with my decision.","created_at":"Wed May 10 12:57:16 +0000 2017","retweet_count":15780,"favorite_count":58364,"is_retweet":false,"id_str":"862290442129461249"},{"source":"Twitter for iPhone","text":"Biggest story today between Clapper &amp; Yates is on surveillance. Why doesn't the media report on this? #FakeNews!","created_at":"Mon May 08 22:50:45 +0000 2017","retweet_count":14305,"favorite_count":54604,"is_retweet":false,"id_str":"861715019674910721"},{"source":"Twitter for iPhone","text":"Sally Yates made the fake media extremely unhappy today --- she said nothing but old news!","created_at":"Mon May 08 22:43:39 +0000 2017","retweet_count":11260,"favorite_count":53342,"is_retweet":false,"id_str":"861713233786404864"},{"source":"Twitter for iPhone","text":"Director Clapper reiterated what everybody, including the fake media already knows- there is \"no evidence\" of collusion w/ Russia and Trump.","created_at":"Mon May 08 22:41:12 +0000 2017","retweet_count":17639,"favorite_count":67573,"is_retweet":false,"id_str":"861712617299210240"},{"source":"Twitter for iPhone","text":"General Flynn was given the highest security clearance by the Obama Administration - but the Fake News seldom likes talking about that.","created_at":"Mon May 08 11:57:42 +0000 2017","retweet_count":16501,"favorite_count":59930,"is_retweet":false,"id_str":"861550676505219073"},{"source":"Twitter for iPhone","text":"RT @FoxNews: .@POTUS: \"I'm not against the media. I'm against the FAKE media.\" #CashinIn https://t.co/F7mBIj7iVL","created_at":"Sun May 07 11:17:59 +0000 2017","retweet_count":9877,"favorite_count":0,"is_retweet":true,"id_str":"861178291671244800"},{"source":"Twitter for iPhone","text":"When will the Fake Media ask about the Dems dealings with Russia &amp; why the DNC wouldn't allow the FBI to check their server or investigate?","created_at":"Sun May 07 11:15:26 +0000 2017","retweet_count":18592,"favorite_count":68200,"is_retweet":false,"id_str":"861177649179373569"},{"source":"Twitter for iPhone","text":"Why is it that the Fake News rarely reports Ocare is on its last legs and that insurance companies are fleeing for their lives? It's dead!","created_at":"Fri May 05 23:29:45 +0000 2017","retweet_count":14503,"favorite_count":64403,"is_retweet":false,"id_str":"860637673744195584"},{"source":"Twitter for iPhone","text":"Wow,the Fake News media did everything in its power to make the Republican Healthcare victory look as bad as possible.Far better than Ocare!","created_at":"Fri May 05 23:22:22 +0000 2017","retweet_count":13976,"favorite_count":66676,"is_retweet":false,"id_str":"860635815277453313"},{"source":"Twitter for iPhone","text":"The Fake News media is officially out of control. They will do or say anything in order to get attention - never been a time like this!","created_at":"Thu May 04 11:02:54 +0000 2017","retweet_count":18941,"favorite_count":73565,"is_retweet":false,"id_str":"860087334519414784"},{"source":"Twitter for iPhone","text":"Don't let the fake media tell you that I have changed my position on the WALL. It will get built and help stop drugs, human trafficking etc.","created_at":"Tue Apr 25 12:36:28 +0000 2017","retweet_count":26296,"favorite_count":99995,"is_retweet":false,"id_str":"856849388026687492"},{"source":"Twitter for iPhone","text":"The two fake news polls released yesterday, ABC &amp; NBC, while containing some very positive info, were totally wrong in General E. Watch!","created_at":"Mon Apr 24 12:15:45 +0000 2017","retweet_count":9043,"favorite_count":46670,"is_retweet":false,"id_str":"856481786938916865"},{"source":"Twitter for iPhone","text":"Despite major outside money, FAKE media support and eleven Republican candidates, BIG \"R\" win with runoff in Georgia. Glad to be of help!","created_at":"Wed Apr 19 04:09:17 +0000 2017","retweet_count":15355,"favorite_count":77097,"is_retweet":false,"id_str":"854547423464759296"},{"source":"Twitter for iPhone","text":"The Fake Media (not Real Media) has gotten even worse since the election. Every story is badly slanted. We have to hold them to the truth!","created_at":"Mon Apr 17 12:17:59 +0000 2017","retweet_count":18607,"favorite_count":83488,"is_retweet":false,"id_str":"853945633903923200"},{"source":"Twitter for iPhone","text":"Anybody (especially  Fake News media) who thinks that Repeal &amp; Replace of ObamaCare is dead does not know the love and strength in R Party!","created_at":"Sun Apr 02 12:56:49 +0000 2017","retweet_count":16341,"favorite_count":80080,"is_retweet":false,"id_str":"848519587675201538"},{"source":"Twitter for iPhone","text":"It is the same Fake News Media that said there is \"no path to victory for Trump\" that is now pushing the phony Russia story. A total scam!","created_at":"Sat Apr 01 13:02:32 +0000 2017","retweet_count":22380,"favorite_count":86222,"is_retweet":false,"id_str":"848158641056362496"},{"source":"Twitter for iPhone","text":"Why doesn't Fake News talk about Podesta ties to Russia as covered by @FoxNews or money from Russia to Clinton - sale of  Uranium?","created_at":"Tue Mar 28 22:41:09 +0000 2017","retweet_count":25726,"favorite_count":86933,"is_retweet":false,"id_str":"846854703183020032"},{"source":"Twitter for iPhone","text":"Just watched the totally biased and fake news reports of the so-called Russia story on NBC and ABC. Such dishonesty!","created_at":"Thu Mar 23 12:18:33 +0000 2017","retweet_count":21324,"favorite_count":94648,"is_retweet":false,"id_str":"844886082663698436"},{"source":"Twitter for iPhone","text":"Just heard Fake News CNN is doing polls again despite the fact that their election polls were a WAY OFF disaster. Much higher ratings at Fox","created_at":"Mon Mar 20 12:35:14 +0000 2017","retweet_count":18554,"favorite_count":90586,"is_retweet":false,"id_str":"843803115044454402"},{"source":"Twitter for iPhone","text":"James Clapper and others stated that there is no evidence Potus colluded with Russia. This story is FAKE NEWS and everyone knows it!","created_at":"Mon Mar 20 10:35:28 +0000 2017","retweet_count":17306,"favorite_count":71349,"is_retweet":false,"id_str":"843772976151642112"},{"source":"Twitter for iPhone","text":"Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes.....","created_at":"Sat Mar 18 13:15:41 +0000 2017","retweet_count":21088,"favorite_count":95449,"is_retweet":false,"id_str":"843088518339612673"},{"source":"Twitter for iPhone","text":"Does anybody really believe that a reporter, who nobody ever heard of, \"went to his mailbox\" and found my tax returns? @NBCNews  FAKE NEWS!","created_at":"Wed Mar 15 10:55:30 +0000 2017","retweet_count":25824,"favorite_count":102694,"is_retweet":false,"id_str":"841966077005463553"},{"source":"Twitter for Android","text":"Don't let the FAKE NEWS tell you that there is big infighting in the Trump Admin. We are getting along great, and getting major things done!","created_at":"Tue Mar 07 14:14:03 +0000 2017","retweet_count":25982,"favorite_count":121937,"is_retweet":false,"id_str":"839116941956640768"},{"source":"Twitter for Android","text":"Russia talk is FAKE NEWS put out by the Dems, and played up by the media, in order to mask the big election defeat and the illegal leaks!","created_at":"Sun Feb 26 18:16:41 +0000 2017","retweet_count":24677,"favorite_count":113140,"is_retweet":false,"id_str":"835916511944523777"},{"source":"Twitter for Android","text":"FAKE NEWS media knowingly doesn't tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!","created_at":"Sat Feb 25 03:09:18 +0000 2017","retweet_count":26341,"favorite_count":108710,"is_retweet":false,"id_str":"835325771858251776"},{"source":"Twitter for Android","text":"Give the public a break - The FAKE NEWS media is trying to say that large scale immigration in Sweden is working out just beautifully. NOT!","created_at":"Mon Feb 20 14:15:42 +0000 2017","retweet_count":34840,"favorite_count":140919,"is_retweet":false,"id_str":"833681539997253636"},{"source":"Twitter for Android","text":"Don't believe the main stream (fake news) media.The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it.","created_at":"Sat Feb 18 13:31:53 +0000 2017","retweet_count":39020,"favorite_count":186074,"is_retweet":false,"id_str":"832945737625387008"},{"source":"Twitter for Android","text":"\"One of the most effective press conferences I've ever seen!\" says Rush Limbaugh. Many agree.Yet FAKE MEDIA  calls it differently! Dishonest","created_at":"Fri Feb 17 23:15:56 +0000 2017","retweet_count":21751,"favorite_count":120315,"is_retweet":false,"id_str":"832730328108134402"},{"source":"Twitter for Android","text":"The FAKE NEWS media (failing @nytimes, @NBCNews, @ABC, @CBS, @CNN) is not my enemy, it is the enemy of the American People!","created_at":"Fri Feb 17 21:48:22 +0000 2017","retweet_count":52654,"favorite_count":162368,"is_retweet":false,"id_str":"832708293516632065"},{"source":"Twitter for Android","text":"The FAKE NEWS media (failing @nytimes, @CNN, @NBCNews and many more)    is not my enemy, it is the enemy of the American people. SICK!","created_at":"Fri Feb 17 21:32:29 +0000 2017","retweet_count":112,"favorite_count":247,"is_retweet":false,"id_str":"832704292993847296"},{"source":"Twitter for Android","text":"Thank you for all of the nice statements on the Press Conference yesterday. Rush Limbaugh said one of greatest ever. Fake media not happy!","created_at":"Fri Feb 17 11:43:10 +0000 2017","retweet_count":26347,"favorite_count":150763,"is_retweet":false,"id_str":"832555987299082242"},{"source":"Twitter for Android","text":"The Democrats had to come up with a story as to why they lost the election, and so badly (306), so they made up a story - RUSSIA. Fake news!","created_at":"Thu Feb 16 14:39:52 +0000 2017","retweet_count":27003,"favorite_count":121137,"is_retweet":false,"id_str":"832238070460186625"},{"source":"Twitter for Android","text":"FAKE NEWS media, which makes up stories and \"sources,\" is far more effective than the discredited Democrats - but they are fading fast!","created_at":"Thu Feb 16 14:10:49 +0000 2017","retweet_count":19854,"favorite_count":99214,"is_retweet":false,"id_str":"832230758299340800"},{"source":"Twitter for Android","text":"The fake news media is going crazy with their conspiracy theories and blind hatred. @MSNBC &amp; @CNN are unwatchable. @foxandfriends is great!","created_at":"Wed Feb 15 11:40:32 +0000 2017","retweet_count":25838,"favorite_count":104434,"is_retweet":false,"id_str":"831830548565852160"},{"source":"Twitter for Android","text":"Just leaving Florida. Big crowds of enthusiastic supporters lining the road that the FAKE NEWS media refuses to mention. Very dishonest!","created_at":"Sun Feb 12 22:19:05 +0000 2017","retweet_count":25504,"favorite_count":141359,"is_retweet":false,"id_str":"830904083519242241"},{"source":"Twitter for Android","text":"While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network. They said technical difficulties!","created_at":"Sun Feb 12 12:14:16 +0000 2017","retweet_count":25000,"favorite_count":113074,"is_retweet":false,"id_str":"830751875578355713"},{"source":"Twitter for Android","text":"The failing @nytimes does major FAKE NEWS China story saying \"Mr.Xi has not spoken to Mr. Trump since Nov.14.\" We spoke at length yesterday!","created_at":"Fri Feb 10 13:35:50 +0000 2017","retweet_count":23732,"favorite_count":106953,"is_retweet":false,"id_str":"830047626414477312"},{"source":"Twitter for Android","text":"Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!","created_at":"Thu Feb 09 13:19:08 +0000 2017","retweet_count":14894,"favorite_count":73700,"is_retweet":false,"id_str":"829681034564341760"},{"source":"Twitter for iPhone","text":"'16 Fake News Stories Reporters Have Run Since Trump Won' https://t.co/0dHld5kiVc","created_at":"Wed Feb 08 15:54:01 +0000 2017","retweet_count":19076,"favorite_count":64126,"is_retweet":false,"id_str":"829357626798530561"},{"source":"Twitter for Android","text":"I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!","created_at":"Mon Feb 06 12:07:55 +0000 2017","retweet_count":23963,"favorite_count":125344,"is_retweet":false,"id_str":"828575949268606977"},{"source":"Twitter for Android","text":"Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.","created_at":"Mon Feb 06 12:01:53 +0000 2017","retweet_count":36259,"favorite_count":161819,"is_retweet":false,"id_str":"828574430800539648"},{"source":"Twitter for Android","text":"After being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost!","created_at":"Sat Feb 04 13:39:27 +0000 2017","retweet_count":17438,"favorite_count":102747,"is_retweet":false,"id_str":"827874208021639168"},{"source":"Twitter for Android","text":"Thank you to Prime Minister of Australia for telling the truth about our very civil conversation that FAKE NEWS media lied about. Very nice!","created_at":"Fri Feb 03 11:34:32 +0000 2017","retweet_count":32508,"favorite_count":148912,"is_retweet":false,"id_str":"827480386120929280"},{"source":"Twitter for Android","text":"Somebody with aptitude and conviction should buy the FAKE NEWS and failing @nytimes and either run it correctly or let it fold with dignity!","created_at":"Sun Jan 29 13:00:32 +0000 2017","retweet_count":22256,"favorite_count":111984,"is_retweet":false,"id_str":"825690087857995776"},{"source":"Twitter for Android","text":"The failing @nytimes has been wrong about me from the very beginning. Said I would lose the primaries, then the general election. FAKE NEWS!","created_at":"Sat Jan 28 13:04:58 +0000 2017","retweet_count":20740,"favorite_count":109402,"is_retweet":false,"id_str":"825328817833123840"},{"source":"Twitter for Android","text":"Congratulations to @FoxNews for being number one in inauguration ratings. They were many times higher than FAKE NEWS @CNN - public is smart!","created_at":"Wed Jan 25 02:16:19 +0000 2017","retweet_count":32107,"favorite_count":162721,"is_retweet":false,"id_str":"824078417213747200"}]